[
  {
    "text": "Thank you for posting this.... as much as I want to have a more personal connection with people here, I realize how that pre-disposes OP's to VERY bad advice and people who are suffering are often in an altered state that DOES NOT benefit others.\n\nThat's why I try to only reply to posts when I'm up and only make posts when I'm down (don't try to look for them I use multiple accounts and delete old posts and so should you guys for the sake of not being discriminated against for your problems, which are normal and sometimes feel extreme and can make the general public react to you irrationally because they don't understand).\n\nLove you guys so much, I wish everyone as much happiness as possible, especially coming up on the holidays.",
    "tone_score": {
      "neg": 0.126,
      "neu": 0.787,
      "pos": 0.087,
      "compound": -0.778
    }
  },
  {
    "text": "I think I broke this rule more than once in the past..I'm sorry guys I will think more before leaving a comment.",
    "tone_score": {
      "neg": 0.204,
      "neu": 0.796,
      "pos": 0.0,
      "compound": -0.4767
    }
  },
  {
    "text": "I agree \"pm me anytime\" is useless, imo if someone was that concerned, drop them a message not with a \"I'm here to help message me anytime\" but ask them what's up, people don't want to ask for help, especially in cases like this where someone's depression might feel silly even though it's not, I'm not sure on how much harm would come of it but possibly just being direct and making the person talk about it, starting with the concerning person might possibly be the way to do it",
    "tone_score": {
      "neg": 0.139,
      "neu": 0.727,
      "pos": 0.134,
      "compound": -0.3756
    }
  },
  {
    "text": "Here’s my story and experience with this- I posted on SW a long time ago and was targeted by a much older man (I was an 18 y/o girl) preying on vulnerable women. He offered to PM me and abused that. He first emotionally distanced me from my friends in the real world so I only relied on him for support. This is how he was able to make me codependent on him and would put up with other things so he could get what he wanted. \n\nHe convinced me I had a serious mental illness so I questioned my sanity so when he made stepped over a boundary I was just being “crazy”. He worked for the NCA. He told me he could “find me easily”. He got my personal details. I was terrified one day he would turn up at my house. \n\nA couple of other things happened, I eventually went to his work and had to give a statement. I’m pretty sure he lost his job for talking to me at work and abusing his power to manipulate a mentally ill teenager. I had to sit in a room with a bunch of two way mirrors and hidden cameras and talk about everything. They screened my laptop. I don’t know if my video was used in court I kind of left it all behind after that. \n\nBut anyway. All this came from one PM. You should never trust a random stranger not everyone is just looking out for you and wants to talk.",
    "tone_score": {
      "neg": 0.079,
      "neu": 0.884,
      "pos": 0.038,
      "compound": -0.7984
    }
  },
  {
    "text": "Had posted something here and someone PM’d me offering cbd oils for my depression. \n\nGlad my depression can help someone earn money /s",
    "tone_score": {
      "neg": 0.231,
      "neu": 0.592,
      "pos": 0.178,
      "compound": -0.4019
    }
  },
  {
    "text": "ahh shit.",
    "tone_score": {
      "neg": 0.783,
      "neu": 0.217,
      "pos": 0.0,
      "compound": -0.5574
    }
  },
  {
    "text": "This makes me feel better about the way PMs in response to my depressing posts make me feel.\n\nI never really feel comfortable with it.",
    "tone_score": {
      "neg": 0.187,
      "neu": 0.714,
      "pos": 0.099,
      "compound": -0.3834
    }
  },
  {
    "text": "This is the reason why I use large chat groups. Even with those who have been trained in supporting ppl,I feel they might get too drained out. There is one guy who suffers from depression n a slew of undiagnosed issues who always private messages me to respond to my issues which really annoys me. It's complicated cause he has personality issues too.",
    "tone_score": {
      "neg": 0.176,
      "neu": 0.782,
      "pos": 0.041,
      "compound": -0.8588
    }
  },
  {
    "text": "I think I get it. It makes sense since I've helped people through difficult situations through private chats, and it can be extremely distressing when the person you're trying to help is suicidal. I'm not a trained mental health professional, and yet I've already dealt with enough of that stuff for one lifetime. Unfortunately, I have a tendency to play the savior for other people whilst neglecting my own issues.",
    "tone_score": {
      "neg": 0.193,
      "neu": 0.742,
      "pos": 0.065,
      "compound": -0.8748
    }
  },
  {
    "text": "I'm sorry, I just realized that I broke this rule. Won't do it again.",
    "tone_score": {
      "neg": 0.291,
      "neu": 0.709,
      "pos": 0.0,
      "compound": -0.4767
    }
  },
  {
    "text": "This isn’t related to the post but can I message someone? I really need someone to talk to and I can’t post because it always says post failed",
    "tone_score": {
      "neg": 0.156,
      "neu": 0.844,
      "pos": 0.0,
      "compound": -0.6652
    }
  },
  {
    "text": "Shit, I just broke that rule, I just panicked when I saw a post of a young girl talking about harming herself.",
    "tone_score": {
      "neg": 0.5,
      "neu": 0.5,
      "pos": 0.0,
      "compound": -0.9186
    }
  },
  {
    "text": "As a (very) newcomer to this sub, I find this post to be sensible - I guess, but also extraordinarily sad.",
    "tone_score": {
      "neg": 0.206,
      "neu": 0.794,
      "pos": 0.0,
      "compound": -0.631
    }
  },
  {
    "text": "I just saw this now, ill read it",
    "tone_score": {
      "neg": 0.318,
      "neu": 0.682,
      "pos": 0.0,
      "compound": -0.4215
    }
  },
  {
    "text": "How can we block someone who has repeatedly sent PMs?",
    "tone_score": {
      "neg": 0.244,
      "neu": 0.756,
      "pos": 0.0,
      "compound": -0.4404
    }
  },
  {
    "text": "What if the person in question is in the verge of committing suicide?",
    "tone_score": {
      "neg": 0.268,
      "neu": 0.655,
      "pos": 0.077,
      "compound": -0.6369
    }
  },
  {
    "text": "I'm sad that this is discouraged😣I mean, I get it, but still.\ndoctors wont help, or prescribe meds. Family and friends are incapable or unwilling to help. Anonymous redditors are probably my last hope.",
    "tone_score": {
      "neg": 0.243,
      "neu": 0.584,
      "pos": 0.173,
      "compound": -0.3013
    }
  },
  {
    "text": "My bad. I did that shit. My apologies.",
    "tone_score": {
      "neg": 0.587,
      "neu": 0.413,
      "pos": 0.0,
      "compound": -0.7964
    }
  },
  {
    "text": "I always think about this story about a woman that was dead for two years in her apartment before her remains were found. This is how I imagine the end of my life will be. I’ll die alone, with no one missing a beat.",
    "tone_score": {
      "neg": 0.294,
      "neu": 0.706,
      "pos": 0.0,
      "compound": -0.9274
    }
  },
  {
    "text": "So disable comments completely? I don't understand how this can be avoided accurately.",
    "tone_score": {
      "neg": 0.179,
      "neu": 0.821,
      "pos": 0.0,
      "compound": -0.34
    }
  },
  {
    "text": "Please refresh your memory as often as you need to - the rules are always posted right there in the sidebar (\"community info\" on mobile), and we'll ensure the wiki stays highly visible as well.\n\nEdit: I'm also concerned that you might not have understood the post, actually, if the general idea of \"offering private contact as a first resort here leaves many people with depression feeling worse or at higher risk for abuse and/or suicide, even when done with the best of intentions\" is hard to remember. Please let us know if there's anything we can do to make the wiki page clearer.",
    "tone_score": {
      "neg": 0.153,
      "neu": 0.724,
      "pos": 0.123,
      "compound": -0.6943
    }
  },
  {
    "text": "> I feel that forced positivity has a worse effect on me than sad posts.\n\nYou're not alone, and this topic is one of the info wikis we're working on.",
    "tone_score": {
      "neg": 0.254,
      "neu": 0.607,
      "pos": 0.139,
      "compound": -0.6322
    }
  },
  {
    "text": "Yeah I agree. I don’t mind when people at least try but when they immediately send you a PM and say \"was upppp\" I immediately decline because I don’t want to deal with someone who clearly doesn’t get it. Especially when they ask \"what’s wrong, why are you depressed\", then why the hell did you lurk around on here and send me a private message then? It’s so fucked up.",
    "tone_score": {
      "neg": 0.243,
      "neu": 0.659,
      "pos": 0.098,
      "compound": -0.954
    }
  },
  {
    "text": "We made the wiki and this post to make people aware of the potential consequences of getting into private conversations because we know those consequences are hard to foresee.  \n\nWe don't mean to \"paint\" anyone, but although there are definitely predators out there, most of the people who offer private contact have nothing but friendly good intentions, but they don't have the information needed to understand the risks and downsides of getting into private conversations too early.  That's not their fault.",
    "tone_score": {
      "neg": 0.113,
      "neu": 0.817,
      "pos": 0.07,
      "compound": -0.4523
    }
  },
  {
    "text": "Yep. \n\nThe worst part is that most people who contact me directly are stupid bs advertisers or someone who’s just lurking and has no clue what depression is. I’ve made sure to report these people more, I don’t want to come of as a dick but they’re obviously breaking the rules.",
    "tone_score": {
      "neg": 0.214,
      "neu": 0.706,
      "pos": 0.08,
      "compound": -0.7622
    }
  },
  {
    "text": "Same! It sucks. When you’re just left all alone and they don’t respond back : (",
    "tone_score": {
      "neg": 0.285,
      "neu": 0.715,
      "pos": 0.0,
      "compound": -0.5848
    }
  },
  {
    "text": "> This is sort of counterproductive though. Most of the time, help isn't generalized, it's personalized by nature. \n\nUh, no it isn't.  We're not suggesting anything so superficial as lurkers happening to read exactly what they need to hear said to someone else.  Observing truly supportive exchanges is good for everyone's mental health, and a great learning experience for those who want to help but aren't sure how.  \n\n> Not everyone's depression look the same, some advice can trigger anxiety in others while it can be a wake-up call to some.  \n\nWhich is why we explicitly discourage advice.  \n\nFYI chats have been tried here many, many times and all have ended in disaster.  We've been forced to conclude that it's not a fit for our population and can't support any further attempts.",
    "tone_score": {
      "neg": 0.161,
      "neu": 0.709,
      "pos": 0.13,
      "compound": -0.8316
    }
  },
  {
    "text": "It's always difficult (and worrying) when someone gets attached to a resource or individual that just isn't able to provide the right support.  It happens sometimes at my IRL crisis line, most often because they've never had a supportive conversation before they talked to us, so they kind of \"imprint\" on us (we literally call them \"ducklings\").  It can happen for other reasons too, and no mattter how it comes about, the end result is that they are convinced that \"only X can help me\" and also that \"X has what I need\", both of which are almost always untrue.  This happens all too often even when nobody creates unrealistic expectations or makes - or at least implies - impossible promises  - but \"PM me anytime\" does both those things.  \n\n>  There is one guy who suffers from depression n a slew of undiagnosed issues who always private messages me to respond to my issues which really annoys me. It's complicated cause he has personality issues too.\n\nOne of the most difficult training issues at my agency is helping new responders set boundaries with people in crisis.  But it's absolutely necessary - maybe more necessary than with people *not* in crisis.  We harm people by *not* disrupting their unrealistic expectations that can never be met.  We also harm people when we try to give them what we simply haven't got.  So sometimes the best harm-reduction option is to say directly \"I'm really sorry, but I can't give you what you're asking me for\".   It can help to offer alternatives when we say that, even if they reject them in the moment.",
    "tone_score": {
      "neg": 0.163,
      "neu": 0.768,
      "pos": 0.069,
      "compound": -0.9858
    }
  },
  {
    "text": "Please help us by removing any rule-breaking responses. We catch as many as we can, but having any bad examples out there is a problem.",
    "tone_score": {
      "neg": 0.261,
      "neu": 0.629,
      "pos": 0.11,
      "compound": -0.7783
    }
  },
  {
    "text": "Not sure why you put this here, but from reading your history, it sounds like your current therapist isn't handling your disclosure of thoughts of suicide in a way that's helping you.  \n\nThis is, sadly, such a common problem that we have[this link](https://www.speakingofsuicide.com/2013/07/22/therapists-who-do-not-panic/) on our official resource list over at /r/SuicideWatch.",
    "tone_score": {
      "neg": 0.234,
      "neu": 0.672,
      "pos": 0.094,
      "compound": -0.873
    }
  },
  {
    "text": "If someone is harassing you in PMs, please report that to the admins.\n\nExactly how to block and/or report someone depends on which app or client you're using.   In the official mobile apps, both are available by tapping the three dot menu in the top right corner of each message in your PM list.",
    "tone_score": {
      "neg": 0.106,
      "neu": 0.826,
      "pos": 0.068,
      "compound": -0.5106
    }
  },
  {
    "text": "You can report a PM to the sitewide admins by clicking \"report\" on it or going to https://www.reddit.com/report/ - don't post usernames of spammers, please! \n\nI appreciate your wanting to report it - trying to proselytize to people when they're struggling with depression is not in any way okay or helpful, really sorry that happened.",
    "tone_score": {
      "neg": 0.172,
      "neu": 0.675,
      "pos": 0.152,
      "compound": -0.3149
    }
  },
  {
    "text": "> so can we chant on private in reddit or does it mean for every thing? Even reddit??\n\nSorry, I'm not sure exactly what this means.",
    "tone_score": {
      "neg": 0.142,
      "neu": 0.858,
      "pos": 0.0,
      "compound": -0.4218
    }
  },
  {
    "text": ">Observing truly supportive exchanges is good for everyone's mental health\n\nthis is not true, you're acting as if depression is the only mental health variable at play here. When you introduce other forms of mental health factors things gets complicated.\n\n&#x200B;\n\n> Which is why we explicitly discourage advice. \n\nSo what's the point of this sub? To circle jerk around depression? \n\n&#x200B;\n\n> FYI chats have been tried here many, many times and all have ended in disaster.  \n\nMakes sense.",
    "tone_score": {
      "neg": 0.195,
      "neu": 0.675,
      "pos": 0.13,
      "compound": -0.8156
    }
  },
  {
    "text": "If I have broken the rule on asking people on this sub to PM me, which I probably have, I apologize.",
    "tone_score": {
      "neg": 0.151,
      "neu": 0.78,
      "pos": 0.068,
      "compound": -0.4019
    }
  },
  {
    "text": "Though will all the rules stating \"Things you shouldn't be saying\" what's the point of saying anything?\n\nIt's just odd 🤨",
    "tone_score": {
      "neg": 0.108,
      "neu": 0.892,
      "pos": 0.0,
      "compound": -0.3182
    }
  },
  {
    "text": "So dont try to help cause we are too ignorant and that will make it worse? Alot of us reach out here because we have no one to turn to. Even medical professionals refuse some of us. I feel like I'd be safer in PM as opposed to on an open thread. Just my opinion.",
    "tone_score": {
      "neg": 0.185,
      "neu": 0.716,
      "pos": 0.1,
      "compound": -0.666
    }
  },
  {
    "text": "Yikes, that's awful :-(",
    "tone_score": {
      "neg": 0.733,
      "neu": 0.267,
      "pos": 0.0,
      "compound": -0.6705
    }
  },
  {
    "text": "40 yo, single father of 2 young children. Suffered depression since 7, anxiety started at same age. 100% disabled combat vet. I'm the most negative person alot of people have ever met. And I dont believe in anything, least of all any goodness in humanity. But do you believe any of that?",
    "tone_score": {
      "neg": 0.179,
      "neu": 0.786,
      "pos": 0.036,
      "compound": -0.7181
    }
  },
  {
    "text": "Your resources aren't very good tbh as someone who has truly suffered depression and anxiety since age 7.",
    "tone_score": {
      "neg": 0.414,
      "neu": 0.479,
      "pos": 0.107,
      "compound": -0.8086
    }
  },
  {
    "text": "> And i'm saying this is not true. OCD, and a lot of different types of neuropsychiatric disorders usually turns \"support\" from uneducated personnel, into support for destructive behaviors. \n\nCan you give me an example?\n\n> especially not the majority of suicidal people\n\nYou're not conflating depression and suicidality, are you?",
    "tone_score": {
      "neg": 0.187,
      "neu": 0.718,
      "pos": 0.095,
      "compound": -0.7575
    }
  },
  {
    "text": "Seems to me you got yourself into trouble by alluding to things you weren't prepared to share in the thread.",
    "tone_score": {
      "neg": 0.269,
      "neu": 0.731,
      "pos": 0.0,
      "compound": -0.6433
    }
  },
  {
    "text": "Stop wasting time and do your job!!!!1",
    "tone_score": {
      "neg": 0.548,
      "neu": 0.452,
      "pos": 0.0,
      "compound": -0.7243
    }
  },
  {
    "text": ">Can you give me an example?\n\nSure, if the person is suffering from say a mix of diagnoses and is getting support from reddit for depression for his/hers self described situation, that can very easily turn badly if the patient in question is actually suffering from different types of mental health disorders and is currently self harming, that support can turn into support for those destructive tendencies.\n\n&#x200B;\n\nAnother example would be psychosis for example.",
    "tone_score": {
      "neg": 0.215,
      "neu": 0.65,
      "pos": 0.135,
      "compound": -0.868
    }
  },
  {
    "text": "\"Got myself into trouble\"... Frankly, Take what you like & leave the rest:\nIt's more an issue of discretion...\n\nI can write, in EXPLICIT detail about the events of my past AND my present. Further, from my own experience, I'm fully aware that some minors unfortunately go through vile & reprehensible things. For this LATTER cause, knowing there's NO age filter on this platform, I won't give ALL of the salacious details of the abuse which led to my suicidal ideations prior to age 6. So, my private message stated as such & I asked the age of the enquirer. (14 yrs old). I then informed them because of that,  I'd give some of the details, but not all of them. Then I stated I remembered well from my experience how difficult the teen years are & that I couldn't fix anything or advise, however if they wanted a safe place to vent, they had my ear.\n\nAs a moderator are you counseling I openly speak of the sexual use & abuse which fostered my want of self destruction regardless of the possible (likely) presence of minors?",
    "tone_score": {
      "neg": 0.137,
      "neu": 0.813,
      "pos": 0.05,
      "compound": -0.9522
    }
  },
  {
    "text": "Read the rules, report inappropriate content.  When someone seems well-meaning, kindly direct them to the rule they don't seem to be aware of.  For anything really flagrant, message our modmail.  \n\nDo *not* encourage people who are *not* asking for support about depression *the mental illness*\n\n1. \"achievement\" or \"milestone\" posts and encouraging people who make them are all outside our mission\n\n2.  Any kind of bad life experience or situation (e.g. social injustice, lousy birthdays, bad breakups, any grief and loss) is *not* a mental illness.  Feeling bad for good reason is perfectly healthy.  So, again, all that's outside our mission and should be discouraged. \n\nSort by new, look for people in distress who haven't received quality replies and empathise with them.  \n\nNice jaunty bow you have on your tail there :-)",
    "tone_score": {
      "neg": 0.195,
      "neu": 0.627,
      "pos": 0.178,
      "compound": -0.7252
    }
  },
  {
    "text": "So, wouldn't that be a risk everywhere on the internet, no matter what?  Not sure that's in our power to prevent.  Nor how you're claiming it would be ameliorated by private conversation with untrained peers where there's no community scrutiny.  \n\nDidn't answer my question about depression versus suicidality, btw.",
    "tone_score": {
      "neg": 0.183,
      "neu": 0.744,
      "pos": 0.073,
      "compound": -0.7934
    }
  },
  {
    "text": "> As a moderator are you counseling I openly speak of the sexual use & abuse which fostered my want of self destruction regardless of the possible (likely) presence of minors?\n\nAbsolutely yes.  \n\nFirst, that type of content is common here and we don't ask OPs in need of support to censor themselves.  Second, most of the minors who come here have experienced a fairly comparable level of trauma.",
    "tone_score": {
      "neg": 0.176,
      "neu": 0.734,
      "pos": 0.09,
      "compound": -0.8275
    }
  },
  {
    "text": ">So, wouldn't that be a risk everywhere on the internet, no matter what?\n\nYes, which was my point. \n\n&#x200B;\n\n> Nor how you're claiming it would be ameliorated by private conversation with untrained peers where there's no community scrutiny. \n\nOh I don't. I think they're equal in their possibility to affect badly. But PMs probably open a different sets of difficulty from bad actors as well as depressed people generally having a bad effect on each other.",
    "tone_score": {
      "neg": 0.25,
      "neu": 0.672,
      "pos": 0.078,
      "compound": -0.9541
    }
  },
  {
    "text": "Last night I cried myself to sleep. I feel alone in this world. I don’t feel like I have anymore deep meaning relationships anymore. I can’t remember how it feels to be truly connected to someone. I don’t even know if I’ve ever had that. I feel like all my life has been a fight against my demons and now I am slowly letting them in. Life feels grim and hopeless.",
    "tone_score": {
      "neg": 0.183,
      "neu": 0.712,
      "pos": 0.104,
      "compound": -0.7184
    }
  },
  {
    "text": "I feel like I'm not a good enough person to ever break this unending cycle of depression, anxiety and trauma I've been in for the last decade and change. I don't think other people give much thought to me at all, but if they do they're probably disappointed with how I've turned out.",
    "tone_score": {
      "neg": 0.2,
      "neu": 0.769,
      "pos": 0.031,
      "compound": -0.8273
    }
  },
  {
    "text": "It's been horrible. Meds don't seem to faze me anymore, suicidal thoughts are back and I'm depriving myself of pretty much any social contact in the hopes people forget about me and I can pass without hurting them. I don't even wanna leave my room or get out of bed anymore. I've been gaining tons of weight, and wallowing in my own self-pity and lack of skills without actually fucking doing anything. Every day has become a complete struggle to go through and I almost pray every night for some deity to put me down because I'm dead weight on this world. I don't even want to get therapeutic help because it didn't do anything last time. Researching my meds I found out they're also used to treat schizophrenia and it's making me paranoid about my sanity. I just don't even know what to do anymore.",
    "tone_score": {
      "neg": 0.15,
      "neu": 0.732,
      "pos": 0.118,
      "compound": -0.7513
    }
  },
  {
    "text": "I can’t stop crying. I got an email critique that utterly devastated me and made me feel like I wasn’t making any process in my art at all. I haven’t cried this hard in years. It’s just all so overwhelming to me and I have no idea what to do next. The plan I had for myself to improve my portfolio in the beginning of the year feels like it just completely got derailed, and I feel helpless and foolish that I ever thought I had a good plan in the first place when I have no idea what I’m doing. \n\nMaybe it’s time to see a therapist again. I haven’t seen one for the past 2 years since I had to switch insurances but maybe it’s time to see one again.",
    "tone_score": {
      "neg": 0.14,
      "neu": 0.803,
      "pos": 0.058,
      "compound": -0.7605
    }
  },
  {
    "text": "Lately I took the effort to try and stop drinking. Managed to get into about 23-24 days of sobriety before relapsing recently. I feel kind of bad about it but I still want to get back on to try and stay off of it again. While alcohol may \"numb\" the pain of depression I know it will only worsen not only my depressive state but it would also severely affect my physical health as well. Not sure how this will play out but I genuinely want to find a way to get myself into a better place or headspace overall.",
    "tone_score": {
      "neg": 0.204,
      "neu": 0.669,
      "pos": 0.128,
      "compound": -0.9025
    }
  },
  {
    "text": "I am in so much emotional pain. All day I've been having crying fits. But when I cry it feels like it's not enough. Like it's not satisfying to express how deep the pain feels. I feel very lonely today like I'm the only person who exists on this planet type of loneliness. I wish someone could hold me and I could feel safe . I wish I wasn't in so much pain. I don't want to be in myself right now.",
    "tone_score": {
      "neg": 0.302,
      "neu": 0.525,
      "pos": 0.174,
      "compound": -0.9312
    }
  },
  {
    "text": "I want to die. I started cutting myself. I fucking hate it here. And I’m all alone. Literally I have absolutely no one. Everyone has better things to do and I respect it but it just sucks. I’m not a good person",
    "tone_score": {
      "neg": 0.337,
      "neu": 0.554,
      "pos": 0.11,
      "compound": -0.8642
    }
  },
  {
    "text": "I am way to old to be curled up in bed crying and wallowing in self pity but here I am…",
    "tone_score": {
      "neg": 0.177,
      "neu": 0.823,
      "pos": 0.0,
      "compound": -0.3919
    }
  },
  {
    "text": "This just never truly goes away now, does it? I find myself coming back to this place from time to time to talk about my mental health when it's spiraling out of control. It's weirdly comforting to know that there are people out there who understand. \n\nI've been neglecting my friends again. I don't know why I always sabotage perfectly fine friendships, why I cut people off entirely and disappear when I'm not doing well mentally. I just... Don't have the energy to reply to people? I really don't know. Maybe it's because I didn't want to be a downer so I just cut myself off entirely to prevent it? I don't even understand it myself. \n\nIt took me a few months to reply to this friend of mine. I finally got the courage to apologize to him after ghosting him for a long time. \"I'm so sorry I fell back into bad habits, I should've let you know that I was going through something instead of just disappearing\" I'm so disappointed and angry at myself. Why am I like this. There are people I haven't talked to in years because I was suicidal back then. I still haven't gotten the courage to apologize, after all these years. I don't know. I wish I wasn't the way I am.",
    "tone_score": {
      "neg": 0.175,
      "neu": 0.695,
      "pos": 0.13,
      "compound": -0.8689
    }
  },
  {
    "text": "struggling so much today.\n\nposted in an advice subreddit to ask about an interpersonal issue at work. got an automated message telling me it didn’t belong in that sub.\n\nposted in the bpd sub to ask if anyone had suggestions for how to cope with the issue (because I know my bpd is affecting how I feel about it and how I’m dealing with it). got a message telling me it didn’t belong in that sub, either.\n\nthere’s really nowhere I can talk about what I’m going through. nobody I can tell.\n\nunrelated, but I had to put my cat to sleep last week. I haven’t told a soul because I understand that nobody wants to hear it.\n\nno one wants to put up with me. I don’t blame them. I want to disappear.",
    "tone_score": {
      "neg": 0.078,
      "neu": 0.91,
      "pos": 0.011,
      "compound": -0.8271
    }
  },
  {
    "text": "I really need to be more compassionate to others. I've been rude and hurting others lately because of my own shit but that doesn't mean I can't be good for others.",
    "tone_score": {
      "neg": 0.261,
      "neu": 0.676,
      "pos": 0.063,
      "compound": -0.7195
    }
  },
  {
    "text": "Does anyone else get random bursts of competency and a \"I'll push through this\" mindset for a few days then just crash back down? I've had so many of those in the past few months and now I'm looking at my room that's filled with new unused exercise equipment and nice clothes that still have tags on them. Now I just feel even worse looking at them.",
    "tone_score": {
      "neg": 0.083,
      "neu": 0.876,
      "pos": 0.04,
      "compound": -0.4588
    }
  },
  {
    "text": "today’s my birthday. it’s my least favorite day of the year. i always take off work because i just end up breaking down crying at some point. this time is no different.",
    "tone_score": {
      "neg": 0.224,
      "neu": 0.776,
      "pos": 0.0,
      "compound": -0.777
    }
  },
  {
    "text": "spiraling tonight. my coworker is leaving for a better job, so her responsibilities will be assigned to me, on top of my current responsibilities. feeling trapped, inadequate and hopeless. every day is harder.",
    "tone_score": {
      "neg": 0.22,
      "neu": 0.63,
      "pos": 0.15,
      "compound": -0.5994
    }
  },
  {
    "text": "Here we go again. A bout of ugly crying and a tinge of hopelessness.\n\nWhy do I want to even get better? I can just fuck people up and drag down them with me, right.",
    "tone_score": {
      "neg": 0.361,
      "neu": 0.544,
      "pos": 0.095,
      "compound": -0.9136
    }
  },
  {
    "text": "i dont see a happy ending for myself. i feel like im wandering around without any direction. i feel so awful 24/7",
    "tone_score": {
      "neg": 0.282,
      "neu": 0.616,
      "pos": 0.103,
      "compound": -0.6558
    }
  },
  {
    "text": "Trying to stay away from any sort of dating. Trying to be ok on my own again. I just feel so lonely all the time and just so sad :(",
    "tone_score": {
      "neg": 0.277,
      "neu": 0.665,
      "pos": 0.058,
      "compound": -0.8485
    }
  },
  {
    "text": "I'm not okay.\n\nI'm really struggling coming to terms with a lot of things.  It really distresses me that things are unresolved in personal relationships.  I'm distressed about things going on in my family.  I made a post about suicidal ideation yesterday but I deleted it.  I feel such a heavy weight on my shoulders and I question myself all the time.\n\nI don't like who I am.  I am so bitter and angry.  It sucks all the energy out of me.  I am so resentful and hurt.  I feel like nobody cares and... it's so embarrassing being an adult and feeling like this.  It feels like this is something an angsty teenager would write, but it's how I feel.\n\nI feel like when I talk or write to people it's wrong or they look at me like I'm crazy.  I'm not crazy.  I feel like there's elements going on that are out of order that I'm apart of and I desperately want to detach myself from it.\n\nThe only peace I get is when I sleep.  The trouble starts as soon as I walk out the door.",
    "tone_score": {
      "neg": 0.324,
      "neu": 0.612,
      "pos": 0.064,
      "compound": -0.9956
    }
  },
  {
    "text": "I've read a lot on this forum about people sleeping their lives off and while I have been depressed for more than 20 years is until now that I understand where they are coming from. I wake up, work, and lay in bed for the rest of the day. This past week I have slept for around 14 hours a day. I just don't have the energy anymore to improve or even sustain a functional lifestyle.\n\nThis is getting from bad to worse.",
    "tone_score": {
      "neg": 0.138,
      "neu": 0.827,
      "pos": 0.034,
      "compound": -0.8322
    }
  },
  {
    "text": "am i really depressed or am i just objectively bland pointless braindead and an asshole",
    "tone_score": {
      "neg": 0.23,
      "neu": 0.77,
      "pos": 0.0,
      "compound": -0.5563
    }
  },
  {
    "text": "Sometimes I feel I was deliberately engineered to suffer, my combination of genes, social skills and status, the environment I was born in and the people that molded me in the most critical years made me a perfect test subject which only purpose in life is to be in constant excruciating pain. Be it emotional, social, physical or psychological.\n\nIt is like I'm some kind of machine or algorithm that has to gather and process data about suffering and then die.\n\nCan this nightmare end already, I already went through enough of this sadistic experiment.",
    "tone_score": {
      "neg": 0.189,
      "neu": 0.74,
      "pos": 0.071,
      "compound": -0.9312
    }
  },
  {
    "text": "I can't shake this feeling that I'm just spinning my wheels, that my best days are behind me, and not only did I not win the race, I didn't even finish and I'm heading to a lonely lonely future passing 40 years old, no wife, no kids, no job, no hope, everyone I grew up with became something special, someone special, had a life, had a dream, except for me. I'm so divorced from that reality I'd be like an alien from another world if they ever saw me again. What the fuck happened? How did I get here? It's like my life pulled up and did a drive-by shooting on me, and now I'm just a corpse watching an old vhs tape of a shitty life over and over everyday.",
    "tone_score": {
      "neg": 0.185,
      "neu": 0.666,
      "pos": 0.149,
      "compound": -0.7498
    }
  },
  {
    "text": "went to a coffee shop on my lunch break. the barista used to work with my sister and had heard about my grandma, who died suddenly last month.\n\nshe said, without prompting, “I’m so sorry about your grandma,” and I was honestly touched, because nobody else has told me that. nobody.\n\nshe then used my grandma’s death as a springboard to tell me about when she fell and cut her leg while hiking over the summer.\n\nI feel like I only exist so other people can use me.",
    "tone_score": {
      "neg": 0.121,
      "neu": 0.821,
      "pos": 0.059,
      "compound": -0.7042
    }
  },
  {
    "text": "I legitimately have an addiction to youtube. I'm on it nearly 24 hours a day (that's what it feels like). I'm on the website or app from the moment I wake up to the moment I go to sleep. It's really bad. It's easy to say to just delete the app or block the website with an extension, and I've tried but my life just feels so empty and lifeless and boring without it, I can't stay off for long. It takes up so much time and distracts from getting stuff done. I think it'd help if I had something to replace it with, but I have nothing.",
    "tone_score": {
      "neg": 0.119,
      "neu": 0.831,
      "pos": 0.05,
      "compound": -0.7693
    }
  },
  {
    "text": "God please kill me tonight while I'm sleeping. Amen",
    "tone_score": {
      "neg": 0.311,
      "neu": 0.397,
      "pos": 0.291,
      "compound": -0.3182
    }
  },
  {
    "text": "I feel very defeated by this daytime tiredness. I wanted to be productive and be able to get some kind of work done, but time has passed and I've not been able to produce anything of value. Nearly everyday I feel this guilt or disgust with myself for not getting anything done. But I just can't think clearly enough to do anything. My mind is so foggy. DAE feel this guilt and struggle with motivation and energy?",
    "tone_score": {
      "neg": 0.211,
      "neu": 0.693,
      "pos": 0.096,
      "compound": -0.8924
    }
  },
  {
    "text": "I think about dying every day. I don’t think about suicide, just dying. It isn’t an unwelcome thought. I feel so trapped in my life. My workplace is small and most of my coworkers are bigoted, including my manager, so my complaints get brushed aside. I get talked over all the time at work and then they have the nerve to act as though I don’t contribute anything. \n\nI’m in constant but low level pain; it isn’t debilitating but it is always there. Surgery wouldn’t fix it because it isn’t severe enough for it but all the other things are bandaid solutions.\n\nI want a cigarette so badly but I quit and I refuse to let all my problems in life win. \n\nMy sister totaled my car and it’s a stressful mess. I have to clean up after her and it pisses me off. I got it two months ago and yeah it was used but now I need to get another one and it is so hard to find a good affordable car that doesn’t have over 100,000 miles on it. \n\nI have no energy. I leave my apartment well before work to stare at the ducks before I have to go into the office and stare at screens and sit in a chair that strains my injuries and listen to all the gossip from my coworkers. I hate that this is all there is. I could move to another office but I’m sure it’ll be much of the same.",
    "tone_score": {
      "neg": 0.201,
      "neu": 0.705,
      "pos": 0.094,
      "compound": -0.9829
    }
  },
  {
    "text": "It’s kinda sad that the best part if my day is when I’m walking to work in the morning with earbuds in listening to whatever music I want. I’m alone, it’s early so no one is really around, and I feel at peace. I don’t feel lonely when I do it. I feel so alone at home with my roommate and when I’m at work surrounded by people. I’ve never felt like I belonged anywhere except when I’m by myself.",
    "tone_score": {
      "neg": 0.162,
      "neu": 0.736,
      "pos": 0.102,
      "compound": -0.5079
    }
  },
  {
    "text": "i dont want to leave my bed, i dont want to go to work, i hate myself, and i want to die",
    "tone_score": {
      "neg": 0.461,
      "neu": 0.492,
      "pos": 0.047,
      "compound": -0.8449
    }
  },
  {
    "text": "I can't fucking so this anymore I just wanna die i hate my life. It's pretty much over anyway. I have no where to go and nothing to do after I graduate. I don't have any skills that are actually useful. My talents only help me make funny silly things and my social anxiety makes any career of that sort impossible. What's the point if doing anything anymore? School is making me unhappy, why keep going? I'm only here for the social aspect and I'm barely taking advantage of if. I still don't have a girlfriend. I never will cuz nobody wants to date an awkward unstable weirdo with 3 mental illnesses and intense fear of intimacy or vulnerability. I just want someone who cares about me. Someone who actually legitimately cares about me. Someone who wants to talk to me so I don't feel completely useless. I just want to hug someone or have someone actually care when I'm upset. Nobody actually cares about me. I'm nothing. After I graduate I might as well just fucking kill myself cuz my life will be over. Idk what to do, i have to make major decisions soon but Idk what to do about any of them. I cannot fucking stand living with a couple anymore but I have nowhere else to go and nobody else to live with. I basically have 8 months to live. I want to take advantage of it but I know I won't be able to cuz my brain wants me to fail. I'm just so lonely, if there was one person that I could spend time with that could make life feel like it's worth living Idk I shouldn't rely on another person but that's all I need. Companionship, I'm too weird and stupid and awkward. I can barely talk to people anymore. Takibg a new med and as usual experiencing all the awful side effects. It's no use. I've tried dozens of meds at this point. I'll never get better I'll never function I'll never ever be a person worth existing, . my lack of a purpose is all i have. Fuck I just can't i hate myself so much why can't i just have a happy life god fucking family no just wanna fumxing die)",
    "tone_score": {
      "neg": 0.187,
      "neu": 0.708,
      "pos": 0.105,
      "compound": -0.9903
    }
  },
  {
    "text": "read a conversation on a sub for therapists that boiled down to: \"mentally ill people can't usually keep a job, and the ones who can usually have an illness that's mild and easily medicated.\"\n\nthis mindset is exactly why I can't get help.\n\nno doctor or therapist has ever believed that I'm depressed, because I have a demanding job -- and if I'm performing consistently at work, that must mean I'm fine.\n\nit feels unfair.",
    "tone_score": {
      "neg": 0.195,
      "neu": 0.73,
      "pos": 0.074,
      "compound": -0.8741
    }
  },
  {
    "text": "Sighs. I am crying rn. I had 2 rough days. \n\nAnd also made a mistake and became akin to Satan. \n\nI tried apologising & to fix it. Apparently I am not worth it. \n\nFuck my life. \n\nIts almost my birthday. Man, I wish I could die on that day. So ironic. Bitch of a life.",
    "tone_score": {
      "neg": 0.284,
      "neu": 0.603,
      "pos": 0.113,
      "compound": -0.8803
    }
  },
  {
    "text": "Work is miserable today. \nI feel like I'm either missing something or things are suddenly dropping on me. \nTrying to look at the big picture but it hurts to keep going today.",
    "tone_score": {
      "neg": 0.214,
      "neu": 0.738,
      "pos": 0.048,
      "compound": -0.7269
    }
  },
  {
    "text": "Been depressed since I was 13. Almost 53 now and I can’t go any farther. My life is a mess and I can’t fight anymore.",
    "tone_score": {
      "neg": 0.318,
      "neu": 0.682,
      "pos": 0.0,
      "compound": -0.8126
    }
  },
  {
    "text": "I am really worried about my teeth, going to the dentist hopefully will have any worries resolved. I find myself grieving times when I was happy that I don't think can ever happen again. I go back and reminisce on those times involuntarily to the point that I'm not even in this timeline, I am pulled back to the early 2010s again and again, the time when I feel I was the happiest I'd ever been. I keep romanticizing that time knowing full well it wasn't perfect, I was still dealing with a lot of problems then. They just weren't as glaringly obvious. My problems were just beginning to blossom back then, under the top layer of exhilarating \"finding myself\" in college, socializing, making art, there was still a lot of pain and serious problems I wasn't taking care of. They hadn't impacted my health  or bank account yet. But it had always been there.",
    "tone_score": {
      "neg": 0.118,
      "neu": 0.79,
      "pos": 0.093,
      "compound": -0.4422
    }
  },
  {
    "text": "Things are progressively getting worse. I haven’t had a day as bad as today in years. I’ve made it my goal to find a therapist by the end of the week. I’m sick of dealing with this much hurt every day.",
    "tone_score": {
      "neg": 0.281,
      "neu": 0.719,
      "pos": 0.0,
      "compound": -0.9231
    }
  },
  {
    "text": "one die, please",
    "tone_score": {
      "neg": 0.542,
      "neu": 0.139,
      "pos": 0.319,
      "compound": -0.3818
    }
  },
  {
    "text": "every day gets worse and worse. cant even have the energy to formulate coherent words anymore. yeah im functioning in my day to day life but still feel so empty.",
    "tone_score": {
      "neg": 0.203,
      "neu": 0.708,
      "pos": 0.089,
      "compound": -0.6123
    }
  },
  {
    "text": "If you want me dead God, just strike me down and get it over with. Otherwise I’m going to war on this hell. Fucking misery. I’ll live just to spit in the face of the odds. 3 good people I know killed themselves. Another one is slowly killing themselves, and I had to sit by and watch. Fuck you reality. You can’t kill or break me. YOU CANT KILL ME",
    "tone_score": {
      "neg": 0.354,
      "neu": 0.54,
      "pos": 0.106,
      "compound": -0.9814
    }
  },
  {
    "text": "I thought I was doing better, last semester I had the worst semester long break down I think I’ve ever experienced. I almost did the thing twice, the thought of my parents stopped me both times. Over summer I was purely working on myself and getting comfortable with myself and such. This semester has been great so far but I’ve noticed some issues, depressive episodes on and off during the day sometimes at night and I’ve gotten drunk a couple of times and was told that I worried my roommates bc they saw what was really behind my smile, how sad I really am, how depressed I am. Just yesterday it took me saying “I am not stable” out loud to realize that I am not as stable as I thought. I feel lost, empty, hollow and I don’t feel comfortable in my own skin. I’m not looking for help anymore, I’ve tried that route and it brought more pain than relief for me. I wish everyone the best on this subreddit.",
    "tone_score": {
      "neg": 0.185,
      "neu": 0.674,
      "pos": 0.141,
      "compound": -0.7853
    }
  },
  {
    "text": "I just want to die. Like I don’t find the point of living anymore. I keep mentioning it to other people that I just don’t feel like going on anymore and no One seems to understand the severity of it. Im currently pregnant and thought about ending my life once I give birth. I don’t feel worthy of being a mom, a girlfriend, a daughter, a student. It’s like I just ruined my life and I have so many people around me to remind me that I ruined my life",
    "tone_score": {
      "neg": 0.134,
      "neu": 0.739,
      "pos": 0.127,
      "compound": -0.3818
    }
  },
  {
    "text": "My biggest disappointment in this world is myself.\n\nI'm tired. I'm tired. I'm tired of everything. Is there any way to end all of this.\n\nI'm scared. I'm afraid. \n\nDon't go. Don't leave me. Don't abandon me. I'm scared. I'm scared",
    "tone_score": {
      "neg": 0.388,
      "neu": 0.569,
      "pos": 0.043,
      "compound": -0.9545
    }
  },
  {
    "text": "a few days ago, for the first time in forever, i decided that life was pretty okay. i was happy. that lasted.... a day. why can't feeling okay ever last longer than that? why do i always have to get tossed back into this? \n\nand what sucks is i thought i had finally started to manage it. i thought it was easier to fight. now i'm back to feeling that horrible emptiness in my chest, and it won't go away. i can't even sleep normally. i have to stay up and distract myself until i'm so exhausted that my brain can't focus on anything but sleep. then i sleep all day, wake up at around 7pm, and do it all over again. \n\ni just wish it didn't hurt so bad.",
    "tone_score": {
      "neg": 0.147,
      "neu": 0.734,
      "pos": 0.119,
      "compound": -0.454
    }
  },
  {
    "text": "I miss who I used to be. I am a burden on everybody in my close circle. I’m not okay.",
    "tone_score": {
      "neg": 0.322,
      "neu": 0.678,
      "pos": 0.0,
      "compound": -0.6329
    }
  },
  {
    "text": "The only thing that keeps me from ending it all is guilt. Every day feels like hell.",
    "tone_score": {
      "neg": 0.289,
      "neu": 0.603,
      "pos": 0.108,
      "compound": -0.6369
    }
  },
  {
    "text": "Might I add we shouldn’t allow posts which romanticize depression either? I.E reject any post which suggest “depression is okay but society is bad “ ? Not saying I’m against free speech but I find this sub has a fair share of people truly suffering and the last thing we need is for the sub to get infiltrated by the woke “mental health awareness “ bandwagon who have a tendency to deny any objective understanding of depression in favor of some essentialized “nothing wrong with depression “ framework .",
    "tone_score": {
      "neg": 0.263,
      "neu": 0.546,
      "pos": 0.191,
      "compound": -0.9083
    }
  },
  {
    "text": "Even here I feel like a bother and stupid and cringe.",
    "tone_score": {
      "neg": 0.406,
      "neu": 0.42,
      "pos": 0.175,
      "compound": -0.5106
    }
  },
  {
    "text": "I hate making mistakes at work.  It sends me into a deep depression.  I forgot to do something yesterday that was so easy to remember and quick to do, and it might have fouled up a project.  I don't know yet.  So I'm waiting to find out what the fallout is.",
    "tone_score": {
      "neg": 0.178,
      "neu": 0.755,
      "pos": 0.067,
      "compound": -0.7318
    }
  },
  {
    "text": "This is the lowest moment of my life, I am entirely devoid of joy, I'm being bullied in school, I'm struggling to keep my friends, and those I do have, I'm not very close with. I don't  know who I am. I have somany dreams that will never come true, no matter how plausible they are, I will never go to Germany, I will never own my dream car, I will never have a close friend. that is all",
    "tone_score": {
      "neg": 0.184,
      "neu": 0.67,
      "pos": 0.146,
      "compound": -0.5185
    }
  },
  {
    "text": "it hasn't been a good week. just.. feeling so worthless. i'm tired of feeling like this, tired of being me. i don't know how much more i can take. i just want to run away. i want to be happy. above all, i hope i can learn to be kind to myself, because that's the most difficult thing right now. \n\ni'm dreading waking up and going to work again. this cycle is going to ruin me. my life is all work, work, work. i feel sick to my stomach every morning, every night.\n\ni ghosted all of my friendships and it's pathetic. i don't even know how or when i'll be able to reach out again. i don't know if they'll even understand. it's not like i'll even tell people about how i really feel, deep down inside, because i'm always amazing at sabotaging myself. i hate feeling so sad and anxious. my brain cannot turn off and it's a miracle i've made it this far in life. everything leaves me so drained and i don't have the energy anymore to live.",
    "tone_score": {
      "neg": 0.203,
      "neu": 0.643,
      "pos": 0.154,
      "compound": -0.938
    }
  },
  {
    "text": "I feel suicidal, and I am not even in a bad mood... I don't get how this shit works anymore. It's just something that makes perfect sense for some reason. Maybe it's a matter of habit.\r  \nSucks that I kinda have to choose between the dentist and the psychiatrist when it comes to money...\r  \nSomething's been so off with me this whole month",
    "tone_score": {
      "neg": 0.161,
      "neu": 0.73,
      "pos": 0.109,
      "compound": -0.6808
    }
  },
  {
    "text": "I'm not coping, I need help, and there's no-one in my life any more who can help. Just losing control of basic day to day tasks and it's all spiraling out of control.",
    "tone_score": {
      "neg": 0.197,
      "neu": 0.803,
      "pos": 0.0,
      "compound": -0.7283
    }
  },
  {
    "text": "Really lonely right now. Haven't talked to anyone in months besides parents.",
    "tone_score": {
      "neg": 0.202,
      "neu": 0.798,
      "pos": 0.0,
      "compound": -0.4201
    }
  },
  {
    "text": "Been on this sub longtime had make new accnt.Anyway my depression is way worse and my health is not so good.",
    "tone_score": {
      "neg": 0.353,
      "neu": 0.647,
      "pos": 0.0,
      "compound": -0.8698
    }
  },
  {
    "text": "God, so my parents have been getting more involved with my mental health. Due to having the police involved in wellness checks and my therapist making me stay with them because the hospital had no space- and I feel like a fucking walking DSM. Constantly trying to explain depression/dysthymia, ADHD, social anxiety to them and a lot of the time with the depression stuff they say that doesn't make sense- ex. sleeping 14 hours but still being tired. Well DUH thats why its a fucking mental ILLNESS. Explaining how shitty I feel just makes me feel even more whiny and like a burden. Ugh.",
    "tone_score": {
      "neg": 0.217,
      "neu": 0.692,
      "pos": 0.091,
      "compound": -0.9553
    }
  },
  {
    "text": "I've been on lexapro for over ten years and am afraid they're losing effectiveness as I have been experiencing intense emotional blunting lately. I don't feel happy or sad, I feel nothing and have little interest in things at the moment. I am afraid of the chance I will have to readjust or try something else because it's such a nightmare tapering off them. I think I'm on the highest dose right now, not sure what that is but my doc said it was the limit. I definitely don't want to be a lifeless zombie forever, but also don't want to fly off the handle and attempt suicide during the in-between phase of tapering off or adjusting to new meds or something.",
    "tone_score": {
      "neg": 0.128,
      "neu": 0.798,
      "pos": 0.074,
      "compound": -0.7841
    }
  },
  {
    "text": "I hate working. I don't want to work. But if I don't work, I can't get the things I want, go to the places I want, or meet the people I want. I wish I could just be dead so I don't have to feel so trapped in this world, in this human society.",
    "tone_score": {
      "neg": 0.33,
      "neu": 0.61,
      "pos": 0.06,
      "compound": -0.9314
    }
  },
  {
    "text": "It’s so hard to deal with depression when your family is also a disaster and you have to take care of them and make sure everyone gets along",
    "tone_score": {
      "neg": 0.257,
      "neu": 0.595,
      "pos": 0.149,
      "compound": -0.6115
    }
  },
  {
    "text": "I feel trapped in my life. I don’t want to live with my sibling anymore. I hate my job. I’m so sick of being at a workplace where not a single soul cares what I have to say. It wears me down and I can’t bear it. It’s painful and I feel so isolated.",
    "tone_score": {
      "neg": 0.328,
      "neu": 0.65,
      "pos": 0.022,
      "compound": -0.9607
    }
  },
  {
    "text": "Even minor inconveniences makes me want to die, or vanish. This is ridiculous, but I don’t know how to deal with it",
    "tone_score": {
      "neg": 0.18,
      "neu": 0.771,
      "pos": 0.049,
      "compound": -0.4678
    }
  },
  {
    "text": "Feel so sad bruh I'm tired of life. I feel like crying",
    "tone_score": {
      "neg": 0.497,
      "neu": 0.371,
      "pos": 0.132,
      "compound": -0.7841
    }
  },
  {
    "text": "i hate that i always go to such far lengths to make someone happy when they would never do the same for me :(",
    "tone_score": {
      "neg": 0.225,
      "neu": 0.648,
      "pos": 0.126,
      "compound": -0.4404
    }
  },
  {
    "text": "I decided to bite the bullet and admit myself to a residential treatment program at a behavioral health center. It's for adults with depression and due to health issues earlier this year, my out-of-pocket maximum and my deductible were met a while ago, so it's all gonna be covered, according to my insurance company. And I'm getting booted off my parents' insurance at the end of this year since I'm turning 26, so there's no better time to do it. I feel kind of guilty though because I'll be stranding my workplace (again) and my fiancé is really sad about it.",
    "tone_score": {
      "neg": 0.118,
      "neu": 0.836,
      "pos": 0.046,
      "compound": -0.8272
    }
  },
  {
    "text": "Why do I always get the shit end of the stick when I try to do things to help myself get out of this fucking depression? Everytime something goes right for once, one fucked up thing is right around the corner waiting. I just want to make a life for myself just like everyone else is doing, why am I having to struggle to the max for mine? \n\nThis life is most definitely a bitch.",
    "tone_score": {
      "neg": 0.171,
      "neu": 0.677,
      "pos": 0.152,
      "compound": -0.563
    }
  },
  {
    "text": "Life is truly hell at this point, who knows what unholy thing I did in a previous life to deserve this one. Every interaction appears to be designed in some way to bring me down to my knees no matter what I try.\n\nI came here to suffer and nothing else.",
    "tone_score": {
      "neg": 0.183,
      "neu": 0.746,
      "pos": 0.071,
      "compound": -0.8074
    }
  },
  {
    "text": "I'm smart enough to know how terrible society is, yet too dumb to live in it. It's just not worth the effort or the risks.",
    "tone_score": {
      "neg": 0.309,
      "neu": 0.609,
      "pos": 0.082,
      "compound": -0.7555
    }
  },
  {
    "text": "Why couldn't I be better?  I want to do good.  I want to help people.  Yet, it is such a struggle for me.  Why do I have to be stuck a broken person.  I just wish I could have been born normal. Just live a simple and happy life, while being able to make connections and do what I need to do.  Instead, I am currently attempting to get drunk and dreading the next day and upcoming week.",
    "tone_score": {
      "neg": 0.212,
      "neu": 0.647,
      "pos": 0.141,
      "compound": -0.4678
    }
  },
  {
    "text": "I'm a paramedic who works for the busiest service in my state. I did everything I was supposed to do. I got vaccinated as soon as it was offered to me. I stayed even as many of my coworkers left. I thought I could make a difference. I even had some hope at the beginning of this year that we'd be seeing the beginning of the end of the pandemic as the vaccines rolled out.\n\nBut we all know how that turned out. I'm tired of it all. I'm tired of having to take care of patients who cuss me out at even the mention of COVID. I'm tired of ER nurses bitching at me for bring them more patients because their hospital is on diversion, when ALL of the hospitals are on diversion. I'm tired of our county commissioners putting their fingers in their ears about any mention of pay increases to prevent further staff from leaving. I'm tired of being the closest unit to every call because we have no ambulances available.\n\nI'm exhausted all of the time. Nothing sounds fun anymore. I feel like I'm just going through the motions of life. My sleep schedule is fucked. I've been nightshift for three years with no indication of that situation changing any time soon. No one else is awake when I am and it's incredibly lonely. I've been drinking more than I probably should to cope. I've been taking benadryl to sleep. I'm frequently having thoughts of self-harm these days when I had been doing fine for nearly a decade.\n\nI'm hoping my appointment with my PCP later this week can address some of these issues because I don't know how much longer I can hold out for.",
    "tone_score": {
      "neg": 0.152,
      "neu": 0.796,
      "pos": 0.052,
      "compound": -0.9872
    }
  },
  {
    "text": "My mom told me last night that she was waiting for me to get my life settled before she could die peacefully. It was a random topic but she was drunk. And then there's me, who's actively waiting for my parents to die first so I could off myself lol.",
    "tone_score": {
      "neg": 0.177,
      "neu": 0.68,
      "pos": 0.143,
      "compound": -0.4678
    }
  },
  {
    "text": "I'm so disengaged from work that it's almost ridiculous. I felt stressed and depressed for a month, but I'm feeling slightly better now because I have interviews lined up. I feel more secure knowing that I will get out. To reduce the stress, I have been doing the bare minimum at work. The mornings are the worst because I dread waking up. Since I hate going to work, I also sleep late. They call it the \"bedtime revenge procrastination\".",
    "tone_score": {
      "neg": 0.295,
      "neu": 0.614,
      "pos": 0.091,
      "compound": -0.9667
    }
  },
  {
    "text": "Not sure if I belong here. often feels like I don't quite belong anywhere, but guess I can say how I'm feeling if that's alright.\n\nCurrently have cried twice today in the office so things are not going so well today. I hate it here and want to start my own business. I have no energy the last month or so to work on but I also feel guilty for not having energy to work on my business. This cycle is not fun. I'm realizing it's a constant theme in my life. I worked hard for a personal project, reached my goal or arms reach of my goal, then I crash and burn with no energy to move forward. Like a rocket that only has enough fuel to clear the atmosphere, so instead of getting to the moon I'm floating aimlessly insight of my destination, unable to reach it. I feel like everyone hates me because of this, though I know logically that's not true. \n\nI just want to go home and lay down. maybe disappear but that'd really make everyone mad at me.",
    "tone_score": {
      "neg": 0.193,
      "neu": 0.65,
      "pos": 0.157,
      "compound": -0.932
    }
  },
  {
    "text": "I just found out my hep c they said was getting better originally is not getting better. They want me to start meds ASAP. I feel like I wasted a lot of time and now it will be way more getting meds through insurance. I hate our system. I hate myself. I hate this whole planet. Hopefully the volcanos all blow at once or we get a big asteroid or something. Im sick of everything.",
    "tone_score": {
      "neg": 0.205,
      "neu": 0.652,
      "pos": 0.143,
      "compound": -0.8074
    }
  },
  {
    "text": "I feel so numb today. Not sad. I didn't cry today. I just dont really feel anything. I had a session with a psychologist and for some reason I keep thinking this one's gonna make a difference. Even though I've been going to sessions for more than half a year and never felt anything change. I'm so tired to thinking right now. I wish I could walk away from all this and never have to deal with it.",
    "tone_score": {
      "neg": 0.113,
      "neu": 0.818,
      "pos": 0.069,
      "compound": -0.5155
    }
  },
  {
    "text": "I keep trying new things (drawing, writing) but it never takes me anywhere. Constantly depressed regardless of what I try. I hate everything",
    "tone_score": {
      "neg": 0.345,
      "neu": 0.655,
      "pos": 0.0,
      "compound": -0.8885
    }
  },
  {
    "text": "things have been going well at work. getting more responsibilities, so i feel like i'm valued and i'm good at what i do.\n\nbut it all ends there. i'm literally nothing without my career--just a husk of pain, loneliness and sadness.",
    "tone_score": {
      "neg": 0.238,
      "neu": 0.616,
      "pos": 0.146,
      "compound": -0.8253
    }
  },
  {
    "text": "I feel tired. I can't stand work. I cringe everytime I go there. \n\nFor 5 years, I was my wife's rock while she went through long bouts of depression. For some reason, I can't go to her even though shes told me she sees how unhappy I am and that I put up a brave face.\n\nI feel unhappy with the way I look. Its difficult. It's like there's no end.",
    "tone_score": {
      "neg": 0.229,
      "neu": 0.691,
      "pos": 0.08,
      "compound": -0.875
    }
  },
  {
    "text": "I'm not doing well lately. I lost my appetite, had trouble sleeping early, and I am struggling to survive my transition into a new job. I stopped working on my hobbies because I lost the motivation, but I plan to pick up my hobbies again once the madness is over. \n\nEven after adulting for years, I still feel that the world is a very dangerous place. I am always taken advantage of. The powerlessness sucks.",
    "tone_score": {
      "neg": 0.267,
      "neu": 0.681,
      "pos": 0.052,
      "compound": -0.9371
    }
  },
  {
    "text": "Having an anxiety attack right now",
    "tone_score": {
      "neg": 0.545,
      "neu": 0.455,
      "pos": 0.0,
      "compound": -0.5859
    }
  },
  {
    "text": "Honestly, I don't even know where I stand. I'm depressed but also feel so empty. And it never helps when people tell me that I'm worthless and pathetic then say I'm being immature for not \"getting over it.\" It's just been too much and the only reason I'm still alive is to finish writing these books. After that, I really don't see a reason to keep going.\n\nI can't get any energy to eat and all I want to do is stay in bed. I can barely get the energy to work and it's getting hard for me to do anything I love. I haven't been able to draw or write, I can't cook, I can't even play games, at least not without the fear someone's going to come out and tell me that my life and everything I do is meaningless. No matter what I do it all just comes hurdling to a stop. I can barely motivate myself and seeing that everyone thinks I'm a worthless piece of junk just doesn't help.",
    "tone_score": {
      "neg": 0.224,
      "neu": 0.691,
      "pos": 0.085,
      "compound": -0.9792
    }
  },
  {
    "text": "i can barely manage to leave my bed. i cant function like a normal human anymore. i dropped a couple classes in college but im still struggling to keep up. depression is hitting so fucking hard. i dont know what to do anymore",
    "tone_score": {
      "neg": 0.279,
      "neu": 0.699,
      "pos": 0.023,
      "compound": -0.9141
    }
  },
  {
    "text": "If this job I interviewed for doesn't work out then I'm done. I have nothing and no one. I am so tired of fighting with every fiber of my being to continue a life of misery and loss, a life of broken dreams and hopeless futures.\n\nMy soul is already dead. I yearn to follow it.",
    "tone_score": {
      "neg": 0.334,
      "neu": 0.599,
      "pos": 0.067,
      "compound": -0.9602
    }
  },
  {
    "text": "I have a blanket that I've used for at least a decade.  I sleep with it and also wrap it around me when it's cold and even when it's not cold.  Last year sometime it started to fray, don't know how, I guess just started with a tear, and it's just gotten worse.  The sides are all torn up, ribbons of fabric are hanging off it and stuffing has come out (yet I still use it).  I don't know how it's gotten this bad.  I feel like this blanket - frayed, useless, spent.",
    "tone_score": {
      "neg": 0.13,
      "neu": 0.843,
      "pos": 0.027,
      "compound": -0.8599
    }
  },
  {
    "text": "i feel like a nuisance to people. the way people distance away from me is conflicting. from one side yeah i feel like shit and its probably best for everyone but its been like this for years ive been here. i guess i dont connect w people who have their shit together and at least have some privilege being straight and cis whilst im living my bitter empty and drab life 💀 i dont know what to do with my time here\n\ni mean yay im high functioning but does it make a difference when my life is completely empty and devoid of anything significant and wanting to put a bullet every time i clock in, i dont even have anyone in my life to spend time with. just too afraid to let myself go completely and become homeless just to suffer a drawn out and painful death .",
    "tone_score": {
      "neg": 0.182,
      "neu": 0.681,
      "pos": 0.137,
      "compound": -0.8945
    }
  },
  {
    "text": "I'm feeling overwhelmed by everything, and I don't know if I can keep going. I fucking hate my job, and I'm getting more breakdowns because of that.\n\nI hate my life.",
    "tone_score": {
      "neg": 0.237,
      "neu": 0.683,
      "pos": 0.08,
      "compound": -0.8067
    }
  },
  {
    "text": "Life sucks, but I'm surviving, if only barely. Being poor is such a vicious cycle when I'm depressed, unable to afford real help and having to fight the urge to spend the little money I have on things that would make me feel better, because that money needs to go towards keeping myself alive, to keep hating myself? I don't get it. How does anyone survive in such a cycle?",
    "tone_score": {
      "neg": 0.235,
      "neu": 0.615,
      "pos": 0.149,
      "compound": -0.8313
    }
  },
  {
    "text": "First time doing anything like this on social media, felt like I needed to vent somewhere, but it was either open up on my main social media account about what I go through, or just post what’s been going on here. Not ready to open up publicly yet, so I’ll just do it here.\n\nToday was not good. I got 4 hours of sleep, didn’t finish my workout the way I wanted to, almost overslept after my workout and got a late start on an exam. Didn’t remember some of the terms I spent a lot of time on. Ate horribly and just sat around playing video games to try and forget me feeling sorry for myself and how I feel pathetic to my friends and family. Ate a bunch of late snacks, and then wallowed around thinking about someone until I decided to go to bed, where I am now.\n\nI’m really hoping tomorrow is different. But it’s been like this for the week, and this exact thing happened not much more than a month ago. I’m getting really worried.",
    "tone_score": {
      "neg": 0.115,
      "neu": 0.788,
      "pos": 0.097,
      "compound": -0.6677
    }
  },
  {
    "text": "i know there isn’t a point to my life. why am i still moving along. \nim too depressed for a breakthrough hobby that’ll make enough money for me to get away from my dead end job. im too depressed for friends let alone to have one person care for me. im too depressed to even enjoy games or drawing anymore. im ugly im boring im dead dead dead dead dead i just rot in a chair and eat and eat and eat. even though food isnt enjoyable either i just fill the void until i want to burst into pieces and then throw up. i dont want to live anymore. its just a huge blur of days where im sitting at home or going to work where im nothing to people, everyday is the same i lose the track of everything. i just watch myself get older and more undesirable and more disgusting and i just want to mutilate and self destruct even more i feel so ugly and disgusting in this body i hate it so much. im so dumb. how did i get this slow i can barely even speak to people i just want for this shit to end. please god kill me plesse please please please \ni want to drink so much ill die im so tired of this pointless existence\n\ni look at others and everyones so funny and amazing and talented even at a younger age and im just nothing. i stand out with nothing why would anyone ever want me i know im just going to rot till im 50 years old if i havent shot myself jn the face and die alone im i    i dont know everything is just so draining and tiring i dont want to do anything other than to hurt myself",
    "tone_score": {
      "neg": 0.273,
      "neu": 0.611,
      "pos": 0.116,
      "compound": -0.9968
    }
  },
  {
    "text": "Everything feels like it needs so much effort from me even the simplest things. I lost interest in video games because i feel overwhelmdd and tired just thinking about playing. Thats one of mamy things that i lost interest in. I cant do simple stuff that I know will help me greatly. I try to workout, go outside and do stuff or whatever but i get so drained mentally afterwards that i would just stay in bed for the rest of the day and like half of the next one. I stayed in bed for 23 hours straight today and i cant even fall asleep properly i get 2-3 hours of sleep if im lucky. It all feels too much everything about life. I pushed my friends away, my family thinks im a lazy ass loser and for that reason they lost all respect for me. I have no one to talk to, no one to hang out with. Its too much. Im mentally exhausted 24/7 and i cant take it anymore",
    "tone_score": {
      "neg": 0.173,
      "neu": 0.692,
      "pos": 0.135,
      "compound": -0.856
    }
  },
  {
    "text": "spiraling tonight and dreading the week to come.",
    "tone_score": {
      "neg": 0.327,
      "neu": 0.673,
      "pos": 0.0,
      "compound": -0.5267
    }
  },
  {
    "text": "I sleep a lot these past few weeks even though I should be doing schoolwork (I'm getting really behind). There are unfinished 3 coffee cups in my room. Skipped classes a lot. Haven't showered in days. I have no energy for anything. I think I'm horrible. and stupid. and headed nowhere in life. Man.\n\nI think it's safe to say that it is indeed getting bad again.",
    "tone_score": {
      "neg": 0.178,
      "neu": 0.751,
      "pos": 0.071,
      "compound": -0.8225
    }
  },
  {
    "text": "Life is so overwhelming rn. I wanna die on my sleep. Fuck everything.",
    "tone_score": {
      "neg": 0.425,
      "neu": 0.575,
      "pos": 0.0,
      "compound": -0.8126
    }
  },
  {
    "text": "I just woke up, and I still wanna die. Ugh.",
    "tone_score": {
      "neg": 0.528,
      "neu": 0.472,
      "pos": 0.0,
      "compound": -0.7717
    }
  },
  {
    "text": "tomorrow i'm starting the path towards diagnosis and not even by choice. honestly i wasn't ready yet, but i need to do it regardless. that's a whole complex thing to get into. anyway.... i'm scared? the whole concept of this all becoming extra real is pretty terrifying. and it's not just depression, but also anxiety, selective mutism, most likely autism too. this is just an overwhelming clusterfuck of emotions that i was not prepared for and can't put into words.",
    "tone_score": {
      "neg": 0.156,
      "neu": 0.733,
      "pos": 0.111,
      "compound": -0.4951
    }
  },
  {
    "text": "I feel bad and I feel like everyday I wake up it gets worse.",
    "tone_score": {
      "neg": 0.386,
      "neu": 0.468,
      "pos": 0.146,
      "compound": -0.6249
    }
  },
  {
    "text": "I feel guilty about being depressed. My fiancé has relocated across the globe to be with me, and all I do is be a depressive ball of crap. He's a trooper, he listens to me, he holds me when I cry, he tries to help me fight it but I feel like it's pointless. I feel like I disappoint him. I tried making my own wedding dress, which I haven't worked on in a month - which makes me feel worse because this used to be my job and my passion. And now I feel empty and burned out.",
    "tone_score": {
      "neg": 0.2,
      "neu": 0.684,
      "pos": 0.116,
      "compound": -0.7227
    }
  },
  {
    "text": "I’ve been sitting on the couch on my phone for the last 7 hours. I’ve only moved to get food. I need to do the dishes but I don’t even know if I can motivate myself enough. This is just normal for me. I just got out of a bad funk and this is my (pathetic) normal.",
    "tone_score": {
      "neg": 0.083,
      "neu": 0.857,
      "pos": 0.059,
      "compound": -0.3291
    }
  },
  {
    "text": "I feel so hopeless today. \nI feel empty. \nI feel unloved.\nI feel lonely.\nI feel like living is pointless. \n\nAnd it snowed today. A lot. So much so that it's stuck on the ground and I'm very unhappy it's now Winter. Maybe the snow triggered my mood today but I feel horrible.",
    "tone_score": {
      "neg": 0.283,
      "neu": 0.686,
      "pos": 0.032,
      "compound": -0.8984
    }
  },
  {
    "text": "Just went to a crisis center and they gave me a no refillable prescription for anti depressants. It takes 6 weeks to really work but they only gave me four. I already explained there is a wait list to get a psychiatrist for 3 months and I’m literally so close to ending it all like why??",
    "tone_score": {
      "neg": 0.144,
      "neu": 0.797,
      "pos": 0.059,
      "compound": -0.4039
    }
  },
  {
    "text": "Tried to count my hours I did for work. Total chaos. First number lead to 4,5k bucks. For work done over four months. Did a recount again and inclouded some nunbers I missed, now it's 6,4k. Pretty \"big\" difference. \n\nI'm stupidly worried into all directions. Worried I missed numbers or that I did a mistake and counted something twice. I don't want to rip someone off. Feel guilty over asking money at all even though that's stupid af. Worried work will yell at me that the things I did is never worth that much. Impostor syndrome going insane. \n\nNot sure what to do. Probably going to do a total recount _again._ Maybe asking old therapist for advice even though she isn't good but I just can't talk to anyone else.",
    "tone_score": {
      "neg": 0.194,
      "neu": 0.781,
      "pos": 0.025,
      "compound": -0.9243
    }
  },
  {
    "text": "I'm just empty af, man. I've been struggling with depression for over 2 years now. I started seeing psychologist about 3-4 months ago as i finally got myself to seek help and talk to someone. Recently, I stopped it as i felt like even I couldn't open up myself to her, and i didn't feel like it was helping me at all. So, here I am, absolutely lonely again. I have absolutely noone to talk to. On top of that, I started studying abroad in Italy and it brings me down even more. I don't know any people here. Literally, 0. I had a talk on my first week in the dorm with a girl from Russia and you don't even know how did it feel to be able to have a free conversation with someone. And i haven't seen her anymore. I feel like people are avoiding me but at the same time, i know that i'm actually avoiding others as my anxiety strikes when i'm near people. I often can't even get myself to attend classes because of my anxiety, being shy and so on. The only thing my psychologist told me is \"you just have to do it and don't care about anything, just let it happen\". Fuck that. I don't know if I'm ever going to be better",
    "tone_score": {
      "neg": 0.139,
      "neu": 0.791,
      "pos": 0.07,
      "compound": -0.9407
    }
  },
  {
    "text": "Continuing on the \"I have the most stupid problems\": boss tried to reach me for half a week, trying to ask how much he owes me. Me not answering anything. Wrote former therapist asking for advice (despite fucking everything but beggars rly cant be choosers). Managed to open her answer today, she told me how to write better bills and not to feel 100% worthless... or at least try to. And since I don't exactly know how much work owes me I'm supposed to say 5k for now. My \"calculations\" say 6.2k but anything feels wrong. I'm a total mess between anxiety, impostor syndrome, being dysfunctional and what else. \n\nI told work 5k for now and just hope people will leave me alone for a few days. I haven't been able to recuperate at least a bit in weeks, feeling super awful.\n\nEdit: went to bed after 3am. Don't have an appointment or anything the next morning but get woken up at 9 by family member. Tells me both bosses called and said I should call back and hurry the fuck up. What now.",
    "tone_score": {
      "neg": 0.12,
      "neu": 0.801,
      "pos": 0.078,
      "compound": -0.8175
    }
  },
  {
    "text": "I have nothing worth living for and everyone who knows me evenutally despises me. I don't know how to fix this, just wanted to write it down.",
    "tone_score": {
      "neg": 0.169,
      "neu": 0.831,
      "pos": 0.0,
      "compound": -0.567
    }
  },
  {
    "text": "I feel so overwhelmed with life. I hate my father. He is a piece of shit. And I just had to deal with him for five days. And after those five days I have decided I never want to see him again. Ever. Money problems are piling up. I've given up on dating and sex (haven't done either in years). Realized that I haven't celebrated my birthday with anybody in over 15 years. I'm starting to hate my job after only five months, and it's all because I just don't want to do it... I suck at life. I suck at family. I suck at everything.",
    "tone_score": {
      "neg": 0.246,
      "neu": 0.741,
      "pos": 0.013,
      "compound": -0.976
    }
  },
  {
    "text": "idk, whatever. I've been taking some online classes, and obviously I'm a fucking weirdo and everybody wishes I would just be normal. I hate the world.",
    "tone_score": {
      "neg": 0.285,
      "neu": 0.66,
      "pos": 0.056,
      "compound": -0.7645
    }
  },
  {
    "text": "I've been struggling with a depressive episode the last few weeks. Tomorrow is my birthday and I realized that I'm going to be spending it alone because I didn't make any plans. It's sending me to a really dark place, I can't stop crying. I feel very alone. I hate where I am in my life right now. Constant depressive episodes makes it feel like it's impossible for me to change anything - why bother trying when I just end up here again? I'm dreading tomorrow. Hoping I just don't wake up.",
    "tone_score": {
      "neg": 0.217,
      "neu": 0.686,
      "pos": 0.097,
      "compound": -0.9008
    }
  },
  {
    "text": "Feeling hopeless",
    "tone_score": {
      "neg": 0.667,
      "neu": 0.0,
      "pos": 0.333,
      "compound": -0.3612
    }
  },
  {
    "text": "If this thing is not going to fucking kill me, then can I just fucking end myself instead?\n\nGood lord, I'm so tired of having to hear that 'I should take care of myself,' when I'm so fucking over it.\n\nEnd me now.",
    "tone_score": {
      "neg": 0.165,
      "neu": 0.719,
      "pos": 0.115,
      "compound": -0.5624
    }
  },
  {
    "text": "I said so much \"I wanna die\" today and the day's not even nearly over",
    "tone_score": {
      "neg": 0.231,
      "neu": 0.769,
      "pos": 0.0,
      "compound": -0.5994
    }
  },
  {
    "text": "I’m a  stupid sack of crap that should have never been born.",
    "tone_score": {
      "neg": 0.4,
      "neu": 0.6,
      "pos": 0.0,
      "compound": -0.7184
    }
  },
  {
    "text": "Another mistake...I dragged another person into the ditch with me. I'm starting to think that the only right thing for me to do is to kill myself.",
    "tone_score": {
      "neg": 0.191,
      "neu": 0.809,
      "pos": 0.0,
      "compound": -0.7096
    }
  },
  {
    "text": "Why. Why am I so attentive and want to help everyone when I can. But ppl are so dismissive of me. I hate myself so much.",
    "tone_score": {
      "neg": 0.179,
      "neu": 0.71,
      "pos": 0.111,
      "compound": -0.6018
    }
  },
  {
    "text": "It's kinda surprising how much of a jackass I am to others. Kinda fucked me up a little bit. My self view doesn't align with others view of me even faintly. My personality doesn't work for people anymore; doesn't matter if I'm being me, trying to be someone else, being nice, not giving a fuck, it all generally ends up the same. Don't know how to go about having a personality anymore. I can't do anything about it; it's not conscious. I'd have to be conscientious of it all the time and that's just not happening even if I tried. Just not on the same wavelength with other people. May just be a little too slow.",
    "tone_score": {
      "neg": 0.085,
      "neu": 0.853,
      "pos": 0.063,
      "compound": -0.3736
    }
  },
  {
    "text": "take the pain away",
    "tone_score": {
      "neg": 0.524,
      "neu": 0.476,
      "pos": 0.0,
      "compound": -0.5106
    }
  },
  {
    "text": "When will the pain stop?",
    "tone_score": {
      "neg": 0.647,
      "neu": 0.353,
      "pos": 0.0,
      "compound": -0.6705
    }
  },
  {
    "text": "How do I get the strength to look after myself when I fail every time I try? I’m ashamed of myself and can’t bare to look at myself in the mirror. I can’t get the motivation to shower, work, clean, cook, eat well, exercise… it’s all to much and I can’t handle it anymore. I have everything I thought I wanted but I’m miserable as hell. A big house, good job, lovely supportive fiancé but I’m still so so depressed. \n\nAll I want to do is sit alone on my own and do nothing. :(",
    "tone_score": {
      "neg": 0.203,
      "neu": 0.594,
      "pos": 0.204,
      "compound": -0.5966
    }
  },
  {
    "text": "my grandma had a freak accident today and she's in the ICU. she's 78 and they're worried about her brain. I'm grateful there was a bed for her, given how full our local hospital is. but I don't know what to do.",
    "tone_score": {
      "neg": 0.131,
      "neu": 0.822,
      "pos": 0.047,
      "compound": -0.3818
    }
  },
  {
    "text": "Dealing with depression since I was a kid. I'm in my 30s now. Still waiting for things to 'get better'. The circle of people that care about me has slowly been shrinking across my life, and I lost the last one 4 months ago. I've worked hard with nothing to show for it. I just don't see the point and I'm scared how much further things will get worse 30 years from now.",
    "tone_score": {
      "neg": 0.17,
      "neu": 0.789,
      "pos": 0.041,
      "compound": -0.8481
    }
  },
  {
    "text": "Ah, I am feeling sad. It was a shit day today.\n\nI hope something either kills me or I die of a disease. \n\nI dont see myself living past 40. \n\nI am just sad. Fuck this life.",
    "tone_score": {
      "neg": 0.439,
      "neu": 0.467,
      "pos": 0.093,
      "compound": -0.9538
    }
  },
  {
    "text": "I am feeling really depressed. Balding has absolutely ruined my life. I am so sick and tired of using hair fibers to cover it up. Balding is so unattractive especially in the late 20's. I am taking medicine for it and everything but it is just keeping it from getting worse.",
    "tone_score": {
      "neg": 0.271,
      "neu": 0.707,
      "pos": 0.022,
      "compound": -0.9255
    }
  },
  {
    "text": "Im kinda doing okay but the reason isnt good. I have kinda lost most of my emotions and i just feel like a empty shell. Maybe thats because of my medication but im not going to talk about it to my therapist because im fine with living like this. \n\nI decided to ditch my old friend because my mind said hes going to leave me eventually so why not do it now. So im alone about 24/6 only mom visits me one day a week. My suicidal thoughts have come back and im not even scared of them they are so normal. \n\nI met an amazing guy and we had awesome time but my mind went crazy and i ditched him. I just really want to hug someone or snuggle but i have accepted im meant to be all alone this life and its never getting better. Everyone has been saying it now all three years i have been on two depression medication and its just not getting better only worse. Im broke and hate it here. \n\nJust needed to vent...",
    "tone_score": {
      "neg": 0.209,
      "neu": 0.63,
      "pos": 0.161,
      "compound": -0.9025
    }
  },
  {
    "text": "I know I'm not doing well when I refuse to/can't sleep. revenge bedtime procrastination? self-harm? who knows.... but i have to get it together before work tmr\n\nI really hate myself sometimes",
    "tone_score": {
      "neg": 0.255,
      "neu": 0.691,
      "pos": 0.054,
      "compound": -0.7887
    }
  },
  {
    "text": "I give up. I am drowning and I just wanted it to end. It is likely I will attempt hurting myself tonight.",
    "tone_score": {
      "neg": 0.137,
      "neu": 0.863,
      "pos": 0.0,
      "compound": -0.4019
    }
  },
  {
    "text": "My alcohol intake has increased again. I've quit a lot of addictive things but my drinking habit is just so damn easy to trigger when I'm feeling bad or anxious. One of these days I guess. I'm lonely and tired.",
    "tone_score": {
      "neg": 0.337,
      "neu": 0.53,
      "pos": 0.134,
      "compound": -0.9263
    }
  },
  {
    "text": "I feel so terrible all the time, I can't seem to get out of my head. Most events that I want to go to I don't because I am either distracted with my phone / internet or anxious (or I'm on there because I'm anxious). I really need to see a therapist soon because nothing seems to help. I don't have motivation to clean the dishes or the house, there are fruit flies everywhere. I found out my bike got stolen within the last week today. I watch dark shows a lot just to get the ecstasy of seeing a suicide on screen and living intravenously though them (or any death and make myself think it was a suicide). I hate that i fantasize about that so often...fuck I want to die.",
    "tone_score": {
      "neg": 0.22,
      "neu": 0.711,
      "pos": 0.068,
      "compound": -0.9704
    }
  },
  {
    "text": "Was actually feeling good earlier today. Then a few work emails and looking at money stuff and I'm stressed tf out and feeling anxiety and hating everything again. I hate this instability.",
    "tone_score": {
      "neg": 0.277,
      "neu": 0.575,
      "pos": 0.148,
      "compound": -0.7351
    }
  },
  {
    "text": "I have a fire to learn, to connect but I feel stuck in the cynicism of it all. It just dawned on me that I stopped applying myself in middle school. I am now 26, in grad school, more self conscious than ever. I read tremendously slow, have a low vocabulary, terrible recall. I want to change all of that but I just don't know where to start. Feels like It's a cycle. I feel depressed because it's hard to learn, it's hard to learn because I'm extremely depressed. I know this is the only body I have, but I want things to get better. I am in a lot of pain. My anxiety, my depression, my racing thoughts. I just do not know.",
    "tone_score": {
      "neg": 0.291,
      "neu": 0.639,
      "pos": 0.071,
      "compound": -0.9848
    }
  },
  {
    "text": "Feel so sad :(",
    "tone_score": {
      "neg": 0.767,
      "neu": 0.233,
      "pos": 0.0,
      "compound": -0.763
    }
  },
  {
    "text": "i just keep feeling worse. everyday is painful. even if i distract myself with things, at the end of the day im still depressed. i make a new post on this sub nearly daily now. i just want someone to give a shit. i cant keep doing this.",
    "tone_score": {
      "neg": 0.291,
      "neu": 0.655,
      "pos": 0.054,
      "compound": -0.9231
    }
  },
  {
    "text": "When you awake at a saturday, sunday at 6, 7 am and people think \"oh, that person really has their life together\". \n\nNo, I just can't sleep. At all. Haven't worked most of the week because too exhausted to sit on a chair.",
    "tone_score": {
      "neg": 0.113,
      "neu": 0.887,
      "pos": 0.0,
      "compound": -0.5719
    }
  },
  {
    "text": "I used to post here a few months ago. In the last three months, a lot has changed for the better. I've been off the Internet and into the real world, getting busy with work. I even moved to different city. Everything seems fine.\n\nI still take all my meds and I didn't stop counseling. Today during therapy, I touched a very dark corner of myself. There's so much ingrained resentment in the back of my mind. My depression runs deeper than I ever thought. I'm starting to think I'll never get rid of it, this is just who I am. The problem is I don't like it, I can't accept it.\n\nSo everything is fine, maybe the finest it has ever been. And yet...",
    "tone_score": {
      "neg": 0.11,
      "neu": 0.824,
      "pos": 0.066,
      "compound": -0.7558
    }
  },
  {
    "text": "Got a much higher paying job starting next week, am on my first vacation in like 4 years, but still somehow feeling exhausted all the time and feeling like shit. \n\nNot really sure where to go from here, I'm honestly not sure I can ever make things work.",
    "tone_score": {
      "neg": 0.22,
      "neu": 0.579,
      "pos": 0.201,
      "compound": -0.4916
    }
  },
  {
    "text": "I fucking hate my job. It depresses the hell outa me and I wish I could just up and quit but bills don't pay themselves and for the people I *do* work with, I feel like they depend on me to keep the structure of the department intact and every once in a while will go \"Please don't quit on us!\" And I don't want to let them (or myself, for that matter) down but that place will upset me to the point of tears and sometimes I'll pantomime slitting my wrists or putting a gun in my mouth when people ask me how things are going.",
    "tone_score": {
      "neg": 0.153,
      "neu": 0.746,
      "pos": 0.1,
      "compound": -0.7333
    }
  },
  {
    "text": "I feel like I’m losing myself again. I just got over covid,so I’ve been off of work for two weeks. and just started having awful anxiety attacks again. Part of me wants to quit my healthcare job and apply in retail or something because I’m burnt out badly. I barely do anything fun anymore and I’m just overall hating life right now. I guess you could say things are getting bad again.",
    "tone_score": {
      "neg": 0.237,
      "neu": 0.697,
      "pos": 0.065,
      "compound": -0.9269
    }
  },
  {
    "text": "Tiime is passing so quickly recently, it feels, or have I completely lost sense of the flow of time?",
    "tone_score": {
      "neg": 0.132,
      "neu": 0.868,
      "pos": 0.0,
      "compound": -0.3804
    }
  },
  {
    "text": "I let myself run out of meds, which I know for me is unhealthy. I am having such a tough time not crying constantly. I sure look forward to my Dr appointment Monday to get refills.",
    "tone_score": {
      "neg": 0.188,
      "neu": 0.741,
      "pos": 0.07,
      "compound": -0.5119
    }
  },
  {
    "text": "Nearly every morning to exhausted to stand up. And the first people you meet will yell at you every single morning.",
    "tone_score": {
      "neg": 0.111,
      "neu": 0.889,
      "pos": 0.0,
      "compound": -0.3612
    }
  },
  {
    "text": "i fucking hate my job and it makes my health deteriorated. i want to resign but i don't want to going back to my jobless life. no one can support me in this matter. idk what to do",
    "tone_score": {
      "neg": 0.2,
      "neu": 0.629,
      "pos": 0.171,
      "compound": -0.3091
    }
  },
  {
    "text": "Damn, birthdays are hard. Idk why today is especially hard but it is for some reason. I am getting through it. We will get through our birthdays.",
    "tone_score": {
      "neg": 0.199,
      "neu": 0.801,
      "pos": 0.0,
      "compound": -0.3506
    }
  },
  {
    "text": "Work stressful. Lots of depressive thoughts. Had to stand up at 5am but anxiety kept me awake all night.\n\nSpent all morning moving heavy and fragile stuff that I've been preparing for months. Also had to keep track of everything, anxious not to miss any important detail. \n\nEverything done by noon. When I was about to leave I wanted to check if a window was close. Slightly touched a small statue made out of clay and it fell and shattered in thousand pieces. Fantastic. Literally when I was about to leave. \n\nIdk about consequences of this. Have to take responsibility for it. Just super stupid, was entirely preventable but wasn't focused. And statue stood in a bad place, wasn't me who put it there. Not that it changes anything about it being my fault.\n\nWhen I came home I found out that parents opened the window of my room with papers of my work directly under it. Holy hell. I don't know how often I said not to touch the window. They like to open it in the morning and leave it open all day no matter if it's freezing, raining or the heating's broken. Sometimes everything's wet in here from humidity alone. \n\nWould've been just my day to call work and tell them that 200 precious, unique pictures are lost because sadly I still live at home and don't have a safe room and anything I don't lock away gets destroyed. Adult version of \"sorry my dog ate my homework\". \n\nParents ofc don't understand the problem. I don't think they change their behavior either, no matter what I say. I tried so hard.\n\nWhy is life \"if you're not 100% careful all the time things will immediatedly turn to shit\".",
    "tone_score": {
      "neg": 0.216,
      "neu": 0.703,
      "pos": 0.081,
      "compound": -0.9912
    }
  },
  {
    "text": "Too much on my plate rn. So sick of having to mostly do everything at this point as I stress like mad over screwing something up. Can't keep any food in really. Mom \\*thinks\\* I'm losing weight. More like have lost lots and keeping on doing it. Just don't have the energy to make anything decent. So tired, from the moment I get up until going to bed...and then starts the nightly \"I'll stay awake until 3am remembering every little and major thing I've done wrong\" campaign.",
    "tone_score": {
      "neg": 0.239,
      "neu": 0.713,
      "pos": 0.048,
      "compound": -0.9569
    }
  },
  {
    "text": "Physically ill. Scared if it's either a cold, the flu or covid. I've been vaccinated but it still could be covid, right? That's at least what my anxiety-ridden brain is telling me.\n\nBest part is that the entire rest of the family is antivaxers and obviously not vaccinated. Worried about getting infected and killing them, even though the chances are low. But I'm already occupied with mental stuff, I can't worry about that as well.\n\nTonight I woke up in the middle of the night and felt so badly I couldn't move. No idea how long this did last. This morning it's already a lot better but idk. \n\nAlso good: I can't really ask parents to organize a covid test because then it might come out I've been secretly vaccinated. Haaa all my stupid little secrets and unnecessary lying.",
    "tone_score": {
      "neg": 0.2,
      "neu": 0.651,
      "pos": 0.149,
      "compound": -0.8709
    }
  },
  {
    "text": "I've been in a tough place lately, I feel so lost in life. I can't focus on my studies or work, it's hard not to do anything drastic like dropping out or quitting. I just feel like a failure.",
    "tone_score": {
      "neg": 0.218,
      "neu": 0.664,
      "pos": 0.119,
      "compound": -0.4924
    }
  },
  {
    "text": "Ppl think im too young to be dealing with depression or stress and it puts me down so much especially when you live with parents you cant tell it to cause they dont understand, my sisters off in college now and im just stuck here trying not to kms",
    "tone_score": {
      "neg": 0.156,
      "neu": 0.844,
      "pos": 0.0,
      "compound": -0.8176
    }
  },
  {
    "text": "this fucking sucks dude",
    "tone_score": {
      "neg": 0.482,
      "neu": 0.518,
      "pos": 0.0,
      "compound": -0.4201
    }
  },
  {
    "text": "It really, really *doesn't* get better, does it?",
    "tone_score": {
      "neg": 0.276,
      "neu": 0.724,
      "pos": 0.0,
      "compound": -0.3959
    }
  },
  {
    "text": "I’m so exhausted and nobody wants to see it",
    "tone_score": {
      "neg": 0.259,
      "neu": 0.741,
      "pos": 0.0,
      "compound": -0.4201
    }
  },
  {
    "text": "I feel like I’ll never get out of my own way and I’ll be like this forever. Forever isolated, alone and weak. I tried. I went to college away from home to just jump into it and force myself to swim but I had to come back. I had to empty out ny dorm room and leave before I was charged for the full semester. Now I’m back and reevaluating everything in my life. I feel like I’m drowning or on the edge about to do something drastic. I have PTSD so when I was at the school I just had floods of scary thoughts and anything negative stuck in my mind even though I did have some positive experiences. But I felt like I was headed for a really really bad mental breakdown if I stayed there and didn’t get help. I told myself I’d come back and do all the things that scare me to overcome this but so far I haven’t done nearly enough. I feel like I’ll always be an outcast, a weirdo or I’ll hurt those around me. I need to get out of this house away from these people and this town.",
    "tone_score": {
      "neg": 0.185,
      "neu": 0.716,
      "pos": 0.098,
      "compound": -0.9593
    }
  },
  {
    "text": "Uni coursework is piling up, but my brain just can't seem to focus at all. Have 3 exams on Wednesday and a major one on Saturday. I'm screwed and facing the possibility of dropping out.",
    "tone_score": {
      "neg": 0.118,
      "neu": 0.882,
      "pos": 0.0,
      "compound": -0.6486
    }
  },
  {
    "text": "I had to stop my antidepressant because of side effects and I just had my first emdr session with a new therapist that left me feeling angrier than I have in a long time. I just feel out of control and miserable.",
    "tone_score": {
      "neg": 0.206,
      "neu": 0.758,
      "pos": 0.036,
      "compound": -0.802
    }
  },
  {
    "text": "I'm so tired of chasing my anxiety back to its source 15 times a day. Just to discover it's the most trivial petty trigger and knowing it doesn't even help sometimes.",
    "tone_score": {
      "neg": 0.298,
      "neu": 0.702,
      "pos": 0.0,
      "compound": -0.8235
    }
  },
  {
    "text": "I haven't been going to the gym as regularly for a week. I think it's because of the release of a new game. Stupid game takes a while to finish haha.\n\nStressed over an argument with my parents. Someone hit their car on Saturday. The plastic bumper's thing came off, I told them late fearing getting yelled at, and didn't get enough identification. The woman who hit me had someone else pick up the number and refuse to give a license plate number yet. I should've gotten evidence at the crash site. License and police.",
    "tone_score": {
      "neg": 0.168,
      "neu": 0.776,
      "pos": 0.056,
      "compound": -0.9062
    }
  },
  {
    "text": "It’s been 2 months. I’m still depressed. She’s moved on. How can she move on so easily and I’m struggling to smile everyday. How come I have to think about her all the time? How come she doesn’t bothering thinking of me, but she’s all I think about? How come it still hurts. How come I can’t just stop feeling. How come I’m this pathetic? Why can’t I just be better and stop bitching? Fuck man. \nI’m studying harder than I’ve ever studied in my entire life. I’m putting in HOURS everyday, and I’m not performing how I want to. What’s the point? I put everything I have into this, and and still nothing. Why try. Literally would force myself out of bed, force myself to brush my teeth, fix my hair, TRY. all that. For nothing. There’s no point. I just disappoint my parents, my grandparents, and myself. Nothing matters.",
    "tone_score": {
      "neg": 0.208,
      "neu": 0.724,
      "pos": 0.068,
      "compound": -0.9758
    }
  },
  {
    "text": "I hate that there's no \"right way\" to die! Cutting is painful, messy and traumatic to whoever finds you. Suffocation is drawn-out and again, some poor fucker would have to find me. Overdosing is meant to be excruciating and half the time it doesn't work. Can't get hold of a gun where I live - I've never seen a real one outside of movies. Drowning is the closest... but I have an awful fear that someone would see me, try to save me and die instead. Euthanasia should be legal all over the world for people who've exhausted their options. Yes, I know it's *much* more complicated than that, but if that Dutch euthanasia clinic had a branch near me, I'd be waiting outside their door.",
    "tone_score": {
      "neg": 0.267,
      "neu": 0.669,
      "pos": 0.064,
      "compound": -0.9784
    }
  },
  {
    "text": "not getting better",
    "tone_score": {
      "neg": 0.546,
      "neu": 0.454,
      "pos": 0.0,
      "compound": -0.3412
    }
  },
  {
    "text": "Every morning I wake up and tell myself I need to get my shit together and make my life better and every day I just end up not doing any of it. Instead I just slide deeper into loneliness and mediocrity.\n\nI just...don't have the energy to do this anymore. And it's all my fucking fault.",
    "tone_score": {
      "neg": 0.207,
      "neu": 0.745,
      "pos": 0.048,
      "compound": -0.8228
    }
  },
  {
    "text": "My mental health is fucked. So many painful thoughts, general turbulence trying to think right. Silly emotional intensities. Difficulty telling what's real.",
    "tone_score": {
      "neg": 0.336,
      "neu": 0.573,
      "pos": 0.091,
      "compound": -0.8511
    }
  },
  {
    "text": "I just always feel hurt. It’s a constant feeling. Anything I do that is supposed to stop it all like exercise and sleep and eating right just slows it from rotting me completely.",
    "tone_score": {
      "neg": 0.157,
      "neu": 0.73,
      "pos": 0.112,
      "compound": -0.3818
    }
  },
  {
    "text": "TW SELF HARM & WEIGHT TALK\n\nmy brain, out of nowhere: what if we cut on your left hip so it'll match your right. but like, make it a lot, it's really a pitiful amount\n\nalso i hate my body SO MUCH right now. i can barely concentrate on anything else. there was a really good time where i stopped eating almost entirely, completely without thinking about it, but i'm almost back to normal now with the hunger cues and i've put some of the weight back on *again* and i hate it. i think so much about food and i can barely control myself. also the weight makes my body such a feminine shape and i can't even say anything else except that *i hate it.* wish i could shapeshift. i'd be so much thinner and more masculine. \n\n...i was getting better. i'm more self aware. sometimes i can resist the urge. (certainly i cut myself less than i want to.) sometimes i can pull myself out of this. but i sure feel like death right now.",
    "tone_score": {
      "neg": 0.183,
      "neu": 0.708,
      "pos": 0.11,
      "compound": -0.9496
    }
  },
  {
    "text": "I think I want to die. Everything is getting worse.  I fantasise about dying more and more often",
    "tone_score": {
      "neg": 0.345,
      "neu": 0.591,
      "pos": 0.064,
      "compound": -0.7717
    }
  },
  {
    "text": "I need to relieve my stress to cure my tinnitus. Need to stop taking caffeine, work out and sleep more. I'm also stressed out by living with parents who want to control my movements. Waiting for that final fight... If they argue with me again I'm going to pack and leave.",
    "tone_score": {
      "neg": 0.194,
      "neu": 0.741,
      "pos": 0.065,
      "compound": -0.7553
    }
  },
  {
    "text": "I'm really tired but can't sleep. I'm crying and struggling this week. I really am ill. I can't run from it. I'd rather be dead then face it. But that feeling is temporary. I just gotta make it out of this wave.",
    "tone_score": {
      "neg": 0.294,
      "neu": 0.612,
      "pos": 0.094,
      "compound": -0.915
    }
  },
  {
    "text": "Friend group is starting to drift apart, but they have people. I don't. In a couple years it's just gonna be me and I'm quite possibly the worst person to be forced to spend a lifetime with. \n\nWish I knew why I'm so horrible.",
    "tone_score": {
      "neg": 0.286,
      "neu": 0.615,
      "pos": 0.099,
      "compound": -0.9278
    }
  },
  {
    "text": "Aunt happily shows me a newspaper ad by an antivax \"doctor\". \"See, they say it's everyone one decision to get vaccinated :)\". \n\nAunt also had multiple open heart surgeries but who cares right?? The virus can't harm her or the rest of the antivaxxer family cause \"we're eating very healthy\", besides their chakra is at the right place! /s\n\nJust wrecking me on top of anything else that happened the last days. Decades of mental health problems due to my family. Me being the total servant for people who are stupid anti-science nuts who might kill themselves. And this is making my mental issues worse because it's absolutely _my_ responsibility they don't feel badly in any way./s If they're in the ICU I'll blame myself cause I didn't manage to convince them to get vacced. \n\nConflicting mental health problems are just the worst, when you also avoiding any arguments or conflicts. Hate everything about this situation, I've got enough to do without antivax family and even antivax therapist where you ask yourself is there any fucking person here who isn't out of their minds??\n\nEdit: and this is just another issue where family is like energy vampires and the only way to \"solve\" this is to avoid them. When they say \"it's everyone's own decision :)\" (it's actually not though) they mean \"I don't want to hear anything against my position but I will still pester you with the most trash antivax opinions\". Fuck all of this. Life wasted dealing with the smallest, most bullshit annoyances.",
    "tone_score": {
      "neg": 0.242,
      "neu": 0.692,
      "pos": 0.066,
      "compound": -0.9962
    }
  },
  {
    "text": "TW self-harm\n\nhi. i did not relapse. i just...wanted to say that. it doesn't feel like a victory - after all these years, i still don't fully *get* why it's wrong. (i know about the things that could go wrong physically, and that it's generally classified as an unhealthy coping mechanism, and that i'd never want the people i love hurting this way.) i feel awful about my scars fading more and more. my body in general. but i didn't do it.",
    "tone_score": {
      "neg": 0.157,
      "neu": 0.811,
      "pos": 0.032,
      "compound": -0.7364
    }
  },
  {
    "text": "i’m floating, always somewhere else when i should be in the present. i’m nowhere and lost, but not a single drop of dread fills me. instead, an empty hole remains, reminding me that i’ll never be whole again. \n\ni’m simply not among the living or the dead. i’m just here.",
    "tone_score": {
      "neg": 0.206,
      "neu": 0.731,
      "pos": 0.063,
      "compound": -0.8872
    }
  },
  {
    "text": "what does it even mean when i'm comforted with pretending that my fingers are a gun and putting it against my head? i'm sick. i know i'm sick. but it's comforting. it's like 'ah, not today but soon' and i don't feel like spilling my guts all over the floor from anxiety anymore.\n\nending yourself is selfish. cowardly, even. but at this point, i've lost the motivation to even care. what should scare me, my growing indifference towards death, doesn't even scare me anymore. just numb. people who i know care...doesn't seem to matter much anymore. all i want is for all of it to end. just...what's the point? and all i do is hurt others so...what's the point?\n\ni don't want to feel anything anymore. \nlet me go.",
    "tone_score": {
      "neg": 0.259,
      "neu": 0.588,
      "pos": 0.153,
      "compound": -0.962
    }
  },
  {
    "text": "i’m pointless and not good at anything. just middle of the road and forgettable. i don’t even know how to communicate with others verbslly. i feelvso alone. i wish i was gone. im replacable, a discarded asset, broken goods to anyone why would anyone want me ever. time ticks and i age and the more ugly i look, i dont even know who this foul creature is before me in the mirror. i just feel unhappy and unfulfilled yet i dont even know what i want apart from being loved and caring for someone and loving them but i have literally nothing to offer. im blank, uninteresting, ugly, easily crumble to stress cant handle public spaces well. i have no dreams. nothing achievable. i have nothing and i am nothing. i feel like my lifes over already please god just make it stop this is fucking stupid and i feel like a joke to everyone",
    "tone_score": {
      "neg": 0.223,
      "neu": 0.607,
      "pos": 0.17,
      "compound": -0.8873
    }
  },
  {
    "text": "Things are bad. I don’t think I can finish school. I want to kill myself, but I have to find out if my parents will have to pay my loans once I’m dead. If I can make a clean break it will all be over and I can be at peace",
    "tone_score": {
      "neg": 0.214,
      "neu": 0.626,
      "pos": 0.16,
      "compound": -0.4939
    }
  },
  {
    "text": "Drinking a bottle of wine and sad cleaning my house. At least I’m being productive",
    "tone_score": {
      "neg": 0.193,
      "neu": 0.807,
      "pos": 0.0,
      "compound": -0.4767
    }
  },
  {
    "text": "I am going through the bad feeling like a kid dreading to go into kindergarten, except that I'm a grown-up in my late twenties. I put in my notice not long ago at work, and I'm going to start a new job soon but I'm not exactly looking forward to it. What if the job sucks as much as my current job? What if I can't adjust to the swing shift hours? Did I even make the right decision to leave?\n\nI am exhausted by life most of the time. I just want to lie down and do nothing.",
    "tone_score": {
      "neg": 0.129,
      "neu": 0.826,
      "pos": 0.045,
      "compound": -0.8534
    }
  },
  {
    "text": "i want the pain to stop.",
    "tone_score": {
      "neg": 0.625,
      "neu": 0.227,
      "pos": 0.148,
      "compound": -0.6369
    }
  },
  {
    "text": "just rly thinking about ending it all againnn 😵‍💫 i don't see how i can make a good life for myself and it seems like i'll forever be stuck in this purgatory or some sort of limbo between clinically depressed and mentally healthy. i think i want to die to escape my problems. its cowardly and selfish. i know. i probably have to retake my exams so that means an entire year of studying while my peers move on to better things in life. i think i might break up with my boyfriend too. i thought we could move past the cheating but we're going to do 3-4 years of LDR in two years and he'll have little time for me from now till two years time and i just can't envisage being away from him for so long and him not cheating on me. god what kind of relationship is it that i worry that he's cheating on me when he's out and not replying to me. this time it seems like it's my fault because he apologised. it'll never be enough though. it sucks because i really thought he was the one for me. idk how i'll move on. you know no man has actually romantically loved me except for him? and I have no idea why but i really want to start a family and have babies and a husband. maybe it's because i want people to be obligated and legally bound to stay with me forever. his mom hates me and idk how we can work it out in the end anyways. seems like im doomed to a life of mediocrity. i'm really slow too idk i have to spend so much time to get the same results as anybody else and it's frustrating. why am i not intelligent? why am i so slow? i really hate myself now. im too pussy to self-harm haha im upset that the wounds are so superficial. i feel bloated and i want to go on an all liquid diet but i keep eating and i keep getting hungry. i need to lose weight. i miss my best friend. pride is keeping me from texting her because she hasnt replied to my text message but she has time to post thirst traps on instagram. just seems like she doesn't have a place for me in her life any more and i don't blame her i feel entirely replaceable. god i wish i could just disappear. someone described the pain of losing a loved one to suicide as having their soul ripped out. it's paradoxical that ending my pain causes pain for others. ive always been selfish. im so tired of thinking i wont live to see another year, actually living to see that year and flopping because i made 0 plans and have 0 ambition. im going to die anw, what's the point? can't imagine this being the rest of my life. i want to stop but i feel powerless. im scared to see my psychologist too. its expensive and the easy way out. im not clinically depressed anymore, but the thoughts linger. wow but i can't fail at another attempt. idt i can deal being in the psych ward and having consultants and nurses and med students stare at me. idw my parents to cry. idw the police to talk to me. hahahah im so fked",
    "tone_score": {
      "neg": 0.203,
      "neu": 0.671,
      "pos": 0.126,
      "compound": -0.9956
    }
  },
  {
    "text": "going for another food run for skid row. i try to do these on bad days when i might not be exactly feeling it too.",
    "tone_score": {
      "neg": 0.188,
      "neu": 0.812,
      "pos": 0.0,
      "compound": -0.5954
    }
  },
  {
    "text": "I’m tired all the time. I can’t seem to make myself want to do anything. I can’t seem to care about anything. Time is just passing and I tell myself to get up and do this or that and I’ll feel better. It may be true, but I can’t seem to make myself. I’m miserable for no good reason really. I’m overwhelmed and paralyzed when faced with certain situations and decisions lately. I think that’s contributing to this for sure. My husband has no understanding of depression which makes me feel alone AF.",
    "tone_score": {
      "neg": 0.174,
      "neu": 0.663,
      "pos": 0.164,
      "compound": -0.6289
    }
  },
  {
    "text": "struggling a lot lately with body image, self esteem, general self image, etc, and it's just kind of exacerbating everything else that's going on in my life. I don't want to be seen or perceived. I hate that people are looking at me and seeing how ugly and disgusting I am. I just want to disappear. feeling so low.",
    "tone_score": {
      "neg": 0.3,
      "neu": 0.677,
      "pos": 0.023,
      "compound": -0.9472
    }
  },
  {
    "text": "It’s like clockwork. The season changes and with it my depression gets worse. But it feels different from my summer depression. The pressure is on different aspects of my life. I feel stuck. I find myself repulsive. I look unnatural and inhuman. I look at myself and see something that shouldn’t look back at me.",
    "tone_score": {
      "neg": 0.24,
      "neu": 0.732,
      "pos": 0.028,
      "compound": -0.9186
    }
  },
  {
    "text": "I found out that i can cry on command and thought it was cool until i realized that im always sad and on the verge of crying so thats why i can easily cry. I tear up at the most random moments and almost always in bed before i sleep",
    "tone_score": {
      "neg": 0.225,
      "neu": 0.69,
      "pos": 0.085,
      "compound": -0.8271
    }
  },
  {
    "text": "I'm not sleeping, in exhaustion i fall asleep at 8 pm every night, only to wake up at midnight till 4 am. it's horrible.\n\nI feel so gross and unworthy. Why even try when nothing fucking matters. I have fallen off the self compassion train today.",
    "tone_score": {
      "neg": 0.267,
      "neu": 0.638,
      "pos": 0.096,
      "compound": -0.8443
    }
  },
  {
    "text": "After getting rejected from a life changing job after the fifth interview round, I’ve honestly wasted the last few days doing absolutely nothing. I know it’s normal to feel down but I haven’t felt like this before I got on antidepressants, I guess I had the assumption that my depression was “cured” so it’s scary to realize that I was just managing it alright up until now. Except now I’m medicated and still depressed so I don’t really know how to get out of this rut on my own.",
    "tone_score": {
      "neg": 0.186,
      "neu": 0.736,
      "pos": 0.078,
      "compound": -0.9139
    }
  },
  {
    "text": "My girlfriend is the only thing keeping me sane and keeping me from killing myself, and I feel like I’m pushing her away and she’s not liking me as much as she used to. And I hate that I’m so dependent on someone.",
    "tone_score": {
      "neg": 0.208,
      "neu": 0.742,
      "pos": 0.05,
      "compound": -0.8342
    }
  },
  {
    "text": "hows everyone . im doing shit again. idk why my mood swings batshit crazy to both extremes",
    "tone_score": {
      "neg": 0.363,
      "neu": 0.637,
      "pos": 0.0,
      "compound": -0.7506
    }
  },
  {
    "text": "I’ve lost my life-long interest in music & idk I’m scared this is one major step towards me deciding life really isn’t for me",
    "tone_score": {
      "neg": 0.231,
      "neu": 0.664,
      "pos": 0.105,
      "compound": -0.3818
    }
  },
  {
    "text": "I don't wanna be here anymore. I'm so so so tired.",
    "tone_score": {
      "neg": 0.329,
      "neu": 0.671,
      "pos": 0.0,
      "compound": -0.6618
    }
  },
  {
    "text": "these stupid thoughts and these stupid struggles, man i'm getting older and everyone is moving except for me and it's making me start to think again there's only one way out of this for me",
    "tone_score": {
      "neg": 0.225,
      "neu": 0.775,
      "pos": 0.0,
      "compound": -0.8519
    }
  },
  {
    "text": "I was supposed to go on a date today but the guy flaked on me and didn’t respond to my text this morning so I’ve been laying on bed crying all day. I don’t know why I even try to date because it always ends up this way.",
    "tone_score": {
      "neg": 0.088,
      "neu": 0.912,
      "pos": 0.0,
      "compound": -0.631
    }
  },
  {
    "text": "Im miserable in my life. Why? Because im broke constantly? Because im broken inside? Im an emotional eater and im just eating my way into more misery. I hate my fat disgusting self. But eating makes me feel better, then I gain more weight and I hate myself more. Im hoping I’ll just eat my way into a heart attack or just freaking explode!",
    "tone_score": {
      "neg": 0.31,
      "neu": 0.533,
      "pos": 0.157,
      "compound": -0.9103
    }
  },
  {
    "text": "So tired of life consisting of one problem after another. It's just pain and then some more pain. Even when things are better, they're never good. Tired.",
    "tone_score": {
      "neg": 0.371,
      "neu": 0.497,
      "pos": 0.132,
      "compound": -0.8622
    }
  },
  {
    "text": "I’ve been doing good for so long but I’m starting to feel the little aches of depression again. I need to catch myself before I go off this slope. I’m scared",
    "tone_score": {
      "neg": 0.282,
      "neu": 0.666,
      "pos": 0.052,
      "compound": -0.863
    }
  },
  {
    "text": "i wish i was dead.",
    "tone_score": {
      "neg": 0.537,
      "neu": 0.125,
      "pos": 0.338,
      "compound": -0.3818
    }
  },
  {
    "text": "I'm still a failure, hurt by everything, unable to change anything. I wish there was someone I could talk to but nobody can understand. I'm done trying to explain myself. I don't want to talk to anyone.",
    "tone_score": {
      "neg": 0.156,
      "neu": 0.794,
      "pos": 0.051,
      "compound": -0.4278
    }
  },
  {
    "text": "I stopped taking antidepressants because they take away all my emotions, and now I am depressed af again. Weird, right? Completely unpredictable.",
    "tone_score": {
      "neg": 0.289,
      "neu": 0.711,
      "pos": 0.0,
      "compound": -0.7096
    }
  },
  {
    "text": "bad acne bad skin impacting social life :(",
    "tone_score": {
      "neg": 0.664,
      "neu": 0.336,
      "pos": 0.0,
      "compound": -0.872
    }
  },
  {
    "text": "I’m not doing well in life. This is not where I thought I’d be at 31. I got a DUI (in July) on the one night I decided to go out and let loose. It made it so that I had to quit my job (I drove to clients homes) and I am STILL out of work and job hunting. Everyday feels like I’m being crushed more and more. I’ve basically given up on dating because who would want to be with someone who can’t drive and isn’t working?! I’ve been tentative hired for a really good position but the drug test still hasn’t come in and it’s been weeks of waiting. I’m living with my parents after several life mistakes. Everything in my life is so uncertain and gloomy and I’m just so sick of feeling like a loser. If I didn’t have two dogs who need me I’d probably already be off of this planet by now.",
    "tone_score": {
      "neg": 0.145,
      "neu": 0.794,
      "pos": 0.06,
      "compound": -0.949
    }
  },
  {
    "text": "The weekend is here. A few days ago I cried a little at night and struggled to fall asleep. I've been feeling like a zombie recently. The lockdown is lifted but because I'm staying with my parents, they forbid me to meet anyone, and I'm too tired to even get into fights like I used to.",
    "tone_score": {
      "neg": 0.219,
      "neu": 0.681,
      "pos": 0.099,
      "compound": -0.8225
    }
  },
  {
    "text": "i wish things were a bit easier. i hate that i get a little sliver of hope sometimes. it makes the inevitable failures hurt a lot more.",
    "tone_score": {
      "neg": 0.304,
      "neu": 0.451,
      "pos": 0.245,
      "compound": -0.4522
    }
  },
  {
    "text": "Oh, god, I needed this back sooo bad lol. I was sad yesterday for no reason at all which made me sensitive and got me sad about every little goddamn thing. I cried it all out. I felt so fucked up, like I'm forever this broken person and I'll never be fully okay. Still thinking about that atm.",
    "tone_score": {
      "neg": 0.362,
      "neu": 0.54,
      "pos": 0.098,
      "compound": -0.9661
    }
  },
  {
    "text": "I wish the voices in my head that I am a worthless piece of shit would stop being played over and over again.  I just want to put an end to it.",
    "tone_score": {
      "neg": 0.235,
      "neu": 0.593,
      "pos": 0.173,
      "compound": -0.5106
    }
  },
  {
    "text": "I think I've been acting like I'm okay when I'm really not. I've been sleeping a lot more these days and not really feeling refreshed. I've been sleeping a lot just so I don't have to face reality or live in reality which is bad. I just want to be happy but it's just so hard to do that with depression. I feel so numb inside.",
    "tone_score": {
      "neg": 0.2,
      "neu": 0.707,
      "pos": 0.093,
      "compound": -0.8668
    }
  },
  {
    "text": "Today is not a good day. Woke up with my face swollen. Trying to challenge the BDD thoughts. I look like shit, genuinely and it's all from stress. \n\nI got out of bed at 12, despite my counsellor telling me to not stay in bed. I exercised a lot yesterday and just felt exhausted. I'm also frustrated that I haven't been able to get my Covid shot despite wanting to get it. I still have to report to the government and I'm out of food and it feels like my life is falling apart and I'm drowning. I've also been having imaginary conversations to cope with the pain of neglect.",
    "tone_score": {
      "neg": 0.187,
      "neu": 0.761,
      "pos": 0.052,
      "compound": -0.946
    }
  },
  {
    "text": "literally stared at my face for so long in the mirror and realized how ugly i am and how much i hate my face i started crying. i just wish i could be pretty",
    "tone_score": {
      "neg": 0.253,
      "neu": 0.6,
      "pos": 0.148,
      "compound": -0.6369
    }
  },
  {
    "text": "I don't want to go after anyone anymore. I just keep disappointing them. I'd rather disappoint myself alone than drag other people along with my mistakes. \n\nCan anyone give me advice on how to isolate myself without my friends noticing my intentions?",
    "tone_score": {
      "neg": 0.358,
      "neu": 0.642,
      "pos": 0.0,
      "compound": -0.931
    }
  },
  {
    "text": "things in my life have been so stressful for so long, and I don’t see it getting any better any time soon. I am extremely burnt out in my job, but without a routine I fall apart. I just need a solid month where nobody in my life is dying, sick, or suicidal, and I have an ok day at work. That’s apparently too much to ask from the universe. I don’t how much more of this I can take, I feel like I have spent the last 3 years running on fumes as it is.",
    "tone_score": {
      "neg": 0.144,
      "neu": 0.757,
      "pos": 0.099,
      "compound": -0.7629
    }
  },
  {
    "text": "havent had any dark thoughts until yesterday when i joined a discord call with some old friends and one dude was going thru okcupid and tinder and damn my self esteem took a nosedive. all the girls have all these cute photos and im just here.. going thru my gremlin era. im not looking for anyone but for that one moment just watching my friend's stream was so exhausting i had to leave the call and just head to bed. i guess its good that i know when the dark thoughts come back instead of just leaning along with it and making myself feel like shit the rest of the night",
    "tone_score": {
      "neg": 0.117,
      "neu": 0.791,
      "pos": 0.092,
      "compound": -0.4787
    }
  },
  {
    "text": "This loneliness is torture. Fuck, I wanna die.",
    "tone_score": {
      "neg": 0.825,
      "neu": 0.175,
      "pos": 0.0,
      "compound": -0.9337
    }
  },
  {
    "text": "Just lock me up in a room, give me a PC and a matress, and let me rot till I die, so I don't have to deal with this bullshit anymore. Just let it fucking end.",
    "tone_score": {
      "neg": 0.225,
      "neu": 0.775,
      "pos": 0.0,
      "compound": -0.8555
    }
  },
  {
    "text": "perfect thing right would be me being home alone, heavy ass rain outside and I go lay out there to just cry and cry to my heart’s content.",
    "tone_score": {
      "neg": 0.313,
      "neu": 0.588,
      "pos": 0.099,
      "compound": -0.7906
    }
  },
  {
    "text": "I slept in till 5pm today, no motivation to even get up, just want to sleep the whole day away. I'm so damn depressed",
    "tone_score": {
      "neg": 0.299,
      "neu": 0.581,
      "pos": 0.119,
      "compound": -0.7629
    }
  },
  {
    "text": "Hey guys, I'm not doing well this weekend and I just need to vent. \n\nFamily- My Asian mom is complaining all the time. Our relationship has hit rock bottom. \nWork- I hate my job and am on the verge of quitting to jump into my side job, taking up full-time hours. \n\nI want to move out, but everyone's telling me \"This is not the right time! We're in the middle of a pandemic\". I have a lot of pent up anger. At this rate, I am going to develop anger mgmt issues. I can't go out of the house, lest I bring back COVID-19 and kill my aging parents, according to their reasoning (not going to dispute that possibility, but losing the freedom of movement sucks).\n\nI have stopped checking social media because honestly it's a waste of time, and every time I click into the app, I see all my friends who are traveling and having a good time because they can, after lockdown restrictions are eased. I don't even talk to my friends now because every time they ask me to hang out I just feel like a complete loser who's on house arrest",
    "tone_score": {
      "neg": 0.185,
      "neu": 0.688,
      "pos": 0.126,
      "compound": -0.928
    }
  },
  {
    "text": "A recurring thought that I have to face every other day is how things could have been different if I did X, Y or Z, or if my parents didn't messed me up so much. But it is the biggest lie there is. Only what can happen does happen.\n\nThey had their own living hell of a life, it is an endless cycle of suffering, and all in all they actually did the best they could for me. The trauma was inevitable and at the end of the day is no one's fault.\n\nIt fills me with determinism that both gives me some relief and makes me question what's the point, if I'm just a puppet for fate.\n\n\"Whatever happens to you has been waiting to happen since the beginning of time.\" - Marcus Aurelius.",
    "tone_score": {
      "neg": 0.135,
      "neu": 0.789,
      "pos": 0.075,
      "compound": -0.8788
    }
  },
  {
    "text": "It’s not even that I want to die, it’s that I cannot keep living like this.\n\nI was diagnosed with depression as a teenager years ago, not a candidate for medication as it conflicts with other medication I take that is medically necessary. I’m exhausted all the time, and have no motivation left for anything. I’ve been having a par toculatly hard time with my depression the last few months, and Then I got hit with some really crappy news this week.\n\nI live in a lot of physical pain, have for over a decade. I made my peace with that, it didn’t contribute to my depression. But now, I have a new condition, that my doctor says will never go away, never get better, only grown worse. My insides hurt all the time. I’d figured out how to live with my other chronic pain issues, but this is somehow so different.\nI just want one part of my body not to hurt. The diagnosis has crippled my already shockingly poor mental health, and I’ve lost the will to live entirely. I can’t do any of the things I enjoy, and I’m now terrified my boyfriend will leave me, and he’d have every right to do so. He didn’t sign up for this. He wants kids, and I can’t have them let alone raise them or mother then. I don’t even know how to tell him yet. I just got the diagnosis this week. Why would he possibly want me once he knows? I know it’s selfish, but I feel like I need time to process my grief myself before I speak to him, tell him our entire life plan is out the window, and I’m no longer what he wanted.\nHell, I probably won’t even be able to have sex soon. I’m getting more depressed and harder to be around. I feel like no matter how hard I try, I’m a colder, crueller person. I rarely make jokes anymore. I miss who I used to be. I feel like I’m grieving for my own death.\n\nI get criticized for keeping my thoughts and feelings to myself, and not opening up or sharing and when I do, I can’t actually talk to anyone about it, because they either worry over something they can’t fix, or tell me that my life is too sad or too depressing or they ‘can’t handle it’.\n\nOne of my good friends committed suicide a while ago. I miss her, and a lot of things are reminding me of her lately. I hope her pain is gone now. I know it’s selfish, but I wish she was still here. She was one of the best people I’ve ever known.\n\nI have a dog who I could not live without, and I worry that when she’s gone, I’ll lose my last reason to stay here. She got me through my worst months of depression, my suicidal thoughts a few years ago, and she continues to get me through the worst days. I just want something. To get better. Anything really.\n\n\nI appreciate having this space to vent about bad days, months, years. To vent About depression to people who understand what it’s like. To rant about how crippling depression itself can be, and how much harder it makes a bad day.  I hope all of you find some peace, relief, or joy in something. I hope your pain eases soon, and that you have better days ahead of you.",
    "tone_score": {
      "neg": 0.297,
      "neu": 0.613,
      "pos": 0.09,
      "compound": -0.9993
    }
  },
  {
    "text": "I am sure I struck out for the last time during my practicum today. So, I have officially failed once more. I don't know how to process this at the moment.",
    "tone_score": {
      "neg": 0.175,
      "neu": 0.753,
      "pos": 0.072,
      "compound": -0.5046
    }
  },
  {
    "text": "I’ve been reading more to try to distract myself. It doesn’t matter how well things are going in my life because I always feel awful. It’s a weight in my chest that climbs up my throat when I’m just sitting in the office. I do so many of the things they tell you to do for your health and it doesn’t really do much more than keep me from spiraling. I look at life and I’m disappointed that this is all I get to look forward to for every day until I die.",
    "tone_score": {
      "neg": 0.127,
      "neu": 0.84,
      "pos": 0.033,
      "compound": -0.875
    }
  },
  {
    "text": "why did I think anyone would remember my birthday? I'm in my late 20s, but it still hurts.\n\nmy grandma died last week. she always remembered. I can't believe she's gone. it wasn't supposed to be like this. I don't know what to do.",
    "tone_score": {
      "neg": 0.18,
      "neu": 0.755,
      "pos": 0.065,
      "compound": -0.7783
    }
  },
  {
    "text": "I feel so tired all the time and it’s really hard to get up every morning. I have no motivation to do my work and just want to do nothing. I feel so lonely all the time and can’t seem to connect with people and develop friendships. Why even try.",
    "tone_score": {
      "neg": 0.182,
      "neu": 0.706,
      "pos": 0.111,
      "compound": -0.6158
    }
  },
  {
    "text": "Pls kill me.",
    "tone_score": {
      "neg": 0.671,
      "neu": 0.143,
      "pos": 0.186,
      "compound": -0.6597
    }
  },
  {
    "text": "Wanting to die right now.",
    "tone_score": {
      "neg": 0.494,
      "neu": 0.506,
      "pos": 0.0,
      "compound": -0.5994
    }
  },
  {
    "text": "My head is shaped like a football and it makes me want to kill myself. :(",
    "tone_score": {
      "neg": 0.339,
      "neu": 0.491,
      "pos": 0.17,
      "compound": -0.7003
    }
  },
  {
    "text": "This anxiety is killing my heart and lungs lol. I keep forgetting how to breathe. Fk.",
    "tone_score": {
      "neg": 0.292,
      "neu": 0.574,
      "pos": 0.134,
      "compound": -0.5106
    }
  },
  {
    "text": "Wish constsntly I would die already. Sick of feeling constantly worthless and does not help my mom died this year and 1 of my cats I had stay with someone else till I ciuld sort out myself but no luck still after years for getting a proper job.",
    "tone_score": {
      "neg": 0.244,
      "neu": 0.625,
      "pos": 0.131,
      "compound": -0.6345
    }
  },
  {
    "text": "I need to prepare for a major assessment and I think it's my primary source of stress right now. I've been finding it hard to get the motivation to work on it, I tried to break it down in to small tasks but that just seems like it added the number of things i need to do and it hasn't motivated me. \n\nI kind of feel motivated right now, like I feel like I can do it but i dont have the energy to do it. So I'm not doing it. and i feel like shit. I don't feel overwhelmed by the tasks and I should  get on with it while it lasts but now I dont have the energy for it. Why can't i be productive?",
    "tone_score": {
      "neg": 0.149,
      "neu": 0.732,
      "pos": 0.119,
      "compound": -0.4504
    }
  },
  {
    "text": "Feel miserable, I keep fucking things up",
    "tone_score": {
      "neg": 0.39,
      "neu": 0.61,
      "pos": 0.0,
      "compound": -0.4939
    }
  },
  {
    "text": "I'm doomed.",
    "tone_score": {
      "neg": 0.808,
      "neu": 0.192,
      "pos": 0.0,
      "compound": -0.6369
    }
  },
  {
    "text": "Just faced acute stress with fire alarms going off in my home. Turned out they were just old and were sounding to notify me to get new ones. I face chronic stress with starting a new job a couple months ago, but this really shook me to my core when I thought I had something serious occurring at home.\n\nNow trying to calm my nervous system as I continue the work day. I'm miserable that I had to miss two project meetings while I sorted out the issue with my utility company. I wish I could just shut off my work laptop and sleep the rest of the day.",
    "tone_score": {
      "neg": 0.17,
      "neu": 0.773,
      "pos": 0.057,
      "compound": -0.8355
    }
  },
  {
    "text": "Today was the first cold day of the season...I'm already depressed, but I forgot how much the cold affects me and makes it even worse...I feel very worried for how the winter will go...",
    "tone_score": {
      "neg": 0.148,
      "neu": 0.852,
      "pos": 0.0,
      "compound": -0.6586
    }
  },
  {
    "text": "I feel like a complete dick right now because my friend is coming to visit tomorrow and I asked if we could meet later in the day but they won't be in town for that long. They said it was, but I feel awful for making them wait for me to drag myself out of bed. I just haven't been able to do mornings at all, I have zero energy, and I just stay tired all day and have to take a nap in the evening. I get insomnia, wake up in the night, can't fall asleep til 6 am, clock out then wake up again usually after having a bad dream at 11 am or something. I nearly slept through christmas day because of this problem, slept right through my alarm and my family was really annoyed with me. I felt horrible. I've never done that before. :( I hate this.",
    "tone_score": {
      "neg": 0.241,
      "neu": 0.707,
      "pos": 0.052,
      "compound": -0.989
    }
  },
  {
    "text": "I have been sleeping so much lately. It's really tough being tired all the time. I know what I need(want) to do to feel less tired but can't get myself to do it (regular scheduled bed time and wake up, eat more fruits / veggies, exercise daily, cut out caffeine)",
    "tone_score": {
      "neg": 0.164,
      "neu": 0.836,
      "pos": 0.0,
      "compound": -0.736
    }
  },
  {
    "text": "Really? All I see is how inactive it is... understandable I guess I suck at responses...",
    "tone_score": {
      "neg": 0.195,
      "neu": 0.805,
      "pos": 0.0,
      "compound": -0.4404
    }
  },
  {
    "text": "I also adopted a 6 year old kitten about a year ago with absolutely no experience owning or living with a pet, there was about a 2 month period of figuring things out but after that it has been nothing short of amazing. I wouldn't be able to live on my own without her",
    "tone_score": {
      "neg": 0.117,
      "neu": 0.883,
      "pos": 0.0,
      "compound": -0.7054
    }
  },
  {
    "text": "Good shit bro… that’s insane",
    "tone_score": {
      "neg": 0.562,
      "neu": 0.179,
      "pos": 0.259,
      "compound": -0.5267
    }
  },
  {
    "text": "mm yes...I know the bedtime revenge well..",
    "tone_score": {
      "neg": 0.362,
      "neu": 0.638,
      "pos": 0.0,
      "compound": -0.5267
    }
  },
  {
    "text": "That can be terrifying, and it can also unleash a grieving process for our \"former selves\".  That's all a normal reaction to a difficult and necessary process.",
    "tone_score": {
      "neg": 0.311,
      "neu": 0.689,
      "pos": 0.0,
      "compound": -0.8591
    }
  },
  {
    "text": "Highly relatable :/",
    "tone_score": {
      "neg": 0.572,
      "neu": 0.428,
      "pos": 0.0,
      "compound": -0.3976
    }
  },
  {
    "text": "You are never too young to deal with depression. I, along with other family members, started experiencing it at a young age. My parents neglected it and I was left to struggle with it on my own through my teen years and start managing it in my adult years. Sometimes,  we have to take it one day at a time, sometimes even just a moment at a time. But,  please find that willpower that you possess and pull through this moment...",
    "tone_score": {
      "neg": 0.076,
      "neu": 0.887,
      "pos": 0.036,
      "compound": -0.3071
    }
  },
  {
    "text": "Difficulty telling what's real is happening to me too. Scary stuff..",
    "tone_score": {
      "neg": 0.384,
      "neu": 0.616,
      "pos": 0.0,
      "compound": -0.6808
    }
  },
  {
    "text": "why cant i just collapse to ground and die smoke so much my lungs bleed and i cant move existing among others is just humiliating at this point",
    "tone_score": {
      "neg": 0.192,
      "neu": 0.725,
      "pos": 0.083,
      "compound": -0.538
    }
  },
  {
    "text": "Glad you're doing okay lately - I know that can feel tenuous when we know the dark places in our heads could still come back, though.\n\n> I've seen a lot of messages about committing suicide in here.\n\nWe encourage people who are mainly seeking support related to suicidal thoughts or intent to post over in /r/SuicideWatch rather than here - [suicidality is actually a separate phenomenon from depression](https://www.reddit.com/r/depression/wiki/what_is_depression#wiki_suicidality), even though it's not uncommon for people to experience both at the same time. \n\nThat said, since depression and suicidality *do* occur together for many people, taking down every post that mentions suicidality wouldn't make sense here either. \n\n> It concerns me because this place shouldn't be for goodbye notes and declarations like that. This can be like an invitation for others to write their suicide note.\n\nMost people who post about even immediate-sounding intent don't go on to die by suicide - often it's the only way they feel able to reach out for support when they're in crisis. Seeing that other struggle with suicidal thoughts isn't, in and of itself, a factor for suicide risk - in fact, feeling less alone with suicidality can decrease a sense of alienation, which is one of the major risk factors for suicidality. \n\nWhile SW is the better place for posting suicidal thoughts/intent specifically, how people express their struggles is not as much a concern to us as how commenters respond - we encourage people to write thoughtful, individualized responses, and avoid responses that aren't responsive to the OP's experience and needs, general uplifting messages, prescribing and incitement (rules 2, 4-8), as all of those are things that *are* known to increase risk and generally make people feel worse. \n\nIf you see any content of that nature on *any* post here, whether it mentions suicidality or not, please do report it so we can deal.",
    "tone_score": {
      "neg": 0.185,
      "neu": 0.723,
      "pos": 0.092,
      "compound": -0.9898
    }
  },
  {
    "text": "Fuck them",
    "tone_score": {
      "neg": 0.778,
      "neu": 0.222,
      "pos": 0.0,
      "compound": -0.5423
    }
  },
  {
    "text": "Yeah I do. I think the extreme numbness is also a part of the depression. It gets so bad sometimes I actually start wanting to feel the sadness again",
    "tone_score": {
      "neg": 0.373,
      "neu": 0.565,
      "pos": 0.062,
      "compound": -0.8999
    }
  },
  {
    "text": "I am having the same thoughts. I am so tired. I don't want to be here anymore. I don't have anything that anchors me to this life. I don't want to keep trying only to end up sad and broken again and again. It's all just too much.",
    "tone_score": {
      "neg": 0.254,
      "neu": 0.746,
      "pos": 0.0,
      "compound": -0.8982
    }
  },
  {
    "text": "It is the sense of feeling defeated, even before attempting anything.  Yet, knowing it isn't going to go away so I feel guilty if I try to distract myself.",
    "tone_score": {
      "neg": 0.255,
      "neu": 0.7,
      "pos": 0.046,
      "compound": -0.7832
    }
  },
  {
    "text": "i wish i was born just normal so i could experience life like others its just a drab misery and being afraid of being scrutinized and beat up i dont know how to trust anyone i dont know anythign… my head is just rotten and dead it just keeps spiraling about everything terrible and it wont shut up",
    "tone_score": {
      "neg": 0.212,
      "neu": 0.663,
      "pos": 0.125,
      "compound": -0.7845
    }
  },
  {
    "text": "have i even experirnced trauma what even started this ?? is it just paranoic thoughts ive fed to myself that basically have immobilized me after all the years",
    "tone_score": {
      "neg": 0.177,
      "neu": 0.823,
      "pos": 0.0,
      "compound": -0.6553
    }
  },
  {
    "text": "I am in my late 30s, in the middle of what will be a divorce, at my spouse's request. We have been together 19 years and have no children. He has recently realized he is unhappy with everything in his life. Says he still loves/cares about me, but is not in love with me and wants to be alone. Even our therapists say it is not me, but it is hard not to take personally. But more so than that is he and his parents have been a very stabilizing factor in my life. My parents were abusive, still dysfunctional, and are now destitute. So, with losing him & his folks, I feel like I am losing what sense of normalcy I worked so hard to build over the years. It's devastating. I don't want to keep going on, continuing to try to better myself and build relationships that will only end in futility and despair. I had enough of that in my childhood. I've worked so hard not to have that in adulthood, yet here it is again. I am ready to stop.",
    "tone_score": {
      "neg": 0.2,
      "neu": 0.751,
      "pos": 0.049,
      "compound": -0.9826
    }
  },
  {
    "text": "I am so sorry they are going poorly for you too 💛! I understand the health aspect too, bc a few years ago I was diagnosed with Lupus/SLE. While it is mostly under control, I do have to be careful about doing what I can to prevent flare-ups. Needless to say, the stress of all of this is not helping (I imagine it is probably not helping your condition either 🙁). I read recently that women who become disabled in some way  (I still work in my career, but SLE still falls within the guidelines of a disability) are divorced by their spouses within a few years. I hate being part of that statistic. It definitely does not do wonders for my self esteem or my ability to believe I can find another partner one day.  I hope for us that the exhaustion & sadness can be transient.",
    "tone_score": {
      "neg": 0.12,
      "neu": 0.798,
      "pos": 0.082,
      "compound": -0.7028
    }
  },
  {
    "text": "It affects all of us differently. Others get even more emotional, others loose emotion. Others end up relying on the things they like/love because its all what they know while others loose interest in everything like things they liked/loved, all their interests(theres a word for that, but i forgot) others also loose their senses. Others get stuff like panic attack over the smallest things while others are just like eh fuck it all",
    "tone_score": {
      "neg": 0.22,
      "neu": 0.652,
      "pos": 0.127,
      "compound": -0.8901
    }
  },
  {
    "text": "For me it’s feeling like she is the only option out of my despair.  Irving is exciting except talking to or hanging out with her. I’m never happy unless she is around. It’s fucked. I want to kms every second of the day and then she says hi one time and everything feels better. But she is also the cause of my pain.",
    "tone_score": {
      "neg": 0.15,
      "neu": 0.736,
      "pos": 0.114,
      "compound": -0.6807
    }
  },
  {
    "text": "Depression makes me \\*more\\* emotional.  \n\n\nAntidepressants make me \\*less\\* emotional.  \n\n\nResult: ??????????\n\n&#x200B;\n\nDepression sucks. It manifests differently, for everyone. But it sucks.",
    "tone_score": {
      "neg": 0.352,
      "neu": 0.562,
      "pos": 0.086,
      "compound": -0.8426
    }
  },
  {
    "text": "Depression is making me have a crush again, even though she rejected me,she still checks up on me and knows that I'm not feeling well, maybe she just feels sorry for me",
    "tone_score": {
      "neg": 0.344,
      "neu": 0.656,
      "pos": 0.0,
      "compound": -0.8774
    }
  },
  {
    "text": "ILL TAKE 5",
    "tone_score": {
      "neg": 0.737,
      "neu": 0.263,
      "pos": 0.0,
      "compound": -0.4215
    }
  },
  {
    "text": "Fuck I shouldn't have laughed at that. But I'll be damned if that didn't remind me of college.",
    "tone_score": {
      "neg": 0.345,
      "neu": 0.655,
      "pos": 0.0,
      "compound": -0.7499
    }
  },
  {
    "text": "My second antidepressant made me completely numb for everything, had no emotions or interest in anything or anyone.\n\nNow on my new antidepressant, Im a little too emotional. I think the brain is trying to make up for being numb for over a year. Literally anything makes me cry and its annoying as hell.",
    "tone_score": {
      "neg": 0.275,
      "neu": 0.658,
      "pos": 0.066,
      "compound": -0.9282
    }
  },
  {
    "text": "Same. But it always changes and I hate it. Sometimes I feel so sad like soneone sucked my soul outta me. Sometimes I feel nothing. That is what I feel like right now.\nIf someone asks me how I feel today, I would say idk. I hate this shit.",
    "tone_score": {
      "neg": 0.387,
      "neu": 0.504,
      "pos": 0.109,
      "compound": -0.9672
    }
  },
  {
    "text": "shit sucks and i’m convinced there’s no way out",
    "tone_score": {
      "neg": 0.519,
      "neu": 0.312,
      "pos": 0.169,
      "compound": -0.6808
    }
  },
  {
    "text": "i’m the same with my music , i used to be able to pump them out like 4 beats a day but now i try to start and it’s just nothing. i don’t even want to do it anymore it sucks",
    "tone_score": {
      "neg": 0.12,
      "neu": 0.835,
      "pos": 0.046,
      "compound": -0.4278
    }
  },
  {
    "text": "I don’t know why but august - December has to be the worst time for my depression. I don’t think it has to do with the monotonous traditions of fake family interest (although I could very well do without the reoccurring pain in the ass it is) but something about the the second half of the year I always fall hard into despair…wish I knew what was causing it",
    "tone_score": {
      "neg": 0.244,
      "neu": 0.633,
      "pos": 0.123,
      "compound": -0.911
    }
  },
  {
    "text": "I have been thinking about this so much of late. Death may actually be a reality for me soon (bad reaction to covid vaccine and have to have 2nd one). At first I was terrified of the prospect but I have really started to come to terms with it. I am mid 30's now and I feel like I have experienced all that life has to offer and it does not get any better from here. I actually feel like life has diminished returns the older I get. There is no joy, not even a tiny glimmer. It's pain, misery and disappointment day in and day out. It's the same boring and mundane shit over and over. I don't think the cycle can be broken.",
    "tone_score": {
      "neg": 0.245,
      "neu": 0.666,
      "pos": 0.089,
      "compound": -0.9764
    }
  },
  {
    "text": "That we would find meaning in life is a misconception. I don't think there is any meaning in life, but instead started wondering why we would need meaning? There might not be much meaning to our actions in the grander scale of things, but on a small scale it matters.  \nYou describe clear symptoms of depression, and depression sucks! However, it doesn't have to last forever. Things like drinking will limit you on getting out of the depression. Try going to a therapist if you aren't already and get a routine to get energy flowing again. Play guitar, or go outside or anything, but set the bar low for yourself. It isn't about how well you do those things but see the fact that you did it as a victory in itself. Same for being social with other people and work, it doesn't have to go well. It never goes well all the time, but by continuing and putting in effort things might get easier again eventually. \n\nAlso just breaking down and being lethargic is okay as well. Just don't drink and allow yourself to be miserable until you can get up again. You life isn't worthless.",
    "tone_score": {
      "neg": 0.167,
      "neu": 0.722,
      "pos": 0.111,
      "compound": -0.9333
    }
  },
  {
    "text": "To me it’s like the older I get the more I have wasted my life. And then that makes me anxious. And it doesn’t matter what I do or achieve it all feels wasted because I can’t ever get the time back",
    "tone_score": {
      "neg": 0.197,
      "neu": 0.724,
      "pos": 0.079,
      "compound": -0.7474
    }
  },
  {
    "text": "i feel this. im in my last year in college majoring in a useless degree and i’m not even excited to graduate anymore. im burning through my savings living in a city and place i cannot afford. im so tired of waking up every single morning",
    "tone_score": {
      "neg": 0.18,
      "neu": 0.82,
      "pos": 0.0,
      "compound": -0.8214
    }
  },
  {
    "text": "I feel similar to I get paranoid for no reason. I've noticed my self defeating behavior has gotten worse. What worry me is i probably should go see a therapist.",
    "tone_score": {
      "neg": 0.379,
      "neu": 0.621,
      "pos": 0.0,
      "compound": -0.8957
    }
  },
  {
    "text": "I'm definitely with you on that one. I don't have any hobbies anymore I honestly don't care about anything. There were things I used to enjoy that now would just don't matter to me anymore. And I had one goal and I found out that goal can't happen. So now I'm just existing. And a longer I do the more bitter and hateful I become. Luckily for me, death may be a reality fairly soon. I've got a guy after me he wants to kill me. It may not be a quick death but at least it'll be an end to this shit. I'm happy to go.",
    "tone_score": {
      "neg": 0.178,
      "neu": 0.71,
      "pos": 0.112,
      "compound": -0.7653
    }
  },
  {
    "text": "I often just go home after work and drink a 6 pack just for the buzz. It is often said you are a loser if you drink by yourself. The reality is I just want the buzz and to pass the time. I know it's a shit way to spend your time but I feel overwhelming pointlessness whenever I do anything that requires effort. I don't feel competent at anything no matter how much information I consume. I consume so much damn information just to forget it in 10 minutes",
    "tone_score": {
      "neg": 0.182,
      "neu": 0.792,
      "pos": 0.026,
      "compound": -0.9295
    }
  },
  {
    "text": "My brain is literal shit. I start reading and after 5 pages I start reading something else or daydreaming.",
    "tone_score": {
      "neg": 0.194,
      "neu": 0.806,
      "pos": 0.0,
      "compound": -0.5574
    }
  },
  {
    "text": "What? Why would someone want to kill you?",
    "tone_score": {
      "neg": 0.409,
      "neu": 0.485,
      "pos": 0.105,
      "compound": -0.6966
    }
  },
  {
    "text": "He's my downstairs neighbor and I have panic attacks. He comes up and screams at me while pounding on my window s and front door so hard it almost came off the hinges",
    "tone_score": {
      "neg": 0.275,
      "neu": 0.725,
      "pos": 0.0,
      "compound": -0.8506
    }
  },
  {
    "text": "This man speaks truth. Not to sound like some old washed up drunk but if you think your life is hell now alcoholism is ten times worse.",
    "tone_score": {
      "neg": 0.369,
      "neu": 0.587,
      "pos": 0.044,
      "compound": -0.921
    }
  },
  {
    "text": "If you are depressed without her(any person on your mind), you most likely will be depressed with her. It's a fact",
    "tone_score": {
      "neg": 0.268,
      "neu": 0.732,
      "pos": 0.0,
      "compound": -0.765
    }
  },
  {
    "text": "I called the hotline once and they called the police on me, so i got arrested and sent to the hospital. It was my first time getting arrested and getting handcuffed lol.",
    "tone_score": {
      "neg": 0.185,
      "neu": 0.739,
      "pos": 0.077,
      "compound": -0.6068
    }
  },
  {
    "text": "I always get at my worst mentally when I’m tired and I’m very stressed so I k ow I’m just at my worst rn but I’ll be fine by the time the sun comes up. I just wish I could sleep and it’s frustrating to continually deal with this.",
    "tone_score": {
      "neg": 0.23,
      "neu": 0.667,
      "pos": 0.104,
      "compound": -0.7181
    }
  },
  {
    "text": "Just remember 1 rule in life. It does not make any difference to the world if you harm yourself. It will only worsen your situation. You need to start to find some purpose to your life. You will need to divert your mind from negative thoughts & start doing something that gives meaning to your own life. You will be surprised to know that I feel the opposite of what you do & you should feel heartening after listening to my life case. For a period of 50 years I felt worthless because my father told me what works for men in my bloodline at the age of 15 with a promise that I will not do what he had asked me to do till my 45th birthday or beyond. i kept my promise. I started using what worked for men in my bloodline at the age of 45 years & 6 months.  We call it work, with give & take. I did it for a long period. It was somewhere in the June of 2020 that all the people who were cause of my suffering started meeting their chosen fate. My problems started disappearing. I am unemployed since March 2020 but am feeling relieved that I listened to my father & chose to fail instead of jump the gun & become outright wrong if I chased success at that point. I knew what work, give & take in my bloodline was but the right time was chosen by my father which was after 45 years of age. All I had to do was take the beating letting our enemies live in a delusion that I did not know what to do. Even when I am unemployed I have touched all the bases & am free. It is not that I am imagining it but know that great times lie ahead.  My father had clearly told me that if I jump the gun it would mean I do not have the three rights needed for success (doing the right thing, the right way at the right time) will not be present & will make me wrong. Today the spring in my feet is very different from what it was till June of 2020 when i turned close to 50 years of age after having done what my father had told me to do after 45 years of age. I do not know whether you have legacy in your bloodline like I have in mine. Jumping the gun is a main reason people suffer. Secondly if the wrong influence in your bloodline has not been shown where they stand they only destroy your life. Of course the  wrong influence can only disappear if you know what to write & to whom. If all this sounds familiar to you you better do it. If it is not then you have a different path which must have been told to you by your father if you are are a son  from  a patriarchal family or by your mother if you are a daughter from a matriarchal family.  It is all about clearing the mess of your earlier life at this point or else the wrong influence will be around to destroy your next life. I hope you find a solution after reading my comment.",
    "tone_score": {
      "neg": 0.127,
      "neu": 0.793,
      "pos": 0.08,
      "compound": -0.9818
    }
  },
  {
    "text": "If anyone wanna talk or just get rid of that nasty weight from their chest, I'm all ears :))",
    "tone_score": {
      "neg": 0.167,
      "neu": 0.833,
      "pos": 0.0,
      "compound": -0.5574
    }
  },
  {
    "text": "All i managed to do in my 30 years of age is destroy my brothers 25 years old dreams and hopes. No wonder why he doesn't want to have anything to do with me. Im so fake. I don't even know who's the real me even is. I keep on sabotaging him and keeping him as an enemy even if hes not im so horrible. Why would anyone talk to me. I mean, im even lucky enough to have kept this facade of the \"Good girl\" even if im not for 10 years and keep stable relationship but i deserve everything i made my brother went trough.",
    "tone_score": {
      "neg": 0.112,
      "neu": 0.806,
      "pos": 0.082,
      "compound": -0.5027
    }
  },
  {
    "text": "Yikes that sounds traumatic, I can’t believe they cuffed you. Were you in serious danger when they called the police or did they just do it without a good reason?",
    "tone_score": {
      "neg": 0.31,
      "neu": 0.69,
      "pos": 0.0,
      "compound": -0.8691
    }
  },
  {
    "text": "Do you take medication? Maybe you shoud ask your doctor to get you a medication that will make you feel sleepy or make you fall asleep. Not being able to sleep worsens symptoms. I used to smoke weed every night to make me fall a sleep so i dont stay up overthinking about everything",
    "tone_score": {
      "neg": 0.06,
      "neu": 0.94,
      "pos": 0.0,
      "compound": -0.4767
    }
  },
  {
    "text": "I was suffering from schizophrenia/depression back then. After i got arrested, i was hospitalized for 10days.",
    "tone_score": {
      "neg": 0.36,
      "neu": 0.64,
      "pos": 0.0,
      "compound": -0.7351
    }
  },
  {
    "text": "I used to eat very little too. I was able to chew the food but i couldnt swallow it, because i was very anxious so my stomach didnt allow anything to go in.",
    "tone_score": {
      "neg": 0.155,
      "neu": 0.845,
      "pos": 0.0,
      "compound": -0.6044
    }
  },
  {
    "text": "When you push yourself to sleep you get more stressed out so its harder to sleep and that makes you more stressed and you get stuck in the cycle lol",
    "tone_score": {
      "neg": 0.204,
      "neu": 0.719,
      "pos": 0.077,
      "compound": -0.5553
    }
  },
  {
    "text": "Thank you, it’s hard to always feel that but I haven’t completely given up and I try to believe that it will stop one day. It feels so distant now but I believe you that it will happen",
    "tone_score": {
      "neg": 0.106,
      "neu": 0.848,
      "pos": 0.046,
      "compound": -0.3071
    }
  },
  {
    "text": "Ik it’s such a hard cycle to get out of, I’m anxious about a lot rn too and it’s like every time I try to stop the thoughts and sleep I feel like im forgetting something important and panic all over again. Like im scared to stop thinking",
    "tone_score": {
      "neg": 0.244,
      "neu": 0.593,
      "pos": 0.162,
      "compound": -0.5719
    }
  },
  {
    "text": "Learn to live life for the moment, you will never win if your fighting with self, life is hard, nothing we can do about it.\n\nAs for your younger self in those photos...... guess what your making her proud...... with how difficult life is look how far you’ve come. Keep pushing!",
    "tone_score": {
      "neg": 0.172,
      "neu": 0.828,
      "pos": 0.0,
      "compound": -0.83
    }
  },
  {
    "text": "I stumbled upon a YouTube video I made when I was a kid yesterday and the amount of life I had back then crushed me so I know the feel.",
    "tone_score": {
      "neg": 0.113,
      "neu": 0.887,
      "pos": 0.0,
      "compound": -0.4215
    }
  },
  {
    "text": "try  r/dating_advice maybe since the topic doesn’t seem very related to depression /lh",
    "tone_score": {
      "neg": 0.248,
      "neu": 0.752,
      "pos": 0.0,
      "compound": -0.6077
    }
  },
  {
    "text": "You should be focusing on yourself at your age anyway dude.  Don't end up like me at 37 with no life or social skills whatsoever and have a bunch of regrets, friends will come later.",
    "tone_score": {
      "neg": 0.171,
      "neu": 0.752,
      "pos": 0.078,
      "compound": -0.4039
    }
  },
  {
    "text": "I don't have many friends as well, two solid ones but they're in a different state now. I have acquaintances, sure, but they come and go. I don't hold much faith in meeting anyone new or them reaching out to hang out. \n\nThey're just people that come and go, that's the way I see it. My dog will always be 10000% there for me no matter what. People.. not so much. I used to dislike couples who only spent time with their kids or significant other. But now, I see why they do it. Why waste time on strangers who will let you down when you can invest your time in your immediate family.",
    "tone_score": {
      "neg": 0.12,
      "neu": 0.787,
      "pos": 0.093,
      "compound": -0.745
    }
  },
  {
    "text": "I feel you on this. I think trying to change our routine will help. Going for a walk\nOr getting more exercise and sun can be great for you . \n\nBeing depressed can make you super lethargic and lifeless . It’s good to break out of the cycle.\n\n As for not having friends. Don’t worry I’m 26 and I have two friends. I’m similar to you, hated getting hurt over and over again. That now I don’t want to make friends . \n\nBetter days are ahead and it won’t be so gloomy. If you need someone to vent to I’m here to listen",
    "tone_score": {
      "neg": 0.209,
      "neu": 0.647,
      "pos": 0.144,
      "compound": -0.7893
    }
  },
  {
    "text": "Thankyou! Needed this.\nWhat should i do now? I never go out of the house.Everything always seems SO gloomy.",
    "tone_score": {
      "neg": 0.154,
      "neu": 0.846,
      "pos": 0.0,
      "compound": -0.4438
    }
  },
  {
    "text": "Next time thank yourself for overcoming your insecurities, weakness and all the crap you are going through right now. \nYou got this you are strong. ᕙ(  • ‿ •  )ᕗ",
    "tone_score": {
      "neg": 0.228,
      "neu": 0.611,
      "pos": 0.161,
      "compound": -0.34
    }
  },
  {
    "text": "LMAO the toxic bitch saying depression is not real deleted his comments what a chicken. His user is YOU-SUCKKKK prob a dumb troll.",
    "tone_score": {
      "neg": 0.333,
      "neu": 0.524,
      "pos": 0.143,
      "compound": -0.7325
    }
  },
  {
    "text": "To the OP ignore the idiot who deleted his comments. I am sure you can go through it.",
    "tone_score": {
      "neg": 0.262,
      "neu": 0.633,
      "pos": 0.104,
      "compound": -0.5423
    }
  },
  {
    "text": "Hi, understand you. I had a good friend, whom I could explain my thoughts and feelings, but she went out of her depression period. Now we can’t talk. It feels like we would speak 2 different languages. \nSame with bf. He says “I know, what is depression. It is a real thing”, but at the same time I feel no understanding, when saying that don’t want to live. \nI know, that you said in your post about that no one cares, but I think that it is more related to people not understanding, how you can feel so miserable all the time. Why you can’t just go sport and party.",
    "tone_score": {
      "neg": 0.166,
      "neu": 0.707,
      "pos": 0.127,
      "compound": -0.8432
    }
  },
  {
    "text": "\"Hang yourself or don't hang yourself, you'll regret it either way\"\nI just keep surviving with the thought: \"If it becomes too bad, at least I can still kill myself\"\nJust keep going, but remember you'll always have an exit button.\nI sometimes try to think of it more as a superpower. You'll never be scared of death. And there are no hopeless situations when suicide is an option.",
    "tone_score": {
      "neg": 0.295,
      "neu": 0.65,
      "pos": 0.055,
      "compound": -0.9709
    }
  },
  {
    "text": "I quit the exact same combo and tried to go all natural with vitamins and shit....It didn't work well, Nearly killed myself and now I'm medicated again...",
    "tone_score": {
      "neg": 0.198,
      "neu": 0.723,
      "pos": 0.079,
      "compound": -0.5878
    }
  },
  {
    "text": "I do this. You're not crazy. It's a coping mechanism when you're lonely. I have mock conversations with people I know about the things I'm struggling with because the few people I'm around don't really care.",
    "tone_score": {
      "neg": 0.274,
      "neu": 0.675,
      "pos": 0.051,
      "compound": -0.8364
    }
  },
  {
    "text": "dude i do this too heck even my mom does it don‘t worry about it",
    "tone_score": {
      "neg": 0.182,
      "neu": 0.818,
      "pos": 0.0,
      "compound": -0.4404
    }
  },
  {
    "text": "I just want to kill myself :( \nI hate myself",
    "tone_score": {
      "neg": 0.681,
      "neu": 0.241,
      "pos": 0.078,
      "compound": -0.9001
    }
  },
  {
    "text": "If you don't mind can you tell me what makes you feel horrible? Is it feeling overwhelmed coz you failed a test or feel like you are a disappointment coz of procrastinating & lying down all day? Or can't find a carreer path to sustain a good living? Someone close passed away or you lost touch with all your friends & isolated yourself and now you feel awful? \nI'm always hear to talk :))",
    "tone_score": {
      "neg": 0.247,
      "neu": 0.627,
      "pos": 0.125,
      "compound": -0.9163
    }
  },
  {
    "text": "Another reason I want to die. I have to share this world and it’s air with heartless pieces of shit like you.",
    "tone_score": {
      "neg": 0.349,
      "neu": 0.456,
      "pos": 0.195,
      "compound": -0.7717
    }
  },
  {
    "text": "I don't know about receiving judgment from others as I haven't experienced it. But what you've been doing is pretty much spot on..\n\nIt's been 2 years, 10 days ago.. It gets better, and it gets worse along the way.. I guess you just learn to live with it.. One thing that helped me with the grief was an explanation I've read sometime in the aftermath. I'm paraphrasing - 'at the beginning it's the end of the world, because it literally is. the person you've lost was your whole life. Most of your experiences were in relation to that person. In order to get a little release from the grief, one should not try to hide it or make it smaller. Instead it should grow around it. Live with it. It does not get easier.. Grief does not get smaller.. It's still here, same as the first day you experienced it.. It just becomes a smaller part of your life as time goes on..'\n\n&#x200B;\n\nHere's a similar illustration, but I like to think of the circles getting bigger, and the grief staying the same size: [https://aftertheheartbreak.com/wp-content/uploads/2019/06/My-Stages-of-Grief.jpg](https://aftertheheartbreak.com/wp-content/uploads/2019/06/My-Stages-of-Grief.jpg)\n\n&#x200B;\n\nI'm not sure if grief is what you're experiencing, as this is a depression sub, but nevertheless I wish you all the best..\n\nListen to music - it can be a lifesaver. But not just the happy stuff. Things need to balance out.\n\nYou are not alone.. Life's a bitch, and then you die..",
    "tone_score": {
      "neg": 0.13,
      "neu": 0.764,
      "pos": 0.107,
      "compound": -0.8081
    }
  },
  {
    "text": "You're totally right. We did not chose to be born and we did not choose our parents. Yet we are pressured by society to be molded into a productive part to keep the machine running.   \n\n\nThis isn't about who's fault it is. We're suffering because we're in pain. There's nothing wrong with wanting to not participate in something you never asked to be a part of.",
    "tone_score": {
      "neg": 0.115,
      "neu": 0.818,
      "pos": 0.067,
      "compound": -0.5405
    }
  },
  {
    "text": "I'd question if feeling like you need to fold instead of carry on is truly your fault, isn't it just a question of what stressors you're up against, and if you genuinely feel they're worth/able to be fought against? The blame couldn't possibly fall solely on the individual, we're all pigeonholed into the routes we take, or feel we need too, through outside factors that build/influence us.",
    "tone_score": {
      "neg": 0.137,
      "neu": 0.772,
      "pos": 0.09,
      "compound": -0.5574
    }
  },
  {
    "text": "It’s not your fault that you’re suffering.\n\nIt is your responsibility to stop suffering.",
    "tone_score": {
      "neg": 0.407,
      "neu": 0.484,
      "pos": 0.109,
      "compound": -0.7304
    }
  },
  {
    "text": "I think people also love saying suicide is “selfish” and “weak” etc…partly as a way of deflecting any guilt or blame they might feel for not adequately supporting the depressed. It’s much easier to negatively label people than step up. There’s also so much narcissism in these labels too i.e “I’ve been through hard stuff and I’m soldiering on why can’t they.”",
    "tone_score": {
      "neg": 0.214,
      "neu": 0.692,
      "pos": 0.093,
      "compound": -0.7967
    }
  },
  {
    "text": "i hear this all the time but isn't it still my fault if i neglect that responsibility? i'm just so fucking tired of trying. i've been trying and fighting and failing to stop suffering for well over half my life and i feel like i'm getting close to my breaking point. what if nothing works? will it be my fault for not trying hard enough? where does personal responsibility end and uncontrollable circumstance begin in the realm of mental illness? how does anyone know if they've done \"enough\" to get better? no one has good answers to these questions in my experience",
    "tone_score": {
      "neg": 0.295,
      "neu": 0.597,
      "pos": 0.108,
      "compound": -0.9817
    }
  },
  {
    "text": "Sometimes it’s helpful just to share with people and get another opinion. I agree that people shouldn’t say “it’s selfish” it’s kind of anything but that. I’ve been staying alive all this time so I could try and be there for people and I’ve been at a place where I’m so low I want to end my very existence but you’re telling me that if I do that it’s my fault and that I’m being selfish. The alternative is selfish, making myself suffer for what.",
    "tone_score": {
      "neg": 0.201,
      "neu": 0.695,
      "pos": 0.104,
      "compound": -0.9286
    }
  },
  {
    "text": "Ofc. And just so you know, even though I have this knowledge and believe this I still blame myself for my illness every day. So never make yourself feel bad for the way you feel, just try to change it if your able to. And if not, that’s ok to it just sucks.",
    "tone_score": {
      "neg": 0.22,
      "neu": 0.78,
      "pos": 0.0,
      "compound": -0.8998
    }
  },
  {
    "text": "It helped numb some anxiety. That's about it for me",
    "tone_score": {
      "neg": 0.339,
      "neu": 0.661,
      "pos": 0.0,
      "compound": -0.4767
    }
  },
  {
    "text": "It does numb anxiety, which is one of my weaknesses. As far as depression, don’t really notice any significant changes, however I have found myself becoming somewhat more outward that I would have in past.\n\nIt really depends on the individual, as far as effects I would assume.",
    "tone_score": {
      "neg": 0.197,
      "neu": 0.764,
      "pos": 0.039,
      "compound": -0.804
    }
  },
  {
    "text": "The most important thing is listening and trying to help them sort through the issues that have led them to that point. Don’t try to fix it or contradict; perception is reality and their feelings are real to them. If possible, ask them to agree to keep safe until they can get help. The best thing to offer is your ear and your shoulder to cry on. If you’re concerned that an attempt is immanent, it’s ok to contact emergency services for a welfare check: never put yourself in a dangerous situation, and don’t take personal responsibility for their mental health onto yourself. But remember, the decision of suicide is ultimately their decision. You can say or do absolutely everything “right” and they may still decide to follow through. It doesn’t mean you failed, or you were a bad friend/relative. If you want to get some decent training, look into a suicide first aid course like ASIST or Safetalk. They offer lots of great skills that can, hopefully, help you talk someone through their crisis point and get them to the help that they need.",
    "tone_score": {
      "neg": 0.153,
      "neu": 0.697,
      "pos": 0.15,
      "compound": -0.7753
    }
  },
  {
    "text": "The first warning was probably when I told a teacher I was having trouble differentiating between my dreams and reality. Got ignored.\nThe real clincher was me attempting to harm myself while in basic training for marine corps. I was diagnosed as a chronic depressant towards suicidal tendency. Discharged with no further help. This was in the late 80s",
    "tone_score": {
      "neg": 0.286,
      "neu": 0.637,
      "pos": 0.076,
      "compound": -0.93
    }
  },
  {
    "text": "i was always feeling sad and knew about depression. i started having suicidal thoughts and my parents always told me my apitite was decreasing. i had one week where i had three anxiety attacks (like a panic attack but a bit less worse). i now genuinely don’t remember how it feels like to not be tired and be happy. it’s a long lost ancient legend for me at this point. i took the nhs self assessment over the course of 2 months almost every day and other tests too, they all came out with highly moderate/ severe depression. i haven’t told anyone about it since i’m pretty young so no ones gonna believe me since i’m not professionally diagnosed, but i am starting creative therapy around January. i’ve got much worse symptoms and experiences but not gonna write a whole essay to spare u the trouble",
    "tone_score": {
      "neg": 0.218,
      "neu": 0.66,
      "pos": 0.122,
      "compound": -0.9273
    }
  },
  {
    "text": "I feel you man. This shit sucks",
    "tone_score": {
      "neg": 0.604,
      "neu": 0.396,
      "pos": 0.0,
      "compound": -0.7269
    }
  },
  {
    "text": "I'm completely ready to accept whatever my fate is. I don't even care how I am remembered, I don't care if I am remembered. Same as you man, I'm just burnt out, done with everything. I don't have the guts to end myself and if I did, I wouldn't, because I'm afraid of hurting my family. I'm going to live for them, until something kills me. Basically, I'm done.",
    "tone_score": {
      "neg": 0.157,
      "neu": 0.766,
      "pos": 0.077,
      "compound": -0.7003
    }
  },
  {
    "text": "Yeah same, I’m actually planning to kill myself",
    "tone_score": {
      "neg": 0.364,
      "neu": 0.465,
      "pos": 0.171,
      "compound": -0.5423
    }
  },
  {
    "text": "Yep. I feel this deeply today; just sitting at work thinking about how to kill myself.",
    "tone_score": {
      "neg": 0.236,
      "neu": 0.653,
      "pos": 0.111,
      "compound": -0.5423
    }
  },
  {
    "text": "I don't honestly know if I'll make it, and I accept that now. If I don't make it out, with my dying thoughts evaporating from existence, I will remember all of my comrades  who suffered with me in life.",
    "tone_score": {
      "neg": 0.141,
      "neu": 0.794,
      "pos": 0.065,
      "compound": -0.4731
    }
  },
  {
    "text": "I usually scroll past these but the typo caught my eye. The way you are wanting to do it is probably one of the most excruciating painful ways of all, please throw out your rope. Harness that energy to make yourself better.",
    "tone_score": {
      "neg": 0.19,
      "neu": 0.642,
      "pos": 0.168,
      "compound": -0.4951
    }
  },
  {
    "text": "I know right? I’m shocked that there are people out there that don’t come from tragic backgrounds and their parents aren’t toxic",
    "tone_score": {
      "neg": 0.218,
      "neu": 0.782,
      "pos": 0.0,
      "compound": -0.6486
    }
  },
  {
    "text": "Sounds like you're basically answered your own question, but you can put it another way. You can either do nothing, and know that things will never improve, or you can take some medications where you at least have a chance that things will improve.",
    "tone_score": {
      "neg": 0.126,
      "neu": 0.788,
      "pos": 0.086,
      "compound": -0.453
    }
  },
  {
    "text": "https://assets.nhs.uk/tools/self-assessments/index.mob.html?cookie_consent=false&variant=44\n\nthis self assessment test helped me identify my depression. i am no professional and don’t want to give u wrong information :)",
    "tone_score": {
      "neg": 0.307,
      "neu": 0.546,
      "pos": 0.147,
      "compound": -0.6908
    }
  },
  {
    "text": "If you are having frequent suicidal thoughts maybe now isn’t the best time to buy your first firearm. Nobody is shitting on you, it’s just common sense.",
    "tone_score": {
      "neg": 0.206,
      "neu": 0.676,
      "pos": 0.118,
      "compound": -0.4767
    }
  },
  {
    "text": "I’ve been having these thoughts for 5+ years. I have come to terms with them and accepted them. I have learned to recognize when I am thinking rationally an when I am not. I am able to realize when my depression is making me think radical things and I am able to not act on them. I am at a point in my life where I am making more effort to get better than I ever have before.\n\nI have the URGE to die sometimes, that is a product of my illness. I don’t WANT to die. Those are two very different things.\n\nIf I wanted to die I could kill my self literally tonight. I have access to drugs, I have access to weapons, I have access to high buildings, literally any method of suicide I could do. I know myself and I am able to recognize when I have become a danger to myself, and I know for a fact that that has not happened for a long time.\n\nSuicidal thoughts ≠ suicidal intention.",
    "tone_score": {
      "neg": 0.231,
      "neu": 0.731,
      "pos": 0.038,
      "compound": -0.9903
    }
  },
  {
    "text": "I feel the same way. I’ve attempted suicide many many times, I’ve been admitted to the psych ward 3 times for trying to kill myself. I just don’t want to hurt anyone",
    "tone_score": {
      "neg": 0.321,
      "neu": 0.611,
      "pos": 0.069,
      "compound": -0.9169
    }
  },
  {
    "text": "So I just got out of being inpatient for a while.\n\nFrankly broke me but that’s what I needed, maybe it would help for you as well. Something about locking yourself away and being forced to deal with your shit has a way of working.",
    "tone_score": {
      "neg": 0.204,
      "neu": 0.679,
      "pos": 0.117,
      "compound": -0.6808
    }
  },
  {
    "text": "Dude you have people who care about you. That’s so special. You should be happy to have people like that in your life. \n\nBut I feel you dude. I spent last crying alone on my bathroom floor. Smashing and throwing things around. Shits hard to but we need to keep pushing.",
    "tone_score": {
      "neg": 0.2,
      "neu": 0.663,
      "pos": 0.137,
      "compound": -0.7144
    }
  },
  {
    "text": "I've seen a lot of people giving some emotional advice, but what about the medical aspect? How is your arm? Is it still bleeding? Do you have first aid supplies and have you/can you clean it?\n\nAlso: harm reduction thing that works well for me is plucking leg or arm hairs. Weird but it gives you a little jolt of pain without physically harming yourself. Rubber bands are also good!!\n\nYou said you're a chronic pain patient, and man, that's such a hard thing to deal with. It's exhausting to not get answers, proper treatment, and to be continuously gaslighted by medical professionals. And it's also exhausting to have to take care of yourself! I'm really sorry you're going through all of this. I'm in the same boat. It's hard. People don't realize how hard it is.",
    "tone_score": {
      "neg": 0.179,
      "neu": 0.694,
      "pos": 0.127,
      "compound": -0.8271
    }
  },
  {
    "text": "I know it's not the case for everyone but life has a way of shocking you.\n\nI spent most of my life depressed and on meds for it, have three past suicide attempts and spent years self harming in various ways.\n\nThe last four years my entire life has turned around, I have an amazing family, sorted my weight out and am getting my head in check through therapy.\n\nLike I said I know it's not always the case but sometimes something clicks and life falls into place, it's never too late for it to happen.",
    "tone_score": {
      "neg": 0.172,
      "neu": 0.753,
      "pos": 0.076,
      "compound": -0.9136
    }
  },
  {
    "text": "I also feel like it. I am a bit scared of death but if it will be fast i wont mind except that i dont want my family abd friends to be upset",
    "tone_score": {
      "neg": 0.247,
      "neu": 0.594,
      "pos": 0.159,
      "compound": -0.3034
    }
  },
  {
    "text": "No you don't wanna die it's just the weakness inside you that wants a escape from reality, it hates to suffer hence it makes you suffer. You gotta show that weak ass inner bitch that you are stronger than this. Not only the people who care about you will be hurt when you take your own life but most the important person *You* will be hurt. The *You* who wanted to live a great life experiencing everything whether it meant going through failure, pain or suffering to get the prize, the *You* who imagined a good life, where you are competitive, strong & loving will be hurt. \n\nYou can't just end your life and disappoint & hurt yourself. If you are willing to go through so much pain to end your life & hurt your loved ones & the real you then why not endure a little bit more pain and live a life where you are not afraid to face challenges & adversities and make yourself proud that \"oh hell yeah I overcame the worst time if my life & made myself a better & stronger person\".\n\nSorry I just wrote what I felt it might not even make sense for some but take care of yourself.",
    "tone_score": {
      "neg": 0.272,
      "neu": 0.518,
      "pos": 0.209,
      "compound": -0.9605
    }
  },
  {
    "text": "If you want to die, throw yourself into a river and watch your body fight to survive. What you truly want to do is kill that part of you. \n\nIt's ok to ask for help. We're all in this together. Might sound cheesy, but everyone has shit they're deal with however big or small. And a lot of the times we fight for so long within our lonely battles, that we get clouded from the goodness that life has to offer and how precious it is. Once we give up, we end up in this dark void within us completely obscure of life, only suffering. In those times you can go mad if you linger alone for too long. So please dont just internalise it all, let it out. It's ok to ask for help.",
    "tone_score": {
      "neg": 0.199,
      "neu": 0.648,
      "pos": 0.153,
      "compound": -0.8693
    }
  },
  {
    "text": "I’ve been in chronic pain for years and that getting worse on top of having my heart broken has just crushed me to be honest",
    "tone_score": {
      "neg": 0.338,
      "neu": 0.522,
      "pos": 0.14,
      "compound": -0.802
    }
  },
  {
    "text": "I find myself getting very angry at people who love me because I can’t understand why they do. \n\nI hate living with mental illness. It’s not that I want to die so much as that I just want to not suffer all the time.",
    "tone_score": {
      "neg": 0.3,
      "neu": 0.57,
      "pos": 0.13,
      "compound": -0.8067
    }
  },
  {
    "text": "One of them is my ex and I just don’t want to be a Burden in her life or make her feel like she needs to stay around for fear of what I’ll do",
    "tone_score": {
      "neg": 0.161,
      "neu": 0.739,
      "pos": 0.1,
      "compound": -0.5106
    }
  },
  {
    "text": "I’m also a drug addict that was sober for 4 months which is the longest time I’ve been sober other than being locked up in juvie since I was 12. Meth helps the suicidal thoughts go away for a minute or two but when you come down it comes back worse than before.",
    "tone_score": {
      "neg": 0.126,
      "neu": 0.841,
      "pos": 0.033,
      "compound": -0.7269
    }
  },
  {
    "text": "Been there I’ve been dead inside since abuse when I was a child and I keep getting used and hit",
    "tone_score": {
      "neg": 0.362,
      "neu": 0.638,
      "pos": 0.0,
      "compound": -0.8591
    }
  },
  {
    "text": "i think i know this feeling.  you know there are people who supposedly care.  and i mean, they probably do.  but at the same time, you still feel alone, because... you know?  ugh.  ok i don't know if this made sense.  like there are people who care but they don't or won't get it?  or something.  -\\_-  sometimes trying to talk to people makes things worse because ugh.  and then it all just gets very frustrating. for everyone. :(",
    "tone_score": {
      "neg": 0.225,
      "neu": 0.638,
      "pos": 0.137,
      "compound": -0.8954
    }
  },
  {
    "text": "I'm \"smart\" or at least that's what everyone says. They all expect great things from me and push me to do things that I can't do and then when I fail they act like they are so disappointing in me, and that I should be doing more. This is from my entire family on both sides, and it just feels like the weight of the entire world in on my shoulders. I'm a whole marathon ahead of my peers but my parents still don't think its enough, and they fail to realize that all of this has an impact on my mental health. They expect more than I can do and then when I can't they always mouth off on how that's my only responsibility (which it isn't). And my dad loves getting between me and my gf. I'm actually going to break up with her soon. Above I said that I was only alive for my grandma and cat, but she's the third reason. The breakup is only gonna make things worse for me but I know she'll end up being happier from it, rather than this sinking ship of a relationship that my dad caused. On top of that he is mentally and verbally abusive and very aggressive and explosive. It's just a living hell I wouldn't wish on anyone, and most of the time I just get by on a fake smile and bottling my emotions while I lay in bed wishing that I could just kill myself without leaving my entire family feeling empty and hurt. I bare this pain so that others don't and that's just my personality, I'm a selfless person. And that's mainly because I don't care about myself.\n\nOkie that was quite the ramble hehe. Sorry for any spelling or grammatical mistakes. What's been weighing on your mind?",
    "tone_score": {
      "neg": 0.174,
      "neu": 0.744,
      "pos": 0.082,
      "compound": -0.9895
    }
  },
  {
    "text": "I was working the step of NA, had a sponsor, and went to meetings weekly. But. I fell off and stopped doing all of that",
    "tone_score": {
      "neg": 0.101,
      "neu": 0.899,
      "pos": 0.0,
      "compound": -0.3291
    }
  },
  {
    "text": "I just want to give up. But it's scary, and I keep functioning. But it's a heavy burden. I'm just waiting and longing to fall.",
    "tone_score": {
      "neg": 0.327,
      "neu": 0.633,
      "pos": 0.04,
      "compound": -0.8462
    }
  },
  {
    "text": "That’s me, but I even hide it from my family members, husband and 2 grown sons.  I am used to it now , still feels lonely though. Often thought to leave him so he can be with someone “normal”.",
    "tone_score": {
      "neg": 0.171,
      "neu": 0.829,
      "pos": 0.0,
      "compound": -0.6808
    }
  },
  {
    "text": "I really relate to this. I put myself into two part time jobs and university and I've been struggling to have energy for anything other than existing because that in itself is so tiring... may have just lost a long time friend because of it. I have time for my boyfriend but that's because he drags me out and usually he can sleep or focus on something else while I do my work. I honestly feel at one of my lowest point even if I don't seem like it and am still going through my days. Most days I don't even notice it until my relationships suffer, which is the scariest part.",
    "tone_score": {
      "neg": 0.138,
      "neu": 0.798,
      "pos": 0.064,
      "compound": -0.8301
    }
  },
  {
    "text": "Here also. Go go go..collapse into uselessness.  I do better when I create structure. I know I do better. It works for a long time, cognitive behavioral therapy.  I put my angry moments into my \"book of petty grievances\" and gratitude and general journal in another book. And schedule time for me in a third book.  And I'm ok. Good even..for a long while. \n\nThen I feel so sick of rules everywhere.  Why do I have to follow all these rules? Fuck the rules and fuck the rulekeepers. [Which are also me]. And I rebel, go wild. Or I get too busy and work too long and I'm tired. And then I fall apart and struggle to close the cupboards because it's so exhausting after getting a cup out. And put things down instead of away, classic way to make my space a disaster quickly. Then its hard to get up, and too messy to think.\n\nThen I start it a over again. We can't function in this mess, let's clean up! Etc.",
    "tone_score": {
      "neg": 0.218,
      "neu": 0.685,
      "pos": 0.097,
      "compound": -0.9707
    }
  },
  {
    "text": "I relate to your pain.i have even suicidal thoughts.",
    "tone_score": {
      "neg": 0.391,
      "neu": 0.609,
      "pos": 0.0,
      "compound": -0.6705
    }
  },
  {
    "text": "Do you ever feel drained from social events?",
    "tone_score": {
      "neg": 0.263,
      "neu": 0.737,
      "pos": 0.0,
      "compound": -0.3612
    }
  },
  {
    "text": "Yup. I can relate so much ...\nHaving to rely only on yourself to have the slightest positive thing.\nFighting in life for living to the least just normally but having to fight just harder and harder cause life keeps spitting on you on every fucking occasion of every fucking day.\nLeading you to never appreciate good times as normal people can cause you're too self-aware that shit will happen soon.\nAnd in my case, just keeping my depression under control with the how depressing fact that I don't want to have fought so long just for ending like this. \nDamn I hate to say thats what my life has been for years now.",
    "tone_score": {
      "neg": 0.269,
      "neu": 0.692,
      "pos": 0.039,
      "compound": -0.9867
    }
  },
  {
    "text": "Yup same here. And just because I seemingly have my shit together doesn’t mean I’m not dying on the inside",
    "tone_score": {
      "neg": 0.167,
      "neu": 0.833,
      "pos": 0.0,
      "compound": -0.5574
    }
  },
  {
    "text": "TV doesn’t Adblock and I can’t be bothered to figure out how to Adblock from my router",
    "tone_score": {
      "neg": 0.133,
      "neu": 0.867,
      "pos": 0.0,
      "compound": -0.3182
    }
  },
  {
    "text": "Kinda same here. I'm overall confused about whatever the hell is wrong with me. I feel guilty about everything that goes wrong. I dwell on how I could've done everything better. I'm content with what I have but at the same time as I hate everything. Basically I'm surviving more than living. It's all very confusing.",
    "tone_score": {
      "neg": 0.28,
      "neu": 0.628,
      "pos": 0.092,
      "compound": -0.906
    }
  },
  {
    "text": "It's very readable you are screaming out and feel no one is listening. You see adulthood is hard but being a kid today has alot more difficulties of that 20 years ago. Don't see yourself as weak see the others as ignorant. Have you tried CBT therapy you get some free courses online. You are strong trust me anyone who deals with depression daily would know. Do you do breathing exercises have you download de stress apps, how much exercise do you as dopamine is release naturally from exercise and is as good as seritonin",
    "tone_score": {
      "neg": 0.189,
      "neu": 0.671,
      "pos": 0.141,
      "compound": -0.4385
    }
  },
  {
    "text": "Worst thing to say to anyone with anxiety and depression such a silly man, no offence",
    "tone_score": {
      "neg": 0.579,
      "neu": 0.375,
      "pos": 0.046,
      "compound": -0.9153
    }
  },
  {
    "text": "I have completely avoided opening up to people. On here is the only place I actually talk to people. I make jokes about whatever is going on but that's just a big mask. I'm afraid that if I do open up to my family, they'll think I'm weak. Same thing with my \"friends.\"",
    "tone_score": {
      "neg": 0.109,
      "neu": 0.862,
      "pos": 0.029,
      "compound": -0.6365
    }
  },
  {
    "text": "For me what makes dealing with depression and anxiety sometimes almost unbearable is loneliness.",
    "tone_score": {
      "neg": 0.419,
      "neu": 0.581,
      "pos": 0.0,
      "compound": -0.7867
    }
  },
  {
    "text": "Then you must make a plan. Even if it's far off, planning your escape makes it real, gives you something outside if her to focus on. I get it more than you may think, that pain. It was took a hell of a lot of motivation to be able to move out, not quit school, support myself, and soon two sibs. Pain became my motivator. She meant it for evil. I used it to get me safe. Somewhere, anywhere but there. And it eventually came together.",
    "tone_score": {
      "neg": 0.128,
      "neu": 0.816,
      "pos": 0.056,
      "compound": -0.7528
    }
  },
  {
    "text": "From my experience I can tell you that the medications never worked and therapy was brief and fleeting. It always comes back and there’s no escaping it. Perhaps the medications may work differently for you and actually help, but if they do just know that you will always need to take them, because it’s just chemically masking your brain with the dopamine and serotonin. Without the mask, the depression comes back.",
    "tone_score": {
      "neg": 0.088,
      "neu": 0.873,
      "pos": 0.039,
      "compound": -0.6908
    }
  },
  {
    "text": "im really sorry medication and therapy havent worked for you :( tbh i wouldnt even mind always taking them if they help even a little, at this point i dont really care and what do i really have to lose? ive dealt with this for at least 7 years with ups and downs and i dont want to burden the people around me for the rest of my life because i cant keep myself afloat",
    "tone_score": {
      "neg": 0.148,
      "neu": 0.786,
      "pos": 0.066,
      "compound": -0.6616
    }
  },
  {
    "text": "I think that’s the biggest problem with depression and even if we decide to start considering exit options - we’re always guilted with burdening and causing grief to others. Nobody else lives through the pain and misery of the suffering person’s life, why do other’s get to decide what’s best for them? In your case, I’m not going to patronize you and tell you what you should do to alleviate your pain, but just remember that it’s your struggle and it’s very real. Put yourself first and don’t worry about the burdens others may feel - that’s their baggage. I hope you are able to get some relief soon.",
    "tone_score": {
      "neg": 0.208,
      "neu": 0.709,
      "pos": 0.083,
      "compound": -0.9032
    }
  }
]