[
  {
    "text": "Aaaaand now I haven’t showered in several days, sleep at least 12 hours, and my severe recurrent depression is back. \n\nHate this. \n\nSucks.",
    "tone_score": {
      "neg": 0.417,
      "neu": 0.583,
      "pos": 0.0,
      "compound": -0.9165
    }
  },
  {
    "text": "I'm not one for feeling sorry for myself. But I'm spending Christmas on my own and I just need another human soul to hear me, and maybe acknowledge my pain. I don't know. I'm trying so hard to get better: therapy, meds, exercise, mindfulness, focussing on work, volunteering. Sometimes I think I'm cursed to kill myself. But hey, I never thought I'd make it to 30 and here I am... I'm so tired.\n\nIf you've read this, from the bottom of my heart, thank you.",
    "tone_score": {
      "neg": 0.208,
      "neu": 0.721,
      "pos": 0.071,
      "compound": -0.928
    }
  },
  {
    "text": "I have been strugling with depression for nearly a decade.\n\nI tried everything but it seems to persist.  every time some improvment is showing, its gets drowned in my pain and misery.\n\nIm not going to give up, but I'm starting to lose real hope of getting out of this hell.",
    "tone_score": {
      "neg": 0.389,
      "neu": 0.559,
      "pos": 0.052,
      "compound": -0.9811
    }
  },
  {
    "text": "Sometimes I’m okay. Other times I feel intense emotional pain and wish I didn’t exist. I’m not sure exactly what to call it. I don’t want to kill myself but also I wish I wasn’t alive. I’m just kind of dealing with these intense emotions and wishing I was dead. \n\nI’m not sure what to do or how to not feel these feelings anymore. It just hurts to be existing. I hate having memories and I want to erase them to be happy but we can’t do that. \n\nNot sure what my point is for creating this post. Maybe just an attempt to see if anyone can relate or understand what I’m trying to say.",
    "tone_score": {
      "neg": 0.189,
      "neu": 0.619,
      "pos": 0.192,
      "compound": -0.6775
    }
  },
  {
    "text": "I can't even look at old pictures of myself without getting upset I'm just constantly wondering what went wrong and if things could've been different.  I know my depression is most likely going to be something i struggle with my whole life since half of my family has struggled with depression at a young age too.  I don't understand why it has to be like this I feel like it will never go away.  I wish i was normal.",
    "tone_score": {
      "neg": 0.201,
      "neu": 0.716,
      "pos": 0.083,
      "compound": -0.8827
    }
  },
  {
    "text": "I'm so tired... Trying to function, to manage the never ending way of thinking.... I love my job. I love my colleagues. I love my husband... But I feel dead inside. They all deserve better.\n\nI put on that face. That mask. That smile. They think I'm doing well... They don't see the rot growing underneath. Two thirds of my life have been spent like this, living with a facade... Meds helped. I reach out to my GP when the worst thoughts start to intrude again... But why do I bother? By then it's too late anyway and I'm just tired of fighting.\n\nI feel like I'm fighting a war with myself... I'm tired... I want to sleep. I don't want to ever wake up. But I don't want to kill myself either.",
    "tone_score": {
      "neg": 0.185,
      "neu": 0.608,
      "pos": 0.207,
      "compound": -0.5176
    }
  },
  {
    "text": "wake up go pee get water back to bed\nignore life",
    "tone_score": {
      "neg": 0.2,
      "neu": 0.8,
      "pos": 0.0,
      "compound": -0.3612
    }
  },
  {
    "text": " Only wanting to die but you're still alive,  wanting to disappear yet you still exists.\n\nYou'll find it hard to care and yet you'll still speak with me.\n\nYour life can be such a contradiction but your still here.\n\nDespite everything and everyone we all keep marching on, even when it's the worst thing in the world.\n\nEven if you run and hide it's always possible you'll come back.\n\nAll the difficulties with depression and its contradiction towards life hides a very deep senses of beauty...\n\nbecause your still here.\n\nYou will never be less of a person simply because of your depression. Don't let anyone tell you otherwise. \n\nYou can always be amazing... just hold on tight don't ever let go completely.\n\nThere can still be beauty in depression when we are here for eachother and well done being here for me.\n\nDoesn't always have to be this way but we make our way regardless.\n\nI hope you can see where I'm coming from with this and that maybe it might lift your spirits even for a moment.\n\nThank you all for being here &amp; when we need you  ❤️",
    "tone_score": {
      "neg": 0.17,
      "neu": 0.731,
      "pos": 0.099,
      "compound": -0.9377
    }
  },
  {
    "text": "Today all Ive eaten a frozen ready to eat meal. I heated that sloppy mess in the microwave. I just ordered some ice-cream to eat while watching movies and crying along with a pizza.\n\nThis is what I do when I'm at my worst but I just can't afford it. I can't afford to not eat either as that'll make me suffer and make my depression worse.\n\nWhere can I find that glimpse of energy to cook three simple meals a day?",
    "tone_score": {
      "neg": 0.226,
      "neu": 0.725,
      "pos": 0.049,
      "compound": -0.9509
    }
  },
  {
    "text": " Every day is gray and sorrowful, not because of the autumn, but because of the emptiness I feel inside. I don't enjoy anything, I don't care what I eat and what I do. Everything I do is a desperate attempt to make time pass faster gaming, reading, walking, scrolling through Reddit and laughing at memes and going back to being sad one second later.  \n It all lost meaning, it was losing it for a year, but her leaving me pushed it over the edge and now I'm just hopeless.   \nIt feels like I'm not living I'm trying to survive, but I don't know how much longer I can keep my head above the water.",
    "tone_score": {
      "neg": 0.231,
      "neu": 0.711,
      "pos": 0.058,
      "compound": -0.971
    }
  },
  {
    "text": "If a depressed person develops severe agitation, can't stay still, severe anxiety, severe suicidal thoughts, racing thoughts, fleeting thoughts, can't sleep more than four hours. And this last for at least a week how do you know it's bipolar mixed episode vs. depression with mixed features? \n\nDo people in this thread believe major depression is on bipolar spectrum?",
    "tone_score": {
      "neg": 0.365,
      "neu": 0.635,
      "pos": 0.0,
      "compound": -0.9778
    }
  },
  {
    "text": "My grandfather(who i was very close with my entire 31 years) passed away a week before thanksgiving, we were all just talking about how excited we were and it might be grandfathers last at 90 years old. He was in great shape prior to covid, he was driving daily still at 88 and cooking pancakes for my cousin(he lived with my aunt). Sadly he caught covid and survived until a few months later he lost all ability to walk and needed a walker and wheelchair, he then developed dementia months after and took a awful turn the end of this year, not remembering me or anyone else, eating napkins and falling almost every day and my cousins or aunt would have to pick him up. I spent days out there with him taking off from work to help out but I feel I didnt do enough. I am 31 and know i should be thankful i had him for this long, but it hurts like hell. I was very close with him, the oldest grandson by 5 years and we had a special connection, he understood who i was. He met my fiance and was very happy for us. But I have been very depressed this last week. I was looking forward to spending this one last thanksgiving with him. He was a good man, only 5'4 to my 6'1 but i looked up to him and respected him more than anybody and id do anything to make him live a little longer, he was a korean war vet and did anything for his grandkids...I was closer with him than my own father. Its a difficult loss for me , even if he was almost 90. I am really going to miss him and talking to him, learning from him.",
    "tone_score": {
      "neg": 0.111,
      "neu": 0.781,
      "pos": 0.108,
      "compound": -0.2253
    }
  },
  {
    "text": "ive recently been having suicidal thoughts. its been rough this past few weeks. i’ve been having a hard time in college and i just failed one of my courses this semester.\n\ni just feel like im racing against time. my older sister dropped out of college and doesnt have a job right now. i dont want to disappoint my family by doing the same thing. my dad always ask me when will i graduate, he always tells me he doesnt know how long he can still work to pay for my college because of his age. he’s turning 58 this february. \n\ni just feel burdened with becoming the family’s future breadwinner. i feel worthless for flunking several of my classes and i dont know how to get back up. its also not helping how my highschool friends are doing great and graduating next year. this is why i started drifting off and stopped contacting them. because i feel ashamed of myself. i just couldnt face them.\n\ni feel lonely, worthless, stuck in time. i just want to end my life because i think im not fit to survive in this society. but im scared to die also. im a fucking coward afraid of dying and living.",
    "tone_score": {
      "neg": 0.188,
      "neu": 0.775,
      "pos": 0.037,
      "compound": -0.9762
    }
  },
  {
    "text": "I'm only 22 and I feel like my depressive episodes have gotten progressively worse since it began. I think so slowly, I feel paralyzed, I feel trapped, I feel stupid. Each episode seems to be worse. Luckily these extreme episodes don't last too long but fuck they're bad when they hit. If it's this debilitating at 22 how am I supposed to function later in life? I always viewed my mental illness as something to be managed and I'd be fine, but what if my brain is really just dying? I can't take much more of this",
    "tone_score": {
      "neg": 0.22,
      "neu": 0.723,
      "pos": 0.057,
      "compound": -0.9559
    }
  },
  {
    "text": "I’m in my early 20s, working remotely full time. \n\nI live alone without any friends. Nothing really excites me. New friendships don’t really come easy to me. My only hobbies are sort of solitary endeavors. I suspect I may have some undiagnosed issues, but right now can’t afford a therapist. I have no SO, no dependents - no one except my coworkers would be affected if I suddenly disappeared. \n\nMy parents were kinda abusive religious fundamentalists. You can read my post history and see why I am not close with my family. I come from a long line of broken people, and I feel constantly embarrassed of where I’m from. \n\nMy job doesn’t interest me, even though it pays the bills I need to keep living (I’m a software dev). But what’s the point if this is all life is? I’ll just keep doing a job I hate to pay bills for a life I don’t care about till I end up in a hospital and die.\n\nI’m not a threat to myself. I’m gonna just keep working and going down this road. But I often wish something else would end it for me sooner.",
    "tone_score": {
      "neg": 0.204,
      "neu": 0.706,
      "pos": 0.09,
      "compound": -0.9711
    }
  },
  {
    "text": "I've hit rock bottom.  Medical issues, lots of other real life issues.  Too many rules ALL around me.  I can't get the help I need.  I feel soooo defeated!  Family support?  Comes to soo many rules and weird things.  They say they want to help, but want to split me up from my daughter?  What kind of help is that?  Too many rules.  Must be this, must have this, can't do this til...etc etc.  I just want to cry all the time.",
    "tone_score": {
      "neg": 0.164,
      "neu": 0.769,
      "pos": 0.067,
      "compound": -0.8634
    }
  },
  {
    "text": "I'm suffering so much in this disgusting loneliness. Ive been pushed away from everyone cause I'm bipolar. I don't know what to do with myself anymore. I never deserved this much pain.",
    "tone_score": {
      "neg": 0.337,
      "neu": 0.663,
      "pos": 0.0,
      "compound": -0.9217
    }
  },
  {
    "text": "And fuck them all. It's their fault I'm in this shit anyway.",
    "tone_score": {
      "neg": 0.537,
      "neu": 0.463,
      "pos": 0.0,
      "compound": -0.8873
    }
  },
  {
    "text": "Nothing is really ‘wrong’ with my life. But I have no energy to do anything, and I hate myself for it. I’m hating college cause I just go to classes and trudge my way along to do the bare minimum cause I have no desire for more. I wake up and I just want to keep sleeping all day. I have no energy to go beyond what I need to do. I just want to lay in bed all day. It’s very strange to me how I don’t hate life but I hate the act of living, cause I don’t want to do *anything*. Maybe that doesn’t make sense, not sure how else to describe it. I don’t know, but it does make me frustrated with myself. Feeling like a walking corpse sometimes, forcing myself to move. I think I was really meant to be a house cat instead or something. Honestly I’m not sure if this is depression or just a state of chronic laziness? What is this? I don’t know where else to talk about this. I’m always feeling tired",
    "tone_score": {
      "neg": 0.25,
      "neu": 0.639,
      "pos": 0.11,
      "compound": -0.9895
    }
  },
  {
    "text": "I used to just have a feeling of not wanting to exist but over a couple of weeks that feeling has shifted to a want to kill myself, I often visualize doing it, really the only thing that's stopping me is my fear of death. I don't really have a reason to feel this way, my life's ok. but lately I've been bored with everything and have had a lack of motivation for everything, and nothing has been really bring me joy lately. I haven't had the energy to go to school or even get up in the morning. so yeah I just kinda need to get that off my chest, thanks for reading.",
    "tone_score": {
      "neg": 0.187,
      "neu": 0.643,
      "pos": 0.17,
      "compound": -0.6515
    }
  },
  {
    "text": "It's 3:27 am\nI feel trouble, fuckin depressed and empty\nNothing makes sense to me, I'm not interested in anything anymore\nThere is no one in my life,no friends no girls no pet\nNo sexual activity,i changed my hair color to feel better about myself again nothing\n(Not awesome at English explain easily)",
    "tone_score": {
      "neg": 0.32,
      "neu": 0.593,
      "pos": 0.087,
      "compound": -0.9209
    }
  },
  {
    "text": "never posted anything before but does anyone else feel like they have no hope for a future I don’t wanna die but i just feel like i suck at everything and my friends could replace me so easily i feel like i have no future my anxiety is pretty bad and it makes me feel even more hopeless im aware of faults yet I can’t change myself its like im stuck in place and everyone else moves forward so easily its like i was born to lose i hate pitying myself but here i am does anyone else feel like this?",
    "tone_score": {
      "neg": 0.291,
      "neu": 0.446,
      "pos": 0.263,
      "compound": -0.6417
    }
  },
  {
    "text": "Warning. This might trigger anger and I dunno hate? \n\n\nI'm sorry if I would make people angry.\nAs you know by the title, I have a friend who tried to kill himself.\nHe told me about it and I just listened.\n\nI can't remember what I told him.\nI was a bit shocked perhaps.\n\nThat's it.\nI probably didn't say anything helpful.\n\nThat was two months ago. Sorry this post is kinda late.\n\nBack to the present, I try to ask him how has he been doing. but that's it.\n\nNow I don't talk to him that much because I have suicidal thoughts going on and I might just trigger his. I am also a girl and he's a boy so I have this boundary. I don't want him to like get too attached, romantically or even just a friend. I feel so mean. I'm so sorry.\n\nThis is probably because most of my close male friends confessed to me and I feel uncomfortable about it. \n\n\nI avoid spending too much time with him because I don't want him to get used to me being there. I am a very negative person. I also prefer being by myself. I'm an introvert and I am bad at handling other people's problems. \n\nI feel guilty for like leaving him when he's going through tough shit.\n\nSo any advice how can I be a good friend ?",
    "tone_score": {
      "neg": 0.223,
      "neu": 0.665,
      "pos": 0.111,
      "compound": -0.9725
    }
  },
  {
    "text": "This monster I've been dealing with since about age 12 is starting to get really really old at this point. I'm 28 now, and it hasn't been from lack of trying that I'm still wrestling with my own mind trying to kill me. I exercise, meditate, eat regularly and healthily, sleep a normal number of hours, and have even been to therapy. There was also a point in my life where I was able to deal with a stressful reality crushing my spirit through psychedelic use, but the utility they've had for me has run out, and they were starting to exacerbate my mental issues, so I haven't used them for years.\n\nRegardless of all this, I feel like I'm just stuck with depression forever, to the point where I'll be honest, being depressed feels like my normal state, and the fleeting moments of happiness an increasingly rarer gift. Buddhism and Daoism are basically the only spiritual guidance/philosophies that have really helped me hang on, since they accept the premise that life is suffering, and that there is some sort of transcendent \"duty\" we perform in our lifetimes, but it's hard for me to not be resentful of my existence.\n\nWhoever says it gets better is a fucking liar, but whoever says it makes a little bit more sense day by day gets it. By \"makes sense\" I mean that you're aware of the depression, but you still have to deal with the emotional burdens even if it \"makes sense\". Well, I'm tired of dealing with it, and I don't want MAOIs, SSRIs or whatever to cope. The world is awful and stripped of wonder, and I'm tired of pretending its not. And any time people do ask for even a pitiful improvement in their lives, they get beaten down and left to rot.",
    "tone_score": {
      "neg": 0.162,
      "neu": 0.716,
      "pos": 0.122,
      "compound": -0.9539
    }
  },
  {
    "text": "\nEveryday I just feel that I should for once make my father proud and kill myself. I wish I had not escaped to my neighbours when he tried to kill me. I regret surviving that day so fucking badly. I feel awful without him abusing me. I can't punish myself enough for who I am, unlike him. I guess it sounds ridiculous that I miss this but I can't help it \n\nAt the same time I hate myself for being like he was.\nI even have similar illnesses and disorders like he had. People always told me that im similar to my father and every time I heard it I just wanted to cry. \n\nI'm just so tired and so done. I don't think I've even ever been happy. Since I was born I was abused, my mom said that even as a toddler I was already abused by my father. I wish I didn't live at all because I don't expirience anything good in life, and if I do I just fuck it up. \n\n I hate myself horribly and I'm very guilty for even writing this here. I know this is random and I'm sorry but I just can't keep silent about it anymore",
    "tone_score": {
      "neg": 0.285,
      "neu": 0.615,
      "pos": 0.101,
      "compound": -0.9933
    }
  },
  {
    "text": "Had a major argument with the wife. Im ready to call it quits today. Social Security denied me. Nurse that cant hold a job down. The only thing stopping me are my kids 20,15, n mostly my 8 year old daughter. Wife is a hard working nurse who says everything and everyday is about me and i dont look into her problems. Running out of rent. I dont know what to do…",
    "tone_score": {
      "neg": 0.15,
      "neu": 0.784,
      "pos": 0.066,
      "compound": -0.6369
    }
  },
  {
    "text": "If the self harming is a legit way that it helps me calm down then is it ok? I mean I think it is better to have cuts on my arm then to end up killing myself because I didn’t relive it.\nDoes that make sense?\n\nI cut sometimes and it is like water to a fire. If it’s not actually going to do all that much then is it better to do that then risk me breaking down and killing myself?",
    "tone_score": {
      "neg": 0.217,
      "neu": 0.629,
      "pos": 0.154,
      "compound": -0.8095
    }
  },
  {
    "text": "I've been struggling with depression for about 30 years, long enough to know that there ARE better days after a depressed period. I'm in the middle of a dark time and my gosh, I am just worn out.  I have several spoiled pets who I'm not leaving, so suicide won't happen, but my gosh, how nice would it be for this struggle to end once and for all.",
    "tone_score": {
      "neg": 0.194,
      "neu": 0.732,
      "pos": 0.074,
      "compound": -0.7997
    }
  },
  {
    "text": "Every weekend I just don’t know what to do. I desperately want to find something to do that can fill my time. Every day in school I think that I’ll get up on Saturday and be productive, or do something memorable. But when the day comes, I wake up and just feel lost and mentally foggy. So I just kill time and wait for Sunday, where I do the same thing. I don’t know if this sounds like a huge problem but I don’t get why suddenly on the weekends I just lose interest in anything. I’m just wondering if anyone knows what to do when you feel like this. I’ve had depression and problems sleeping for awhile now, and I feel they make me unable to do anything.",
    "tone_score": {
      "neg": 0.185,
      "neu": 0.716,
      "pos": 0.099,
      "compound": -0.9415
    }
  },
  {
    "text": "Does anyone else take these meds with a diagnosis of depression? It’s actually depression with “mixed episodes.” I take Cymbalta, Lamictal, Abilify, and now Welbutrin. I’m just wondering if anyone else has a similar diagnosis because I feel like the doc should go ahead and call me bipolar but maybe I’m wrong. And yes I know I need to talk to him about it but I’m obsessing on this right now.",
    "tone_score": {
      "neg": 0.157,
      "neu": 0.774,
      "pos": 0.07,
      "compound": -0.7684
    }
  },
  {
    "text": "I wish I could've had a last conversation with my late I'm an idiot for not calling him I hope he can forgive me for being a bad son.",
    "tone_score": {
      "neg": 0.279,
      "neu": 0.576,
      "pos": 0.145,
      "compound": -0.6604
    }
  },
  {
    "text": "i'm on prozac. ran out of pills a few weeks ago and completly forgot about it, and i've felt down down since. started taking it again for 4 days now (yay!) but i still feel so low and i feel like i need to go to the hospital because i'm really not okay. the problem is i have exams in less than 2 weeks now and i don't want to miss them. also, maybe if i take my meds correctly for a week or two i will be able to feel better... i don't know what to do. i'm really on the edge of killing myself right now. just want some rest.",
    "tone_score": {
      "neg": 0.131,
      "neu": 0.801,
      "pos": 0.068,
      "compound": -0.8065
    }
  },
  {
    "text": "No one gets it around me. I’m either crazy or selfish. I legit just want to die.",
    "tone_score": {
      "neg": 0.485,
      "neu": 0.46,
      "pos": 0.054,
      "compound": -0.8834
    }
  },
  {
    "text": "I want to feel pain. Drawing lines on my arm isn't enough anymore. I just want to bleed out. I feel like my head is clouded with shit and I just want to bash my fucking skull open and rip out the fucking fog. does anyone know how satiate this feeling without anyone noticing?",
    "tone_score": {
      "neg": 0.139,
      "neu": 0.723,
      "pos": 0.138,
      "compound": -0.4723
    }
  },
  {
    "text": "I was choking myself on my bed with some fabric i twisted up. Not sure if that’s a relapse of self harm. Not sure if i care. It felt like the perfect loophole. Just need to feel something. Please don’t come in here and tell me it’s a relapse because if it is I’ll go on a cutting spree. I’ll let my therapist decide and same goes for her, if i fucked up im letting the whole dam break open. I’m so tired of being alone. I need to figure out a way to end this life. I don’t have anyone to talk to who understands me or says more than “sorry” or “that sucks” or “:(“. I need the pain to end or to be fully drawn out of me by my own hand",
    "tone_score": {
      "neg": 0.187,
      "neu": 0.735,
      "pos": 0.078,
      "compound": -0.9359
    }
  },
  {
    "text": "Recently I quit my 30+ hour a week bartending/serving job because it was uncovering and heightening symptoms of anxiety and depression that I had struggled with in the past. It was just an overall toxic workplace (I lasted there two years). I’ve always been a full time college student, even at todays current date. My dad passed in 2016 and my mother isn’t really in the picture. I’ve had periods to where I would be my greatest self but I’ve hit an all time low these past two weeks. I feel like the majority of the time my boyfriend is my caretaker and I offer very little to the relationship, especially right now. He doesn’t make me feel any less because of my mental illnesses, but however just wishes I would be more of an independent woman. Due to my dad passing it’s been hard for me to step up and truly be an adult because I was at an age where I still needed him. My car, room, and myself in general are just a mess. I’m not sure if I’m just taking some days for myself since leaving this job (never had an off day from both school and work) or if I’m just in a rut.",
    "tone_score": {
      "neg": 0.091,
      "neu": 0.856,
      "pos": 0.054,
      "compound": -0.7221
    }
  },
  {
    "text": "I don’t know what I’ll do in the next few years, I’ve been out of school for most of my life ( I’m 17 and homeschooled, I haven’t really socialized in maybe 4 or 5 years ) so my social skills are trash and I have no friends and for almost most of my life, even before the pandemic, I’ve been completely isolated from other people. Sure there have been a handful halls or parties or my mother dragged me to where all I did was was sit in a chair for 3 hours begging no one to talk to me because I didn’t know how to talk to people ( my mother being a big root in a lot of my problems, taking me out of school at sixth grade because it’s our culture to not have children Americanized by taking them to school and learning more than they need to ) and family gatherings but other than that, that’s it, and I hate it. I hate that the last time I was invited to a birthday party by someone who wasn’t apart of my family was six years ago and that I’ve never been around a group of people without my mother being near me, I’ve been denied so much by my mother that I have no one and have to vent to strangers on the internet, it’s depressing, I’m a loser by every definition of the word and that’s the only personality trait I have because I have no idea who I am, I’ve never had any chances to learn who I am or what I wanna be or if I even have a personality. Every day I question different parts of myself, my lack luster intelligence, my looks, my degrading mental state, my personality and it’s painful, so so painful and I have to keep this all inside in fear of being shunned by family, even though they’re such an enormous reason I feel this way because I have no one else to talk to. There’s so much more to this, so much more that I don’t wanna type out. I just wanna fast forward to time where I have faces I’m actual okay with seeing on a daily basis or where I can go outside alone without having a panic attack or can talk to someone.",
    "tone_score": {
      "neg": 0.154,
      "neu": 0.791,
      "pos": 0.055,
      "compound": -0.9908
    }
  },
  {
    "text": "I've been given endless support and resources but it seems like nothing sticks. I do really well for a while and then, inevitably, I slip into my old ways. I become gloomy and unlikable. I neglect chores, shut out loved ones, and fail classes. No amount of therapy and medication has been able to break the pattern. I know if I really *tried* I could break this pattern, but I'm lazy and selfish and my brain is stupid and broken so I can never bring myself to try. Sometimes I think that maybe this is all I will ever be, and I will never be able to do better than I already have. Maybe I was just born with a defective brain, and there's nothing I can do about it. My mom has so much faith in me, supports me so much, and it's all going to waste. I wish she would just realize that I'm a lost cause and give up on me already. I hope she realizes how much of a burden and leech I am and kicks me out. I don't deserve any of her kindness.",
    "tone_score": {
      "neg": 0.195,
      "neu": 0.644,
      "pos": 0.161,
      "compound": -0.8313
    }
  },
  {
    "text": "I never thought I would write this here but I can't take it anymore . I was seeing this guy since 8 months , and with time I got attached to him and he didn't . For all those months he was my priority , I always thought it's my duty to put a smile on his face and I always used to . For his birthday I spent 2 months preparing a whole sketchbook with sketches of his favourite anime character and actors . After doing all this I really thought he'll definitely do something nice for mine but I was wrong , I didn't get anything not even a playlist and right after his birthday he started acting weird . He started ignoring me and one day when I asked him he just yelled at said he doesn't think of me that way . And a lot of fights happened after that which always ended up with me crying myself to sleep but still didn't leave him . And one day randomly he told I just wanna meet you one last time and that would be it . I was crushed . We never met after that , I decided not to . But again we met online few days and he told me he wants to meet and I agreed thinking he has changed . We were supposed to meet today and I was very excited and I got ready and I left my place . I texted him to ask when he'll leave and for 30 min there was no response . I reached the place we were supposed meet , still nothing . And then he tells me I m not coming \" I m not well \" . I just burst into tears right there . I was crying in public and I told him that as well . He just said ' don't expect anything , I won't come there to wipe your tears or anything if u tell me all this . And this is THE 14TH TIME I am gonna cry myself to sleep just regretting going there and trusting him again . And the worst part is he is happy in life and regrets nothing , he can see me cry in front of him and say nothing !",
    "tone_score": {
      "neg": 0.14,
      "neu": 0.764,
      "pos": 0.096,
      "compound": -0.9685
    }
  },
  {
    "text": "The withdrawal symptoms are insane but I feel a spark in me that I have not felt in a while. More of a zest for life? My eyes are higher than my lows are lower but I don't feel like a zombie",
    "tone_score": {
      "neg": 0.227,
      "neu": 0.692,
      "pos": 0.081,
      "compound": -0.7282
    }
  },
  {
    "text": "Why bother anymore? There is no endgame in any of this suffering for me. I think things have gotten better then suddenly my demons come back and fuck me up - reminding me of everything I don't  have and have unfulfilling my life is. Reminding me how everyone I grew up with, everyone I spent my childhood years with is living the life that I desire, yet I'm stuck in this endless cycle of depression and fucked up thoughts about everything. I can't afford therapy or anything because my family is already spending so much on me to help with my hair loss (at 18... what a great fucking thing right?) and we are not financially able to spend anymore on me. I'm fucking sick of everyone around me and I don't know what the fuck to do with anything. FUCK\n\nFuck all this shit. Everything I thought I loved and connected to has gone down the fucking drain when I realised it was all an illusion to make myself feel better about who I wanted to be, rather than the person I am. Every single night this year has been so bad and it never ends. And if it does... then what? It's gonna come right back like it always fucking does. Why the fuck are so many humans put here to suffer and then die. People overseas are taken, enslaved, raped and killed... and for what? Fuck this shit. No one around me seems to have this view on life, and they look at me like I'm crazy. But what the fuck am I supposed to think when all I've known for the pst 2-3 years is suffering... endless fucking suffering, filled with nothing but pain and the illusion that things were gonna get any better. They never do, and God is bullshit. What kind of 'God' destroys families by letting children die. Forcing parents to bury their kid at 19. And don't tell me any religious bullshit. The fact that there are multiple religions on this planet just means that something isn't right. I mean, if there really was a God, why do so many people worship a different version of him. How do some people live believing in Jesus while others don't? Who can support either POV? Fuck this. Bullshit. I've been left in the fucking dark for so long like so many of you. So whats the point of that?",
    "tone_score": {
      "neg": 0.212,
      "neu": 0.725,
      "pos": 0.064,
      "compound": -0.9967
    }
  },
  {
    "text": "Emails I've sent. Things I've posted. What if one day all my embarrassing and emotional posts are linked to my identity because I was sloppy and sent someone something I had also posted on reddit? There are archives you can search and find posts in. What if someone finds those or there is a data breach and everyone's accounts and exposed even if they were deleted? Now they know it was me who wrote emotional rants.\n\nIs this why I am alone? Because the universe doesn't want to burden someone else with my shit? That I've already made decisions in my life that led me here? I don't see why else. My life is \"good\" and here I am extremely depressed ruminating over shit that most people aren't thinking about.",
    "tone_score": {
      "neg": 0.151,
      "neu": 0.808,
      "pos": 0.04,
      "compound": -0.9389
    }
  },
  {
    "text": "wtf is happening with me",
    "tone_score": {
      "neg": 0.487,
      "neu": 0.513,
      "pos": 0.0,
      "compound": -0.5859
    }
  },
  {
    "text": "She refuses to allow me to take anti depressants and denies I even have depression. Nothing my therapist says will convince her, it’s so frustrating. \n\nShe has tried to take me to a psyche ward for me going threw a depressive episode and got mad when they wouldn’t admit me since nothing was wrong with me but now when a license professional diagnosis me with depression she chooses to ignore it ??!",
    "tone_score": {
      "neg": 0.273,
      "neu": 0.654,
      "pos": 0.073,
      "compound": -0.9501
    }
  },
  {
    "text": "I don't exactly know why, but for the last 3 months I haven't felt happy or really excited about anything, but I thought that's just because I got into a new school and it would change after a while. Well it didnt, it probably got worse. In the last 2 months I went from kinda not happy to actually wanting to die.\n\nBut the thing is I feel like im doing this to myself. Like I am not really like this and my brain is just making this up.\nI don't want to feel this way, but it's hard to actually tell someone because I feel like I would be wasting their time with something that could just be my brain being dumb. \n\nI have done some online quizzes and stuff, but they are just online quizzes so that alone isn't gonna make me fully think I have depression.\n\nI have been telling myself that it's not real and I should just not think about it, but lately it's the only thing I think about.\n\nSo far I have been trying to hide this from my friends and family because really they're the last people I want to see me differently, but I think some of them are starting to see what's going on. I feel like I don't want to burden others especially not friends and family. \n\nAlso it's beginning to interfere with school stuff and my sleep schedule. I basically almost feel tired and that mixed with how lazy I am just makes me just play videogames all day. And I'm just not hungry anymore either. I basically lost all appetite.\n\nI can't really put my finger on any sort of event or trauma that could have caused me to feel this way either so I don't know what I should or shouldn't do so it doesn't make my situation a lot worse.\n\nThat's all I wanted to say. Maybe I forgot something so feel free to ask.",
    "tone_score": {
      "neg": 0.16,
      "neu": 0.726,
      "pos": 0.114,
      "compound": -0.9448
    }
  },
  {
    "text": "My mom keeps calling me selfish. I hate selfishness and I know I am right now which makes me feel bad for feeling bad that i feel bad about feeling bad( why am i like this?) She doesn't have to remind me. Really. But she does.\n\nI just had a panic attack. I feel a constant burden and I'm struggling a lot. With eating too i just felt really overwhelmed before bed and my dad got angry and my mom got angry as they wanted to go to bed at the same time or something. So I picked up their aggressiveness and got more overwhelmed. \n\nMy mom insisted on me telling her what's wrong as I've been off the entire evening. But the thing is, idk what's wrong. Everything and nothing is wrong all at once. \n\nSo i told her that (meanwhile she was upset that she had to wait to get trough the bathroom to go to bed.) And she stared telling me how i have to get up earlier (which makes me very much more upset as i want the day to be as short as possible) and all these things i have to do tomorrow and in the future. I panicked more. Then she told me i shouldn't be such a victim. When i told her this isn't helping, she said the world doesn't revolve around me. And she thanked me for making her feel bad. That she won't be able to sleep.  I can't do this anymore.  I'm so close to ending it all",
    "tone_score": {
      "neg": 0.249,
      "neu": 0.699,
      "pos": 0.053,
      "compound": -0.9962
    }
  },
  {
    "text": "This year even tho we all had a terrible time with covid, i felt great. After many years of depression, therapy, distancing myself from my old job in the kitchen and learning something new that i enjoy, i thought im save. I thought im ok, and i felt great too.....as if i had beat something and found my way. Got a decent job in my new field and felt like i was of use. Turns out im not that special. Even tho i thought i got better at everything, be it my job or my hobby's.....turns out my efforts are in vain. I fail everything and everybody. Even tho nobody cares about me, everybody goes out of their way to tell me what i should be and what i do wrong. And for the last couple of years it worked to just focus on myself and do what i want, that felt healthy but for some reason it doesn't work anymore. I don't want to be alone forever but i cant be with people either. Everything feels wrong and nothing makes sense. And the worst part is that im not alone at feeling this way. Even if im ok, others will not be and how dare i feel better then those who have it worst anyway. Whenever someone discomforts me to the extend where they actually feel bad for me i just tell them: For someone to win, there has to be those who lose. Maybe that's the thing im good at, loosing.",
    "tone_score": {
      "neg": 0.158,
      "neu": 0.707,
      "pos": 0.135,
      "compound": -0.893
    }
  },
  {
    "text": "I’ve been a high-functioning, chronically depressed person for pretty much my entire life. \n\nI started Effexor in early August and am currently taking 187.5 mg per day. For a period of time starting end of September to mid October, I felt a lot better. \n\nRecently for the past 2 or so weeks, I’ve fallen back in a slump. I don’t know if I’m just feeling mentally and physically exhausted (as the last month has been particularly busy with social engagements) or my depression is making a come back. \n\nWhen I tell my husband I feel depressed, I feel guilty. When he asks me why I feel depressed, I can’t answer him. From the outside looking in, I don’t have much to be depressed about. I have a loving husband, support network of friends, a great career and a very stable financial situation, and lots of social activities. \n\nI go to the gym 4-5x a week and speak with both my psychologist and psychiatrist regularly. And yet, the last 3 days, I haven’t felt more miserable. I can barely get off of the couch for more than 10 minutes at a time. \n\nI don’t know if I’m looking for advice or just to vent. I’m just tired of feeling like this.",
    "tone_score": {
      "neg": 0.14,
      "neu": 0.735,
      "pos": 0.125,
      "compound": -0.6666
    }
  },
  {
    "text": "Everything just feels like a bandaid over a broken bone, I'm tired of adjusting my life style just to feel the same way I always do, I'm tired of learning coping mechanisms, I'm tired of dealing with other human beings. I'm just so fucking fatigued.",
    "tone_score": {
      "neg": 0.277,
      "neu": 0.676,
      "pos": 0.047,
      "compound": -0.9056
    }
  },
  {
    "text": "I'm not tired in the sense I want to sleep just life in general. I'm tired of seeing people happy and living their lives up after they've graduated from high-school at parties. Meanwhile I've failed my exams and I have no life plan. I just dont care about life anymore. I'm sick of waking up too the same disappointment everyday. I can't even move forward anymore Im just stuck in quicksand pit of life. My bullies are living it up as well not that, that matters. I just dont want to have to live like this anymore. A quick death would be a mercy at this point",
    "tone_score": {
      "neg": 0.173,
      "neu": 0.661,
      "pos": 0.166,
      "compound": -0.4195
    }
  },
  {
    "text": "Hey all. I’m wondering if anyone out there also experiences severe cognitive deficits during depressive episodes. I have spent the last 6 months in a bad depression, and today I’m having the first signs of it perhaps lifting. \n\nI notice that right now, my memory recall is much better than it was during this whole period. I am able to problem solve and think things through much better today. But for the past half a year I have been convinced that my brain was utterly broken. \n\nVERY sluggish thinking, lack of ideas, lack of critical thinking, lack of basically any thinking that wasn’t pointless rumination over little things I said and did that I regret.  Forgetting information as soon as it’s told to me, not being able to follow even the simplest storylines in shows and movies… Inability to reflect on anything with any sort of depth or creativity. And perhaps most disturbingly: unable to access pretty much any memories of my life, save for a brief “blip”, bits and pieces of memory that are too vague to be meaningful or useful.\n\nBasically, my activities for the past 6 months have been extremely limited due to an inability to THINK. Every second it seems, I lose focus and slip into mindless rumination. Like I’m being completely overwhelmed by automatic negative thoughts, to the point where it’s literally not possible for me to engage with the outside world in any meaningful way. \n\nNow, I know rumination is typical of depression. But from what I understand, many people with depression retain their memories and much of their cognitive abilities despite the mood disorder. Does anyone else have such an extreme cognitive “switch” during depression, to the point where they feel totally and completely impaired like this? \n\nMy brother also struggles sometimes with depression, but he’s still able to engage in activities that require some higher order thinking, such as playing video games. Every time I’ve tried to play video games during my episode I’ve given up because trying to remember the controls and objectives is just way too stressful.",
    "tone_score": {
      "neg": 0.219,
      "neu": 0.654,
      "pos": 0.127,
      "compound": -0.9933
    }
  },
  {
    "text": "I feel like I bother everyone :( I feel so nervous to talk to anyone or ask for help…. And no one seems to really try to understand anyway, I think… I such a failure at everything… there’s no point in me trying anything at this point. I really feel it’s too late for me :( I wish I could run away somewhere where no one would ever find me and never come back… I wish I could rip myself out of my body and escape myself. I feel so trapped… I wish I could start over… and with better circumstances so I wouldn’t have turned out like this in the first place… I’m so lonely and everything makes me cry… I’m too nervous to be around anyone or make friends though… I even have Bumble but I just keep scrolling even if someone seems like they’d be nice because I’m too scared and I’m really boring and have nothing good to say… all I know is my depression and how miserable I am… and I don’t wanna have to make that my personality and that be the topic of all my conversations so I just keep to myself until maybe one day I’m well enough but I don’t think that day will ever come… I’m so tired of everything. I don’t talk to anyone about it anymore. I feel like a shell. Just hollow, dark,  cold and empty. I know people say that only you can bring yourself happiness but I truly can’t do that… I wonder if the people who say stuff like that know that mental illnesses exist.. :( \nAnyway, sorry to bother you guys… I dunno…",
    "tone_score": {
      "neg": 0.185,
      "neu": 0.689,
      "pos": 0.126,
      "compound": -0.9554
    }
  },
  {
    "text": "I'm  (m33)  very lost right now and barely make enough money to survive. \n\nSince I've lost my parents due to cancer, I'm not able to make money.\nNow its Saturday and i have nothing to spend, buy groceries or eat.\n\nHow to change this terrible life.. i mean, what's the purpose if you have nothing and feel down, and you don't have a dime..",
    "tone_score": {
      "neg": 0.188,
      "neu": 0.812,
      "pos": 0.0,
      "compound": -0.9218
    }
  },
  {
    "text": "I feel like someone is holding my whole body under water. I go through phrases where I am okay and then other times I just feel so tired like I have someone physically pulling me down. I don’t remember the last time I genuinely felt happy, everything feels empty, even when I laugh. The only emotion I properly feel is anger and hatred. \n\nI’m 25 now, I first got depression when I was 15 and lost all my hair (alopecia). After a few years of being depressed I was okay again and now I feel like I am slowly being dragged back. The worst part is I know it’s coming and I can’t do anything to stop it.",
    "tone_score": {
      "neg": 0.228,
      "neu": 0.632,
      "pos": 0.14,
      "compound": -0.9125
    }
  },
  {
    "text": "I don't know about you guys but for as long as I can remember now I've been feeling out of myself. What I mean by that is; is that I use to look at the world as an individual. Anything's possible, everything's in reach.\n\nNowadays I look at the world very dissociatedly , everything feels daunting, uncertain, science seems uncertain, sure it's based on fact but there's too much we don't know about things. I'm amazed about how populated this planet is, and how many men and women they're are. None of us truly unique, unless in ways you define it. I kind of look at us like walking penis's and vagina's, we all create life in the same way. To reinforce this idea, I kind of view life in more of a primal sense. We do the things we do based on primal needs, I missed when I didn't think that way.\n\nI'm trying to depict this headspace as accurately as I can. I miss the days where I didn't feel this way, where everything was because it was. I didn't think about these things, I didn't obsess over my future. I just assumed that I was gifted in one space, and everything would work itself out. Now I feel as if I'm wasting my time everyday, and have a insane drive to make something of myself, but no idea where to start.\n\nConstantly pacing in my bedroom, having an idea of the life I want to live, but no blueprint in order to get there. It's insanely frustrating, and anxiety inducing, can anyone relate?\n\nThanks for reading this clusterfuck of an idea.",
    "tone_score": {
      "neg": 0.111,
      "neu": 0.808,
      "pos": 0.081,
      "compound": -0.8607
    }
  }
]